[{"title":"2022-03-19","created":"2022/03/19 23:01","edited":"2022/03/20 14:38","tag":"日記/2022/03","body":"[[Python]]の勉強を始めた。\nこのサイトのノートはそれぞれmdファイルに書いてあり、Obsidianでも扱える形になっている。このサイトに表示するためにはそれらをまとめてJSONにする必要があり、手作業でやるわけにはいかないので、ローカルファイルを扱える言語を習得しようと思った。\nPythonにした理由には特に深いものはなく、「倉下忠憲さんがPythonの話をしていたから」で、とりあえずPythonを使えば望む操作はできそうであると判断した。前に齧っていた[[VBScript]]を再勉強してもよかったけど、まあどうせなら今現在耳にすることのある言語に挑んでみようと思った。\n\n[ゼロからのPython入門講座 - python.jp](https://www.python.jp/train/index.html)で基本を習得。\n[Visual Studio Code でPython入門 【Windows編】 - python.jp](https://www.python.jp/python_vscode/windows/index.html)でVSCodeでの扱い方を理解した。\nあとは[Pythonに関する情報 | note.nkmk.me](https://note.nkmk.me/python/)の中の記事を参照して目的のメソッドを探した。\n\nとりあえず必要なコードは書けたので、これ以上のことはまあそのうち気が向いたらという感じ。\nなんかこう、[[JavaScript]]と比べて書き方があっさりしていて「こ、これでいいの？」という気持ちになった。慣れるとスイスイやれそうな見た目の言語だ。\n\n切り出し\n→[[「コード」という概念を取り込む]]\n→[[Scrapboxとこのサイトの兼ね合い]]\n"},
{"title":"2022-03-20","created":"2022/03/20 10:03","edited":"2022/03/20 23:18","tag":"日記/2022/03","body":"このサイトを作ったことにより、結局Obsidian（的な運用）に戻ってくることになった。\n[[Obsidian]]そのものは他のツールやらブラウザやらを開いている状態だと自分の環境ではちょっと重くて使いづらいので、[[Foam（VSCode拡張機能）]]でVSCodeの特定のワークスペースをObsidian風に設定して使うことにした。\nこの拡張機能すごいなあ。とても便利だ。\n切り出し→[[VSCode拡張機能のハードル]]\n\n[Scripting: ファクトリー機能 - Twitter 開発者ドキュメント 日本語訳](http://westplain.sakuraweb.com/translate/twitter/Documentation/Twitter-for-Websites/JavaScript/Scripting-Factory-Functions.cgi)を参考にしてツイート埋め込みの実装に成功した。\nただ読み込むのに時間がかかるのが難点だな…。実装の仕方の問題というより、そもそもツイート埋め込みは時間がかかるように思う。他の記事を開いた時とかの感じを見るに。\nまあ、やろうと思えばやれるということが確認できたのが最大の収穫で、実際にはツイート埋め込みはそんなにはやらないかも？\nともかく、なんだか複雑だしあんまり意味がわかっていない状態なので、実際実装できると思っていなかった。嬉しい。\n↓埋め込みサンプル\n《https://twitter.com/Foam_Crab/status/1504424363982221316》\n\n\nコードを書けさえすれば自分好みの新たな機能をすぐ追加できる、というのはすごいことだなと実感している。\n例えばこのサイトなら、mdファイルのフロントマターに書いたデータを読み取って処理しているけど、フロントマターに好きなキーワードでデータを書いてそれを条件分岐に使えばいくらでも色々なことができる。\n現時点では、作成日時（created:）、タグ(tags:)、ピン判定（pin:）の三つを使っている。なお更新日時はファイルの更新日時を取得している。\n機能を増やせばいいというものではないのであれこれ複雑にやるのは良くないけれど、カスタマイズする余地が無限にあるという状態はすごいと感じる。\n"},
{"title":"2022-03-21","created":"2022/03/21 09:42","edited":"2022/03/22 19:02","tag":"日記/2022/03","body":"作ったツール、直しても直してもまだ直すところが出てくる。\n世の中のツールが延々バグフィックスしているのを見ていて「どこに直すところがあるんだろう？」と思っていたけど、あるんだろうなあと思うようになった。これよりずっと複雑なら、何かする度にバグもちょこちょこ出るんだろう。\n\n\nラジオで昔聞いたことがあるアーティストの新曲を耳にして、良い曲だなあと思った。\n最近全然歌に親しんでいない。クラシック音楽はだいたい毎日NHK-FMのクラシックカフェを流しているから聴いているけど、歌は聴く機会を作ることがなくなってしまった。超流行った曲はちょっとチェックすることもあるけど、「新しい音楽を知ろう！」というワクワクした気持ちはほとんどない。\nなんだか面倒くさいという感じがする。なんでだろう。もう若くないということだろうか。\n聴覚を空けておかなくて良い一人の時間というのを作りづらいせいもあるかもと思ったけど、一人の時間ができても聴覚を使う気にならない（曲を聴くということを思い出せない）。\nでも偶々初めて耳にした曲が良い曲だと、自分好みの楽曲がどこかで生まれているんだろうなあ、知りたいなあと思う。\nそう思いつつ、やっぱり面倒くさい。\n\n\n切り出し→[[茶の間システムでやろうと思えばできそうなこと]]\n切り出し→[[非明示リンク表示の実装]]\n"},
{"title":"2022-03-22","created":"2022/03/22 11:25","edited":"2022/03/22 22:25","tag":"日記/2022/03","body":"切り出し→[[解らない機能が存在しない、という見通しの良さ]]\n\n\nmdファイルのフォルダをとりあえず「public（公開する）」と「private（まだ公開しない）」に分けた。\n新規ファイルはprivate内に自動で作り、公開して良い状態になったと思ったらpublicに移す。\n書いたけど公開しない方が良いかもと思うファイルはそのままprivateに残る。\nまだ自分用のhtmlは用意していないけど、privateのファイルがかなり多くなるようだったら作ることにしよう。（[[茶の間システムでやろうと思えばできそうなこと]]にも書いた）\n\n\n切り出し→[[ツイートまとめを再度試みる]]\n\n切り出し→[[無鉄砲でないと活動できない]]\n\n\n《https://twitter.com/akira2202_/status/1506044062742179840》\n想像を絶する世界になってしまっている…。\n人生と歴史が失われていく恐ろしさと悲しみがあまりにも大きく、言えることが何もない。\n人間の命令で人間がやった。その愚かしさに耐えられない。\n"},
{"title":"2022-03-23","created":"2022/03/23 11:50","edited":"2022/03/24 12:09","tag":"日記/2022/03","body":"切り出し→[[公開用ファイルの中で非公開の記述を書けるようにした]]\n\n\n「反省しろ！」と人に言う人間が大体反省してない問題。\n「あいつは人を見下している！」と言う人間が大体人を見下している問題。\n「○○は～～すべきだ」「○○は～～に違いない」と言いたい時、どうして言いたいのかをよく考える必要がある。「良識の代弁者」になる義務なんて無いわけで。\n\nFusen.html（自作の付箋ツール）に[[偏愛マップ]]を作り始めた。\n参考：[色んな人の「偏愛マップ」を見てみたい、そしてnoteでマガジンにしてみたい。｜タムラカイ / 変革の仕掛けと仕組みをデザインする人｜note](https://note.com/tamkai/n/n0d450aeb943a)\n紙のノートとかPowerPointとかにも作ったことはあったのだが、前者は画像を貼れない、後者は頻繁に見ないという難点があって折を見て更新し続けるということができなかった。\nFusen.htmlは色々やりやすい。画像も貼れるし動画もmp3も貼れるようにしたし。アウトラインにまとめられるし。一応紙面のサイズも無制限だし（下方向に無限に広がる）。→[[メディア付箋機能を作った]]\n\nで、色々書いているのだが、たくさん書き出しているはずなのに自分が空っぽのような感覚が消えない。\n色々好きなものがあるが、「詳しくない」。「好き」と「詳しい」は別に必ずしもイコールではないと思うが、「なんとなく好き」で十分とは思えない気持ちがある。\nあと「他に好きなものがあったはずだが」という気分も大きい。これだけのはずがない、という気持ち。どこか的を射ていない感覚。\n他にもあったはずだというのは列挙を続ければいつかは納得する地点に辿り着くかもしれない。しかし「詳しくない」の方は解決しない気がする。詳しくなりたいと思っていないので。\n"},
{"title":"2022-03-24","created":"2022/03/24 12:08","edited":"2022/03/25 22:59","tag":"日記/2022/03","body":"[Twitframe - Embed Tweets in an iframe](https://twitframe.com/)によるTwitterのiframe埋め込みテスト\n<iframe border=0 frameborder=0 width=100% height=300 src='https://twitframe.com/show?url=https://twitter.com/Foam_Crab/status/1491247903267966976'></iframe>\nこっちの方が断然楽だな…。\nしかし、外部サービスに頼らないコードを既に書いているので、茶の間では従来通りで行くことにしよう。\nFusen.htmlの方では茶の間で使っているコードを使うとえっらい大変なことになる感じがするのでTwitframeに頼る。\n"},
{"title":"2022-03-25","created":"2022/03/25 10:18","edited":"2022/03/25 23:30","tag":"日記/2022/03","body":"言葉選びが適当というのは、言葉選びが適当なこと自体が悪とは言えないけれど（速く伝えたいがゆえの場合もある）、言葉選びが適当な人が他のことなら慎重であるとは思い難いので、人間性を信用されにくい要因にはなるだろう。\n\n\n[[偏愛マップ]]を引き続き書いているが、書いても書いても納得しない。自分の核を取り出せていない感じがする。\nそもそも、核になるような何かはあるのだろうか？\n「これ」と指し示せる何かがあってほしいと思って探しているが、本当にあるだろうかという気持ちになっているし、少なくとも特定の名詞ではないような気がする。\n分野ではなく概念で括っていく必要があるかもしれない。\n\n\nJavaScriptの勉強を始めて以来、自分の時間をつぎ込んできたのでDynalistの中身が整理されずにぐちゃぐちゃになっていた。\n今日久々に片付けた。ちょっと面倒だったが、Inboxは空になったしスッキリした。\n\nJavaScriptやTypeScriptについて知りたいことはまだまだあるし、今日新しい教材を読み始めもしたが、このサイトを作ったことで一応一段落ついた。\nこのサイトを作ったら書き込もうと思っていたことがたくさんある。ツイートした話を後でまとめて追記しようということも考えていたし、それらを書き込んでリンクを作っていくのが楽しみになっている。\n\nブログも書かないとと思っている。書いていない間の心境というのはその時その時で違っているのだが、現在は「これ終わったら！！！書く！！！」という感じ。書きたいけど書けないとか書かなきゃいけないけど面倒くさいとかいう感じではない。そういった気持ちを打破する記事を書いたし、書いたことで打破された。\n大抵のもやもやは「よくわからないけど、なんとなく嫌なところがある」という曖昧さが元で手足に纏わりついて枷になっている。何がどうなっているのかを整理してしまえばまとめて置いておくことができる感じがある。\n\n\n切り出し→[[堂々たる様相に気圧さるるべからず]]\n"},
{"title":"About茶の間","created":"2022/03/18 22:01","edited":"2022/03/23 11:52","tag":"お知らせ","body":"このサイトは[[のらてつ／Noratetsu]]のミニブログ的なものです。\nTwitterとScrapboxの間のような位置づけで書いていきたい気持ちがあったので自作しました。\n詳しくは[[コンセプト]]へ。\nここに書いたことは[Noratetsu Lab](https://noratetsu.blogspot.com/)に投稿する可能性があります。\n一日～数日に一度更新します。\n\n←左列（スマホ表示では右に移動）\nピン：\n　常にアクセスできるようにしているノート群と各種ピックアップ機能\n\n分類タグ：\n　ノートの内容を分類した一覧\n　タグ名をクリックすると中身をメイン画面に表示\n\n\n→右列\nリンク/バックリンク：\n　「>>」はリンク、「<<」はバックリンク\n　「>>」の子項目になっているのは2ホップリンク（Scrapboxの機能を真似ています）\n　青字はノートが存在、赤字は空リンク\n　緑字の「<<」は「リンクにしていないが現在表示しているノートタイトルへの言及があるノート」のリンク\n　緑字の「>>」は「このノートではリンクにしていないが他のノートがリンクにしているワード」へのリンク\n","pin":true},
{"title":"Card.htmlの思想","created":"2022/02/16 01:04","edited":"2022/03/23 11:09","tag":"開発日誌/Cards","body":"（思想と言うのは大袈裟だけども）\n自作ツールの[[Card.html]]について。（[Cards.html - Noratetsu's Room（のらてつ研究所）](https://scrapbox.io/noratetsu/Cards.html)）\n![ver2.0](https://gyazo.com/a9f04267e139195a48f07b5ed4f090af/max_size/1000){max-width:100%}\n\n[のらてつ(@Foam_Crab)/2022年02月16日 - Twilog](https://twilog.org/Foam_Crab/date-220216/asc)\n「位置づけられない（≒アウトライナー向きでない）」かつ「情報カードに書くには小さ過ぎる（≒Scrapbox向きでもない）」タイプのメモを置いておきたいと考えている。で、眺めていて頭の中で膨らみ次第すぐScrapboxに行けるように色々工夫する。\n\n逆に「位置づけられる情報」や「情報カードに書けるサイズの情報」はここに置いてもしょうがないので書かない。優先順位としてDynalistとScrapboxの方が高く、それらではしっくり来ないものだけここでキャッチする。\n\n何度も何度もExcelを細かいメモ置き場にしようとして断念してきたんだけど、ビューワを作ることで結局かつてやろうとしていた形式そのまま復活させようとしている。\nテーブルは情報を格納する形式としては良いけど人間である私に優しくない見た目なのが良くない。でも情報を私に優しい見た目で配置すると情報として扱いづらい。テーブルに格納して私に優しい見た目に変えるのが理想なのだと思う。\n\n小さいメモだけどInboxではない。むしろ何段階も判定してなお行き場がないメモが最後に辿り着く場所として考える。何しろ書き込むのが面倒くさくて、手間と言うほどではないけどサッとは書けない。摩擦ゼロで書けてしまわないほうが良いと思う。\n\nまだ価値の確立していない小片であることから、CSVよりめんどい形式は継続可能性の面で難がある（Excelもめんどい、バイナリだし）。プレーンテキストでやれるのが、書かれる情報にとって身の丈に合ってる感じがする。\n"},
{"title":"Scrapboxとこのサイトの兼ね合い","created":"2022/03/20 11:48","edited":"2022/03/23 16:52","tag":"前に進む/表現の手段","body":"このサイトを作ったことにより、必然的にScrapboxの公開プロジェクト（[Noratetsu's Room（のらてつ研究所）](https://scrapbox.io/noratetsu/)）の位置づけは変わるだろうという感じがしている。\n\n以前、[Scrapboxには自分という人間が表れていてほしい - Noratetsu's Room（のらてつ研究所）](https://scrapbox.io/noratetsu/Scrapbox%E3%81%AB%E3%81%AF%E8%87%AA%E5%88%86%E3%81%A8%E3%81%84%E3%81%86%E4%BA%BA%E9%96%93%E3%81%8C%E8%A1%A8%E3%82%8C%E3%81%A6%E3%81%84%E3%81%A6%E3%81%BB%E3%81%97%E3%81%84)ということを書いていたのだが、これを果たして本当にScrapboxで実践できるのだろうか、という気持ちが付き纏っていた。結局実践できなかったのだが、つまるところ、Scrapboxは「開きすぎている」という感覚があった故だろうと思う。\n[[コンセプト]]にも書いたが、私はそもそも断片化を拒否する感覚がある人間なのに、言うなれば断片化そのものであるScrapboxを自分自身を表現するものとして使えるはずはなかった。情報をパーツ化して扱うという意味ではScrapboxは大変に優れたツールで、非公開プロジェクトをいくつも作って毎日愛用しているものなわけだが、Scrapboxという「場」でやろうとしていたことが私にとっては間違っていたのだ。\n例えばこういう文章をScrapboxに書いた場合、場の特性の話として、一部分を引用されて言及されるということが普通に起こり得るわけだが、正直なところ、その部分だけを引用されることは私にとってあまりメリットがない。問題提起をしているのでもないし、意見を求めているのでもない。大抵の場合、書き手の意図は無視される。最初は尊重されていたとしても、その空気が消え去るのは時間の問題なのである。断片化とはそういうことだ。\n「適切に断片として使い回されること」を目指すべき内容を書くことに向いているのであって、「自分という人間を少しずつ語る」ということに使うのは無理があった。\n\n「自分という人間」を表すのを抑えたとして、Scrapboxの公開プロジェクトに何が残るだろうか。\n今のところ、最もしっくり来ているのは「UserCSSのコードを置いておくこと」だが、そもそもCSSに詳しい人間でもなし、それがメインのコンテンツになるというのはなんとなく変な感じがする。\nそう思ってみても、あまり「これ」というイメージは思い浮かばない。\n元々の関心事を思い返すに、知的生産（についての知的生産）的な話題をどう書いていくか、ということをきちんと考えるべきなのかもしれない。\n"},
{"title":"VSCode拡張機能のハードル","created":"2022/03/20 15:12","edited":"2022/03/20 18:05","tag":"前に進む/デジタルツール","body":"少し前まで、[[VSCode]]の拡張機能は複雑そうに感じられて、インストールするだけで効果を発揮するものを除いては設定方法を調べて活用するところまで辿り着かなかったのだが、今はそんなに億劫な感じはしない。[[Foam（VSCode拡張機能）]]の設定はそれなりに複雑だし解説は全て英語だが、頑張ってみるかという気持ちになる。\n[[「コード」という概念を取り込む]]で書いたこととも繋がるが、これもまた「拡張機能という概念の難しさ」と「英語に対する拒否反応」の二枚の壁に阻まれてのことで、デジタルの何かというのは常に「壁が二枚」の苦しさがある。一枚なら突破できるが、二枚となると辛い。心が萎れてしまう。\n\n今回突破できたのは、まず[[JavaScript]]の勉強を始めてから二ヶ月弱の間ひたすらVSCodeを使っていたこと、そして[[Python]]の勉強の過程で「ターミナル」を理解したことによるだろうと思う。拡張機能とターミナルとは直接関係ないが、VSCodeに備わっているよくわからない機能その１であるターミナルを突破したことで、よくわからない機能その２の「拡張機能ごとの設定」に挑む力が湧いたという感じがする。\n\nコマンドパレットを開いて何かしら打って機能を呼び出す、ということに馴染むまでにやたらと時間がかかっている。\n目視でファイルを探すスタイルから検索バーに打ち込んでピックアップするスタイルに変わるのにも相当時間を要したが、何かを取り出すにあたって「キーワード」を使うというのがなかなか身体的に馴染まないようだ。モノも情報もシステムも物的に認識していて、常に視覚情報をキーとして探してしまう。\nそれは基本的には「慣れ」の問題であるのだが、ただ、自分の中で「文字情報の記憶」と「視覚情報の記憶」とで信頼性が大きく違っているということも大きい。なので先に「目で見る」を使おうとしてしまう。文字列を探すにしても、その文字列を文字列として思い出すのでなく、まず目で見るという作業を開始してその中に文字列を発見しようとする。直に思い出すよりも視覚でサーチしたほうが速くて確実に思えてしまうからだ。\n\n検索を習慣づけるにあたっては、少し別の角度から[Noratetsu Lab: Scrapbox日誌：「整理したい病」には「放置」が効いた](https://noratetsu.blogspot.com/2022/01/Scrapbox01.html)でも書いたが、結局は「諦める」ということによって移行したように思う。\n信頼性の差異について自分の認識を改めたのではなく、「信頼性がどうあれ、無理な作業はできない」ということで諦めた。\nコマンドパレットに関しては、最初からコマンドパレットで呼び出す以外に方法はない。よって、そうと分かれば諦めるしかないのだが、そうと分かること自体が億劫だったのでなかなか「さっさと諦める」というところに至らなかった。\n\n今何の拡張機能がインストールされていて何を打てば何ができるのかがよくわからなくなっているという問題もある。別にたくさんインストールしているのでもないのだが、視覚的に把握できない感じになってくると急に「よくわからない」という気持ちになってしまう。\nまあでも、コマンドパレットを開いてスクロールすれば一応目視で全部探せるわけなので時々眺めてみればいい話か。今なら「そうすればいいよね」とすんなり思うが、VSCodeが巨大なブラックボックスのように見えていた間はそうすればいいという発想にならなかった。\n"},
{"title":"「○○の気持ちしかありません」","created":"2022/03/19 12:50","edited":"2022/03/19 21:56","tag":"こだわる/言葉遣い","body":"「感謝の気持ちしかありません」「尊敬しかありません」\n嘘をつくな、と思う。\nいや、そう言いたくなるほどであるということが真実なのはわかるし、それを否定する気はない。\nしかし「そう言いたくなるほどである」と「そうである」は異なるということは意識される必要があると思う。厳密に言って、その気持ちしかないわけがない。コンピュータじゃないんだから。\n\n一方で、「○○の気持ちでいっぱいです」と言った場合は、他のものも多少あるかもしれないが、それ以外の圧倒的に大きな範囲をそれが占めているということを示している。これは（意図して騙っているのでない限り）嘘にはならないだろう。\n\n言い換えると、「意味」を示す文言を別の「意味」の隠喩として使うのは良くないという気持ちがある。その使い方は単なる不正確さと区別がつかず、比喩として解釈できるのは意識的に好意的に見た場合に限られる気がしている。\n"},
{"title":"「コード」という概念を取り込む","created":"2022/03/20 11:04","edited":"2022/03/22 17:58","tag":"前に進む/プログラミング","body":"少し前までプログラミングには苦手意識が強くあったが、プログラミングのどの部分に苦手意識があるのかというのは結構複雑なものである。\nプログラムを「組む」ことが難しいのか、「言語」に拒否反応を起こしているのか。\n昔挑んだ時には、for文などが当時うまく飲み込めなかったこともあり、プログラムを組んでいくことに己の無能を感じていた。\nしかし今考えると、私はまず外国語が苦手で、英語に至っては苦手というよりもはや「嫌い」の域にあり、アルファベットの羅列にも気分が悪くなる。その状態でプログラミングのコードを見た時、到底ワクワクした気持ちにはなれない。よくわからないものが、嫌いな感じの見た目で書かれている。如何にも習得は無理そうである。\n\n[[Scrapbox]]を使い始めてUserCSSを書くことに挑戦しだしてから色々変わったということは過去にどこかに何度も書いているが、「見た目を変えられる」という明快なワクワク感に引っ張られて「コードを書く」ということに馴染んでいったのが変化の核にある。\nマークアップ言語（およびスタイルシート言語）とプログラミング言語は異なるものだが、いずれにせよ「日本語ではない」「人間がコミュニケーションに使う言語ではない」ということは共通しており、つまるところそこに障壁があったのであって、マークアップ言語を攻略したらプログラミング言語も攻略できるようになったということだ。\n\n具体的には、\n\n（昔[[VBScript]]と[[VBA]]をちょっとだけ齧った）\n　　　↓\n[[CSS]]を見様見真似でいじる\n　　　↓\n[[HTML]]をきちんと勉強する\n　　　↓\nCSSをきちんと勉強する\n　　　↓\n（[[Mermaid.js]]をちょっと齧る）\n　　　↓\n[[SCSS]]を習得する\n　　　↓\n[[JavaScript]]を勉強する\n　　　↓\n[[Python]]をちょっと齧る\n\nという経路で少しずつ「コード」という概念を自分に取り込んだことになる。プログラミング言語に挑んだのは（かなり昔にVBScriptを齧ったのを除けば）ここ7週間ほどのことだが、今Pythonの入門用解説を読んでみて随分気分が変わったなと実感している。いつの間にか「わかるはずだ」と思えるようになった。もちろんプロフェッショナルにはなれそうにないが、「全くわからないというはずはない」という感覚がある。実際、読めばわかるようになった。VBScriptと苦闘していた当時と今とで自分の賢さ的なものが大きく変わったとは思えないが、理解できる領域は劇的に拡大している。\n\n一般的に、プログラミング言語の習得を考えた時、階段の一段目としてマークアップ言語やスタイルシート言語を想定することはあまりないのではないかと思う。私自身、振り返ってみればそうだったなと思うだけで、プログラミング言語を習得したい人にCSSを勧めようとは考えない。JavaScriptの勉強をしたいというのならば実際問題HTMLとCSSを知らないとやれることがなくなるので「まずHTMLとCSSだね」とも言えるが、サーバーサイドの言語ではそれらはほとんど関係がないだろう。\nしかしながら、私がPythonを理解するにはCSSからスタートすることが必要だった。\n\n何かがネックになっているという時、本当は何がネックなのかを炙り出すのは恐らく容易でない。\n"},
{"title":"のらてつ／Noratetsu","created":"2022/03/22 17:54","edited":"2022/03/22 18:53","tag":"お知らせ","body":"![アイコン](https://gyazo.com/8e76071e5281e7396c84c83d32554939/max_size/1000){width:50px;}\n\n他の発信場所へは[[投稿の場]]または右上のリンクアイコンからどうぞ。\n\n\n<h3>関心事</h3>\n自分の無意識の訴えをキャッチするにはどうするか\n自分の人生を邪魔してくる存在・概念を自分の人生から退けるにはどうするか\n知的生産についての知的生産（情報管理、文章術など）\n"},
{"title":"アウトラインビューワを考える","created":"2022/03/21 16:56","edited":"2022/03/22 17:52","tag":"前に進む/デジタルツール","body":"《https://twitter.com/Foam_Crab/status/1494995251764727814》\nこう呟いて、結局即日メタデータを持つ[[アウトライナー]]を作り始めた。\n→[Outline.html - Noratetsu's Room（のらてつ研究所）](https://scrapbox.io/noratetsu/Outline.html)\n名無しという意味で[[Outline.html]]と適当に名前をつけた。\n\nスキルゼロからスタートした割にそれなりのものができた。獲得した経験値は膨大である。これによって付箋ツールもさっと作れたしこのサイトも然程苦労せず構築できた。\nしかし「エディタ」の機能を持たせるというのはおそろしく大変である。バグが怖い。確認できたものは頑張って全部潰したものの、まだどこで何があるかわからない。\n\nで、今この「のらてつの茶の間」を作って思ったのだが、このアウトライナーはエディタじゃなくてビューワに徹した方が良かったのではないだろうか。\n前提として、アウトライン操作をするものとして現在常用しているDynalistに不満は何もなく、私が欲していたのは「見るものとして、メタデータによって情報が整頓されているアウトライン」なのである。\n格納されている情報によってアイコンが変わったり色が変わったり、様々な（自分好みの）視覚要素で情報を把握できるものが欲しかった。つまり「アウトラインプロセッサ」ではなく「[[アウトラインビューワ]]」である。\n\nこれを作っている時は「localStorageを使えばエディタを作れる」というワクワク感があったので当然のようにエディタ作りに挑んだのだが、今だったらMarkdownで書いたものをすごく良い感じに表示する何かを作ろうとするだろう。\nもしデータを完全なるプレーンテキストで用意しなければならないとすれば、やっぱりエディタを作った方が…ということにもなるのだが、Markdownならかなり綺麗な形でプレビューできるし、出来上がりをイメージしながら直感的にデータを作ることができる。\n少し前までJavaScriptしか使えずローカルファイルの処理を選択肢に入れられなかったため、Outline.htmlを作っていた時にMarkdownを使うということは全然思いつかなかった。\n\n今思いついたので具体的にどうするかはまだ考えていないが、「操作するアウトライン」とは別に「見るためのアウトライン」を私は欲しているので、何か作れないかと思っているところである。\n"},
{"title":"コンセプト","created":"2022/03/18 22:12","edited":"2022/03/21 09:51","tag":"お知らせ","body":"このサイトのコンセプトについて。\n\nメインテーマは「個人の総合的な表現」で、その一環としてデザインしています。（出典：[個人の総合的な表現 - Word Piece](https://wordpiece.hatenablog.com/entry/2021/12/03/233555)）\n言い換えると「他者による断片化」の拒絶でもあります。\n細かいノートで構成されていますが、それは私にとっての断片であり、他者から見た時にはそれらによってひとつの何かが形成されているようであってほしいと思っています。\n\nノートの内容はいわゆる「つぶやき」的なものになるようにしていきます。Twitterに書くには長く（あるいはタイムライン上で人の目に入れたいものではなく）、Scrapboxに書くには断片度合いが高い（あるいはさくさく共有されたいものではない）という類の文章になるでしょう。\nコンセプトなどと言って語っていますが、そう語るほど大層なものにはなりません。\n\nなお、断片であっては困るものはそれなりのサイズの文章にして[Noratetsu Lab](https://noratetsu.blogspot.com/)に投稿します。\n\n\nその他、時代の流れに逆行することで自分にとって自然体な場所を作ろうとしています。\n\n今は動画や音声の時代だ。\n→文章だけでいきます。\n\nリアルタイムな発信が常識になっている。\n→私が不定期にGitHubにプッシュした時点でそこまでの分の更新がまとめて反映されます。\n\n優れたツールが世の中にたくさんあり、それらを使いこなすのが器用な生き方だ。\n→もう2022年ですがHTML他を自分で書いてホームページを作りました。\n\n時間は貴重だから通知やRSSで更新をキャッチできる形が望ましい。\n→Twitterを含め更新を知らせることはありません。\n\n検索で目的の情報にピンポイントでさっとアクセスできるのが効率的だ。\n→検索機能はつけません。\n\n一部分をさっと共有できるのが情報の扱いとして都合が良い。\n→各ノートごとにURLは発行しません。共有ボタンもつけません。\n\n複数人で集まって意見交換しながら考えたほうが良い。\n→それは大事ですが、一人でやる領域も死守したいという気持ちがあります。\n\nこれらのことを満たした情報発信をしたい時はそういう場を借り、そうでないものをここに書くということです。\n\n余談：激流の中の岩のイメージに憧れがあります。\n","pin":true},
{"title":"ツイートまとめを再度試みる","created":"2022/03/22 21:33","edited":"2022/03/22 21:35","tag":"前に進む/デジタルツール","body":"以前[ツイートまとめを作るということ、を整理する - Noratetsu's Room（のらてつ研究所）](https://scrapbox.io/noratetsu/%E3%83%84%E3%82%A4%E3%83%BC%E3%83%88%E3%81%BE%E3%81%A8%E3%82%81%E3%82%92%E4%BD%9C%E3%82%8B%E3%81%A8%E3%81%84%E3%81%86%E3%81%93%E3%81%A8%E3%80%81%E3%82%92%E6%95%B4%E7%90%86%E3%81%99%E3%82%8B)にまとめたが、「ツイートをするはいいがなまじ自分にとって良い感じのことを書いてしまうせいでその後どうしたら良いか悩む問題」に長らく頭を抱えていた。最近はもうすっかり放置してしまっていたが、このサイトを作ったことによりツイートまとめをやりやすくなったと思う。\n\nツイートというのはかなり微妙なもので、ひとつひとつ断片でありながら、背景に何かしらの流れがあるので、単体では扱いにくいという性質がある。単体で取り出してもいいにはいいのだが、それだと意味が半減するというか。\n\nそもそも「ツイート」という形をとってしまうのは、自分の内外にある大きな何かを前提としてそれに対してコメントしようとするからということが多い。タイムラインから切り離して保存したり活用したりするためにはその前提をくっつけておく必要がある。それが結構な手間になる。取り出さないでおけば前後からなんとなく判るものが、取り出してしまうと何のことだかわからなくなったりする。その前提というのが単に「○○について」と言えるようなものなら話は簡単だが、複合的に生じた気分みたいなものが前提にある場合にはそれを言語化し直すのが大変だ。\nその文脈を整理し直すとして、それは自分にとっては意味があるが、他人にとって意味があるかというと微妙である。読み物として面白いように整えれば問題はないが、ただアウトラインの形で置いておくとただ冗長になってしまう。\n\nScrapboxでツイートまとめをやろうとした時の最大の問題は、「良い感じの発想だから公開の場に置いておきたい」と「そこまでではないけど場を分けるのも手間なので公開の場に置こうかと思う」と「これは置いておくのは微妙だから非公開の別の場所が必要」といったふうに、ツイートとして一度公開しているものでありながらその後どうしたいかがそれぞれ異なるという点にあった。\nこういう差が生じることについてはどうしようもないと思う。「流れてしまうものだから言える」とか「特定の人が読むことを前提にしたものだからツイートすることに意味があった」とか、色々な前提があってツイートは生まれている。それを別の場所に移して別の文脈で読まれた時、望ましくない解釈が発生することを予期せざるを得ない場合はある。\n\n自分にとって必要だから言いっぱなしで失われないようにどうにか捕まえておきたいのだが、それを公開したい場合があるがために迷いが発生していた。\nこのサイトを作ったことに伴い、公開と非公開を簡単に切り替えられて且つ一緒に管理できる形態になったので、ツイートを見直してノートを作るということはかなりスムーズになると思う。\n"},
{"title":"メディア付箋機能を作った","created":"2022/03/24 11:32","edited":"2022/03/24 19:44","tag":"開発日誌/Fusen","body":"Fusen.htmlの機能追加。\n今までは「画像付箋」としていたのを「メディア付箋」にした。\n設定するアドレスのホストや拡張子で条件分岐して色々表示させることができる。\n\n<h3>現在貼れるもの</h3>\n画像\nYouTubeの動画/再生リスト（埋め込み可能な動画のみ再生可）\nmp3、m4aファイル\nmp4ファイル\nツイート（Twitframeでiframe埋め込み）\n\n\nPDFも普通に埋め込めるかな。といっても表示が小さすぎて現実的じゃないか。\nあとあんまりあれこれ貼ると重くなりそう。\n"},
{"title":"不機嫌な人は恨みを表現できなかった人","created":"2022/02/11 00:21","edited":"2022/03/23 16:49","tag":"生きる/自意識との折り合い","body":"恨みを晴らすことを封じられた場合、全く関係ないことにその恨みを乗せて怒り狂うことになる。\nもし文学や芸術の形で昇華することを覚えていれば、その都度恨みを見つめて整理され、「全く関係ないこと」に対して恨みを発動することはなくなるような気がしている。恨みは消えないとしても。\n\n恨みを封じたままでいると、封じなくて良いと判断した瞬間に全部をぶちまけてしまうし、他のものまでぶちまけているということに自分で気づくことができない。周りからすれば気の狂ったモンスターである…。しかも、いくらぶちまけても「ぶちまけるべき相手にぶちまけた」のでなければそのぶちまけたものは再びその人の中に戻っていき、別の機会にまたぶちまけられることになる。相手を間違えている限りスッキリすることはない。本当の相手に対する恐怖が残っていれば、いつまでも相手を間違え続ける。\n\n封印を強いられたことは当然不本意であり、その理不尽に抵抗できずに屈したために封じたままになっている。その不本意さ情けなさと絶えず戦い続けているせいで、凌駕できそうと思った瞬間に吠えてしまう。しかしその時周りにいるのは、その理不尽とは関係のない人々なのである。\n\n―――\n\n[のらてつ(@Foam_Crab)/2022年02月11日 - Twilog](https://twilog.org/Foam_Crab/date-220211/asc)\n機嫌の悪さをあからさまに外に出す人、勝手に機嫌悪くなって勝手に直って平然と何事もなかったように周りと話すのどういう神経してんだろうと思ったけど、昔私自身がちょっとおかしかった時は自分もそうだった気がすると思い直した。自分の感情の暴走で手一杯で他人のメンタルなんかどうでもいい状態。\n\n機嫌の悪さを外に出す時って、世界に対して人生通して抱えた恨みに被せていた蓋が外れた状態で、その瞬間に不満に感じていることそのものは自分にとって大して重大ではないように思う。だから蓋が閉まればあっさり機嫌良くなったりする。そしてひょんなことでまた蓋が開いて憤懣の権化と化す。\n\n本人としては今この瞬間に不満に感じていることに対して本当にけしからん許さんと思っているわけだけど、そこまでけしからん許さんと感じるものって実際には明確な侮辱くらいしかなく、そうでなければ今目の前にあるもの以外に対する恨みまでもを今のものかのように余計に爆発させている状態だと思う。\n\n自分を害する存在に抵抗できなかった情けなさをいつまでも引きずって、事あるごとに晴らさんとして「私を不快にさせる存在を私は許さないんですよ！」とアピールする。それを言い聞かせるべき相手は自分自身以外にないのに、自分の劣等感とは何ら関係のない他の人間に伝えようとすればそりゃあ迷惑。\n"},
{"title":"使っているツール","created":"2022/03/21 11:09","edited":"2022/03/22 20:41","tag":"前に進む/デジタルツール","body":"（途中）\n書いたものをアウトプットする場については[[投稿の場]]へ\n\n<h3>[[Dynalist]]</h3>\n日記・日誌\nとりあえずのメモ\n引用集\nマニュアル類\n\n<h3>[[Scrapbox]]（private）</h3>\n情報を集める\nAtomicな思考のリンク（Markdownに移行する可能性あり）\nブログの構成を練る・書く\n\n<h3>[[Fusen.html]]（自作）</h3>\n頭の中の洗い出しや調べ物\nメインの場になりそう\n\n<h3>[[Card.html]]（自作）</h3>\nタイトルをつけられない且つ育ちそうなアイデアのメモ\n\n<h3>[[Outline.html]]（自作）</h3>\n引用を集めて資料をつくるアウトライン\n\n\n<h3>VSCode with Foam</h3>\n[[Foam（VSCode拡張機能）]]で[[Obsidian]]風にmdファイルを扱う\n書いたものはこのサイトに反映\n\n\n"},
{"title":"公開用ファイルの中で非公開の記述を書けるようにした","created":"2022/03/23 15:23","edited":"2022/03/23 15:30","tag":"開発日誌/Chanoma","body":"特定の記号を前後の行に置くとJSONを生成する際にその間がスキップされるようにした。\n公開したくない記述も公開するmdファイルの中に書き込むことができるようになった。\n\n例えば日記ファイルの中に、個人名を含む記述を書くとか、ちょっと感情的なことを書いてしまうとか、そういうことができるようになる。\n念の為公開前にデータをチェックする必要はあるが、情報を分けずに済むのでかなり楽になると思う。\n非公開ファイルへのリンクもその中に書いて、自分用のビューワ（ローカルファイル）ではスキップしないでおくという手もある。\n"},
{"title":"凡例","created":"2022/03/18 16:27","edited":"2022/03/20 18:10","tag":"","body":"以下をJavaScriptで処理してHTMLタグに変換\n\n外部リンクはMarkdown記法\n[Noratetsu's Room（のらてつ研究所）](https://scrapbox.io/noratetsu/)\n\n画像はMarkdown記法+{}内でスタイル指定可能\n![画像](https://gyazo.com/8e76071e5281e7396c84c83d32554939/max_size/1000){width:100px;}\n\n引用はScrapbox風の記法（夏目漱石『草枕』冒頭）\n[>山路を登りながら、こう考えた。\n智に働けば角が立つ。情に棹させば流される。意地を通せば窮屈だ。とかくに人の世は住みにくい。\n住みにくさが高じると、安い所へ引き越したくなる。どこへ越しても住みにくいと悟った時、詩が生れて、画が出来る。]\n\n《ツイートURL》でツイート埋め込み（生成に時間がかかる）\n《https://twitter.com/Foam_Crab/status/1505159525334020098》\n"},
{"title":"堂々たる様相に気圧さるるべからず","created":"2022/03/25 23:09","edited":"2022/03/25 23:32","tag":"生きる/自分を守る","body":"[のらてつ(@Foam_Crab)/2022年03月25日 - Twilog](https://twilog.org/Foam_Crab/date-220325/asc)\n堂々とした感じの人がなんか言うと反射的に「そうかもしれない…」と考えだすの、半ば本能な気がするし仕方がないことかもしれないけど、単に「堂々とした感じ」に気圧されているだけではと思い直す習慣は持っておいた方がいいよねと思う。\n堂々としているだけあって確かにその通りなのかもしれないし、威圧がまかり通ってきただけで別に妥当な言い分じゃないかもしれない。それは内容を客観的に見て判断しないといけない。\n客観的にというか、堂々としている感を差し引いてそれでも頷けるかどうかというか。自信なさげに弱々しく言われても「その通り！」と思えるか。\n\n―――\n自分よりちゃんとしてそうな人の意見に不安を覚え反射的に靡いてしまうのは、自分が愚かであるかもしれないことに耐えられないからだろうと思う。\nなるべく早急に愚かさを矯正してしまいたい。なので「そうかも」と思って自分の意見をすぐさま点検して軌道修正してしまう。\n\nもちろんそれは自省の機会なのであって、軌道修正が妥当な場合は多々ある。立派な人を敬い、話を聞いて内省するのは生きる上で大切なことである。\nしかしながら、「尊敬の念」ではなく「語気の強さ」に屈してすぐさま自分の方を曲げてしまうのはよろしくない。相手が何者であろうが敢然と立ち向かうべき場合もある。\n誰かを反射的に自分の上に置き、反射的に自分を曲げてしまう、そうする度に「自分はそうした」という経験が蓄積されていく。自分以外の強そうな誰かに屈するのが習慣になる。\n\n自分の考えを改めることに抵抗する必要はないが、ざわざわした気持ちで焦って軌道修正してしまおうとせず、沈思黙考の末「確かにそうだな」と納得することが自分の精神のために必要なことだろうと思う。\n"},
{"title":"意見交換の前に言葉を吟味する","created":"2022/02/27 08:50","edited":"2022/03/21 10:10","tag":"こだわる/言葉遣い","body":"言葉選びが下手くそで話の対象が本人の意図より広くなっている場合には話を進めるより言葉選びの吟味から入らないと議論自体が無駄になる。（[自ツイ](https://twitter.com/Foam_Crab/status/1497720549685882882)）\n\n自分が選択した言葉が自分の頭の中にある像を正しく示しているのか、言葉を発する度に点検する必要がある。\n相手がよくわからないことを話し始めたと思った時は、自分の提示が失敗していると考えて「この言葉を双方どういう意味で捉えているか」を確認し合わないと労力の空費になってしまう。\n"},
{"title":"投稿の場","created":"2022/03/21 22:00","edited":"2022/03/22 18:57","tag":"","body":"<h3>Blogger</h3>\n[Noratetsu Lab](https://noratetsu.blogspot.com/)\n断片化し得ない何かを頑張って言葉にする\n\n<h3>Scrapbox</h3>\n[Noratetsu's Room（のらてつ研究所）](https://scrapbox.io/noratetsu/)\n断片化して活用するのが望ましい何かを置いておく\n\n<h3>のらてつの茶の間（ここ）</h3>\n[のらてつの茶の間](https://nora-tetsu.github.io/Chanoma/)\n「情報」ではない表現をちまちま書き溜める\n\n<h3>Twitter</h3>\n[のらてつ (@Foam_Crab) / Twitter](https://twitter.com/Foam_Crab)\n何かに対する感想とか　感情を含むものとか\n\n<h3>note</h3>\n[のらてつ｜note](https://note.com/noratetsu)\nほぼ休止\n共感が発生するような何かを投稿したいと思っていたが…\n"},
{"title":"敵が存在する以上対抗し得るだけの味方が必要","created":"2022/02/23 10:39","edited":"2022/03/23 16:50","tag":"生きる/自分を守る","body":"[のらてつ(@Foam_Crab)/2022年02月23日 - Twilog](https://twilog.org/Foam_Crab/date-220223/asc)\nなんかこの頃「あの人（※複数）が自分の言動を批判してくるかもしれない」ということを考えてしまうことがとても多い。そして必然的に「そう言われたらこう反撃してやる」まで考える。なんでだろう。\n対処としては「書く」かパンダかというのはこの間も書いたけど、そもそもなんで増加しているのか。思い当たることがない。\n危害を加えられる可能性を考えるのはもはやデフォルトで、心安らかにするには止まらずに書き続けていないと駄目ということだろうか…。\n\n「楽しいことで気を紛らす」はそんなに効果がない。危害を加えられる可能性を考えてしまうのは自分の気分の高低とは関係がないような感じがする。今楽しいけど空想は減らない。\n<u>「何かの可能性を考える」が四六時中onになっていて、「何か」の部分に特に指定がないとデフォルト値として「自分にダメージを与え得るもの」を考えてしまう</u>という感じな気もする。で、「何か」は創造性が高ければデフォルトに戻らずに済み、そうでもないものは思考に中断が発生してしばしば戻る。\n\nなんかでもこれって「もし相手が意識を向けてきたら実際そうなる」というタイプの予測だから、「意識を向けてくる」の確率が低いだけで、意識を向けられさえすれば当たってしまうんだよな。ロシアンルーレットに怯えるのと同じで、銃が偽（＝被害妄想）なのではなく弾が入っていれば本当に発砲される。\n「ほらやっぱり」を幾度も繰り返しているから、自衛のために自動的に働くその予測をやめるのは難しい。\nどうにかできるとすれば「批判されたらダメージを受ける」ということの方かもと思うけどこっちはこっちで本当にどうにかできるものなのかわからん（ここまでの人生でどうにもなっていない）。\n\n好意的でないことを書かれたときに受けるダメージって好意的でないことそのものではなく「好意的でない受け取り方によって望ましくない印象を持たれ、それを発信された上に第三者にそれを読まれる」という一連によって<u>真意から高速で遠ざかる絶望感</u>によるものであって、心の弱さとはもはや別では。\nどうでもいい人間（文字通り「どうであってもいい」他者）にどう思われようとそれ自体は構わないが、私にとってどうでもいい人間でもその人間が発した言葉は誰かにとっては十分な力を持ち得て、その力は私にとってもどうでもよくはない。<u>嫌われるのが怖いのではなく嫌われた人に口と手があるのが怖い。</u>\n\nこれを和らげるのは、自分にとってその「どうであってもいい他者」たちの動向をどういうものとして解釈するかの如何ではなく、誰が何をしても味方になってくれる人がいるという安心感しかないような気がするな。<u>この人たちがいれば私は死なないという拠り所を持つこと（一人に頼ると危ないので複数）。</u>\n\n<u>一人で生きているとか生きていけるとか戦うとかそういう心の持ちようの話ではなく、「敵がいるので対抗し得るだけの味方が必要」というシンプルな理屈によって拠り所の確保に努める必要が出てくる。</u>稀に自分自身の中に一騎当千の拠り所を持てる人（あるいは持たざるを得ない人）はいるかもしれないが。\n\n自分自身の中に拠り所を作ってしまうことが即ち「悟り」なのかもしれないが、凡人はそこには辿り着けないので、悟りへの到達を目指しつつも必要なだけの拠り所を外に作っておく必要があるだろうし、自分が必要とする分だけ他の誰かの拠り所になる必要もあるだろう（一方的では帳尻が合わない）。\n\n悟りは自分を救い支えるものであるはずだと思っているので、「世界ってのは所詮こうなんだよ」的な捨鉢な結論は悟りには含めない。"},
{"title":"無鉄砲でないと活動できない","created":"2022/03/22 22:18","edited":"2022/03/23 16:50","tag":"生きる/自分を守る","body":"もちろん本当に考え無しだと困るのだが、ある程度は無謀なところがないと何もできなくなってしまう。\n特に文章を発表するという時、「みんな知っているかもしれない」「既に書かれているかもしれない」「間違っているかもしれない」etcという懸念を持ち始めるととても書いていられなくなる。そういう可能性に最初から思い至らない方が強くて、そうでなければ「他に優れたものや正しいものがあろうが自分が書くことにも意味がある」と納得しなければならない。\n\n多分、「そんな程度で人に向けて言うのか」という評価の仕方を幼い頃からずっと耳にしてきたから、私はそれを反射的に恐れてしまうのだ。\n"},
{"title":"自分は上の方にいるという自意識","created":"2022/03/19 17:07","edited":"2022/03/23 16:49","tag":"生きる/自意識との折り合い","body":"「自分は上の方にいる」という自意識が強くあると、反省することが著しく困難になる（であろう）。\n自分より下っぽい（と勝手に決め込んだ）相手からの言葉を心が受け付けない。「反省できない人間だ」と認識されることは屈辱なので反省しているポーズは取るが、保身のオーラを漂わせずにいられない。相手も悪いとか自分にはこういう事情があるとか、謝るにしても範囲を細かく限定するとか。\n\nところで、自分で思っているのと実際の効果とで大きな乖離があるところなのだが、「自分が悪いのはここからここまでである」という主張は、それが客観的に見て明白である（線を引かないとその人が不当に悪者扱いされそうだと周りが納得する）ものを除いては、「この人が悪いのはここからここまでなんだな」と思ってもらえることはほぼない気がしているが、どうか。\n"},
{"title":"茶の間システムでやろうと思えばできそうなこと","created":"2022/03/21 12:00","edited":"2022/03/21 16:07","tag":"前に進む/デジタルツール","body":"このサイト（のらてつの茶の間）とそれに反映させるデータを管理するシステム全体を指して「茶の間システム」としておく。\n\n[[使っているツール]]を書いていて、公開用と公開しない用でツールを使い分けることになるんだよなあと思ったのだが。\n昨日（[[2022-03-20]]）フロントマターを使えば云々と書いたけど、フロントマターに公開設定の欄をつければ使い分けずに済むじゃんと気がついた。\nさあどうする？\n\nというか、フォルダを分けておいて、自分用の表示だけ両方読み込み、公開用の表示は公開用のデータだけ読み込めばいいか。フロントマターを使う必要すらないな。\nフロントマターを使うとそのファイルを開かないと公開設定がどうなっているかわからない。フォルダを分ければ一目瞭然。\n\n別のhtmlに同じデータを読み込んで表示というのもできるわけだから、自分用のビューワにだけ自分用の機能を持たせることも当然可能になる。\nそうなると、最強のビューワを自分で作れるなら他のツールはあんまり要らなくなってくるかもしれない。\n\nよく考えると、ScrapboxのデータもJSONなのだから、うまく取り出せば茶の間システムに取り込めてしまうな？\nブラケットをダブルブラケットに直せばリンクもそのまま使えるような。\n更に、やろうと思えば他の自作ツールのデータをlocalStorageから取得して反映させることもできる。手間がすごいし具体的なレイアウトが思いつかないのですぐやろうというのではないけど、やろうと思えばできるというのは重要だ。\n\nやろうと思えばフォルダごとにタブを作って分けることもできるし、やろうと思えば別のタブのノートへの関連リンクを自動で取得することもできる。\n"},
{"title":"解らない機能が存在しない、という見通しの良さ","created":"2022/03/22 20:32","edited":"2022/03/22 20:34","tag":"前に進む/デジタルツール","body":"このサイトや自作ツールを作って思うのは、把握していない機能が存在しないということの見通しの良さである。\n\n例えば自分の庭に謎の茂みがあったら、そこがどうなっているのか判らなくて庭全体を「自分の場所」と思って安心することが難しくなる。蛇やムカデが出てきたら嫌だし、そういう怖い生き物が潜んでいないとしてもそこをどう活用できるか判断できないと「自分の場所」にはできない。\nでも全部自分で配置して全てを把握していれば、仮に庭が狭かったり草木やオブジェが少なかったりしても「自分の場所」という安心感は持てる。\n\n無いものは無いと知っているので、必要なら作るしかないと判断できる。一方で、「あるのかもしれない」と思うと「探す」という工程が必要になる。\nしかも結局無いかもしれないのである。あるなら見つけた時点で探索は完了するが、無い時は全部探索して「どうも無いらしい」と結論づけるしかない。結構な無駄である。\n\nそうは言っても実用に足るツールを作るのは容易でないわけで、基本的にはプロが提供しているツールを活用するのが正解だろう。しかし全てを「自分ではない誰かが作ったもの」に頼ると常に「把握しきれていない」という環境に置かれることになる。ひとつくらいは全てを把握している道具を持っていた方が気持ちは楽だなと思う。\nデジタルツールに限った話ではなく、自分の手足のように使いこなせるものが何かひとつあると心が安らかになる気がしている。\n"},
{"title":"過去の自分よりスマートなら幸せだ、と思える世界を守り抜く","created":"2022/02/11 10:38","edited":"2022/03/23 17:51","tag":"生きる/自分を守る","body":"[のらてつ(@Foam_Crab)/2022年02月11日 - Twilog](https://twilog.org/Foam_Crab/date-220211/asc)\n[>「自分で工夫する余地がある」というのは素晴らしいことですよ。生きているという感じがする。]\n[>スマートな先人のやり方に倣わないと恥をかくような気がする、みたいな枷を自分にかけると自分なりの工夫ができなくなってくるのでスマートな先人は意識的に視界から排除する（必要な時だけ学びに行く）。過去の自分より今の自分がよりスマートならそれで幸せだと思える小さな世界を守る。]\n\n「そんなことで喜んでいるのか」とか「そのやり方はうまくない、もっとこうしたらいいのに」とか、雑音はいくらでも発生し得る。自分と何も関係を結んでいない人間の物差しは全部弾き飛ばしたいが、気にしないでいるというのは結構大変なことだと思う。\n\nやれることとしては、「雑音を取るに足らないものと割り切る」または「現状だと雑音が発生し得るということに気づかないでおく」の二つをとりあえず思いつく。\n前者ができれば無敵だが、なかなかそうもいかないので、自分よりスマートな存在を認識しないでおくことによって「あの人と比べて私は」という気持ちが発生しないようにしている。\n優れた人々がいくらでもいることは忘れていないが、私の幸福を考えた時に、その人達を常に直視しておく必要はないのだ。\n"},
{"title":"非明示リンク表示の実装","created":"2022/03/21 19:00","edited":"2022/03/22 19:01","tag":"開発日誌/Chanoma","body":"（非明示的なリンクという言い方で合っているのかわからないが）\n\n明示的でないバックリンクの機能もつけた。\n実装は意外と簡単だな。\nただこれ、ノート数が多くなるとどうなるかわからない。どういう処理が速度にどう影響するのか勉強しないといけないかも。\n\n明示的でないフォワードリンクも実装。これは便利かも。\nこのノートではリンクしていないけど他のノートではリンクにしているキーワードが判る上、判ったからといってリンクを貼り直さなくてもジャンプできる。\nさすがにこれに対して2hopまでは要らないなと思ったので子項目は無し。\n\n表示されるリンクの順番が大事になると思うので、\n①バックリンク（このノートに対する直接の言及）\n②フォワードリンク（このノートからの直接の言及）\n③フォワードリンクの下位に2hopリンク（そのキーワードに直接言及している他のノート）\n④非明示的バックリンク（このノートタイトルに対するリンク無しの言及）\n⑤非明示的フォワードリンク（既に存在しているリンクキーワードに対するこのノート内でのリンク無しの言及）\nという並びになるようにした。\nノートが増えるとリンクが大量に並ぶことになると思われるが、下の方はぱっと目に入らなくても良い。\n\n\nある程度リファクタリングしたし多分挙動も大丈夫なので公開することにしよう。\n"}]