[
	{
		"title": "不機嫌な人は恨みを表現できなかった人",
		"created": "2022/02/11 00:21",
		"edited": "2022/03/23 16:49",
		"tag": "生きる/自意識との折り合い",
		"body": "恨みを晴らすことを封じられた場合、全く関係ないことにその恨みを乗せて怒り狂うことになる。<br>もし文学や芸術の形で昇華することを覚えていれば、その都度恨みを見つめて整理され、「全く関係ないこと」に対して恨みを発動することはなくなるような気がしている。恨みは消えないとしても。<br><br>恨みを封じたままでいると、封じなくて良いと判断した瞬間に全部をぶちまけてしまうし、他のものまでぶちまけているということに自分で気づくことができない。周りからすれば気の狂ったモンスターである…。しかも、いくらぶちまけても「ぶちまけるべき相手にぶちまけた」のでなければそのぶちまけたものは再びその人の中に戻っていき、別の機会にまたぶちまけられることになる。相手を間違えている限りスッキリすることはない。本当の相手に対する恐怖が残っていれば、いつまでも相手を間違え続ける。<br><br>封印を強いられたことは当然不本意であり、その理不尽に抵抗できずに屈したために封じたままになっている。その不本意さ情けなさと絶えず戦い続けているせいで、凌駕できそうと思った瞬間に吠えてしまう。しかしその時周りにいるのは、その理不尽とは関係のない人々なのである。<br><br>―――<br><br>[のらてつ(@Foam_Crab)/2022年02月11日 - Twilog](https://twilog.org/Foam_Crab/date-220211/asc)<br>機嫌の悪さをあからさまに外に出す人、勝手に機嫌悪くなって勝手に直って平然と何事もなかったように周りと話すのどういう神経してんだろうと思ったけど、昔私自身がちょっとおかしかった時は自分もそうだった気がすると思い直した。自分の感情の暴走で手一杯で他人のメンタルなんかどうでもいい状態。<br><br>機嫌の悪さを外に出す時って、世界に対して人生通して抱えた恨みに被せていた蓋が外れた状態で、その瞬間に不満に感じていることそのものは自分にとって大して重大ではないように思う。だから蓋が閉まればあっさり機嫌良くなったりする。そしてひょんなことでまた蓋が開いて憤懣の権化と化す。<br><br>本人としては今この瞬間に不満に感じていることに対して本当にけしからん許さんと思っているわけだけど、そこまでけしからん許さんと感じるものって実際には明確な侮辱くらいしかなく、そうでなければ今目の前にあるもの以外に対する恨みまでもを今のものかのように余計に爆発させている状態だと思う。<br><br>自分を害する存在に抵抗できなかった情けなさをいつまでも引きずって、事あるごとに晴らさんとして「私を不快にさせる存在を私は許さないんですよ！」とアピールする。それを言い聞かせるべき相手は自分自身以外にないのに、自分の劣等感とは何ら関係のない他の人間に伝えようとすればそりゃあ迷惑。<br>",
		"pin": false
	},
	{
		"title": "過去の自分よりスマートなら幸せだ、と思える世界を守り抜く",
		"created": "2022/02/11 10:38",
		"edited": "2022/03/23 17:51",
		"tag": "生きる/自分を守る",
		"body": "[のらてつ(@Foam_Crab)/2022年02月11日 - Twilog](https://twilog.org/Foam_Crab/date-220211/asc)<br>[>「自分で工夫する余地がある」というのは素晴らしいことですよ。生きているという感じがする。]<br>[>スマートな先人のやり方に倣わないと恥をかくような気がする、みたいな枷を自分にかけると自分なりの工夫ができなくなってくるのでスマートな先人は意識的に視界から排除する（必要な時だけ学びに行く）。過去の自分より今の自分がよりスマートならそれで幸せだと思える小さな世界を守る。]<br><br>「そんなことで喜んでいるのか」とか「そのやり方はうまくない、もっとこうしたらいいのに」とか、雑音はいくらでも発生し得る。自分と何も関係を結んでいない人間の物差しは全部弾き飛ばしたいが、気にしないでいるというのは結構大変なことだと思う。<br><br>やれることとしては、「雑音を取るに足らないものと割り切る」または「現状だと雑音が発生し得るということに気づかないでおく」の二つをとりあえず思いつく。<br>前者ができれば無敵だが、なかなかそうもいかないので、自分よりスマートな存在を認識しないでおくことによって「あの人と比べて私は」という気持ちが発生しないようにしている。<br>優れた人々がいくらでもいることは忘れていないが、私の幸福を考えた時に、その人達を常に直視しておく必要はないのだ。<br>",
		"pin": false
	},
	{
		"title": "Cards.htmlの思想",
		"created": "2022/02/16 01:04",
		"edited": "2022/04/07 23:05",
		"tag": "開発日誌/Cards",
		"body": "（思想と言うのは大袈裟だけども）<br>自作ツールの[[Cards.html]]について。（[Cards.html - Noratetsu's Room（のらてつ研究所）](https://scrapbox.io/noratetsu/Cards.html)）<br>![ver2.0](https://gyazo.com/a9f04267e139195a48f07b5ed4f090af/max_size/1000){max-width:100%}<br><br>[のらてつ(@Foam_Crab)/2022年02月16日 - Twilog](https://twilog.org/Foam_Crab/date-220216/asc)<br>「位置づけられない（≒アウトライナー向きでない）」かつ「情報カードに書くには小さ過ぎる（≒Scrapbox向きでもない）」タイプのメモを置いておきたいと考えている。で、眺めていて頭の中で膨らみ次第すぐScrapboxに行けるように色々工夫する。<br><br>逆に「位置づけられる情報」や「情報カードに書けるサイズの情報」はここに置いてもしょうがないので書かない。優先順位としてDynalistとScrapboxの方が高く、それらではしっくり来ないものだけここでキャッチする。<br><br>何度も何度もExcelを細かいメモ置き場にしようとして断念してきたんだけど、ビューワを作ることで結局かつてやろうとしていた形式そのまま復活させようとしている。<br>テーブルは情報を格納する形式としては良いけど人間である私に優しくない見た目なのが良くない。でも情報を私に優しい見た目で配置すると情報として扱いづらい。テーブルに格納して私に優しい見た目に変えるのが理想なのだと思う。<br><br>小さいメモだけどInboxではない。むしろ何段階も判定してなお行き場がないメモが最後に辿り着く場所として考える。何しろ書き込むのが面倒くさくて、手間と言うほどではないけどサッとは書けない。摩擦ゼロで書けてしまわないほうが良いと思う。<br><br>まだ価値の確立していない小片であることから、CSVよりめんどい形式は継続可能性の面で難がある（Excelもめんどい、バイナリだし）。プレーンテキストでやれるのが、書かれる情報にとって身の丈に合ってる感じがする。<br>",
		"pin": false
	},
	{
		"title": "敵が存在する以上対抗し得るだけの味方が必要",
		"created": "2022/02/23 10:39",
		"edited": "2022/03/23 16:50",
		"tag": "生きる/自分を守る",
		"body": "[のらてつ(@Foam_Crab)/2022年02月23日 - Twilog](https://twilog.org/Foam_Crab/date-220223/asc)<br>なんかこの頃「あの人（※複数）が自分の言動を批判してくるかもしれない」ということを考えてしまうことがとても多い。そして必然的に「そう言われたらこう反撃してやる」まで考える。なんでだろう。<br>対処としては「書く」かパンダかというのはこの間も書いたけど、そもそもなんで増加しているのか。思い当たることがない。<br>危害を加えられる可能性を考えるのはもはやデフォルトで、心安らかにするには止まらずに書き続けていないと駄目ということだろうか…。<br><br>「楽しいことで気を紛らす」はそんなに効果がない。危害を加えられる可能性を考えてしまうのは自分の気分の高低とは関係がないような感じがする。今楽しいけど空想は減らない。<br><u>「何かの可能性を考える」が四六時中onになっていて、「何か」の部分に特に指定がないとデフォルト値として「自分にダメージを与え得るもの」を考えてしまう</u>という感じな気もする。で、「何か」は創造性が高ければデフォルトに戻らずに済み、そうでもないものは思考に中断が発生してしばしば戻る。<br><br>なんかでもこれって「もし相手が意識を向けてきたら実際そうなる」というタイプの予測だから、「意識を向けてくる」の確率が低いだけで、意識を向けられさえすれば当たってしまうんだよな。ロシアンルーレットに怯えるのと同じで、銃が偽（＝被害妄想）なのではなく弾が入っていれば本当に発砲される。<br>「ほらやっぱり」を幾度も繰り返しているから、自衛のために自動的に働くその予測をやめるのは難しい。<br>どうにかできるとすれば「批判されたらダメージを受ける」ということの方かもと思うけどこっちはこっちで本当にどうにかできるものなのかわからん（ここまでの人生でどうにもなっていない）。<br><br>好意的でないことを書かれたときに受けるダメージって好意的でないことそのものではなく「好意的でない受け取り方によって望ましくない印象を持たれ、それを発信された上に第三者にそれを読まれる」という一連によって<u>真意から高速で遠ざかる絶望感</u>によるものであって、心の弱さとはもはや別では。<br>どうでもいい人間（文字通り「どうであってもいい」他者）にどう思われようとそれ自体は構わないが、私にとってどうでもいい人間でもその人間が発した言葉は誰かにとっては十分な力を持ち得て、その力は私にとってもどうでもよくはない。<u>嫌われるのが怖いのではなく嫌われた人に口と手があるのが怖い。</u><br><br>これを和らげるのは、自分にとってその「どうであってもいい他者」たちの動向をどういうものとして解釈するかの如何ではなく、誰が何をしても味方になってくれる人がいるという安心感しかないような気がするな。<u>この人たちがいれば私は死なないという拠り所を持つこと（一人に頼ると危ないので複数）。</u><br><br><u>一人で生きているとか生きていけるとか戦うとかそういう心の持ちようの話ではなく、「敵がいるので対抗し得るだけの味方が必要」というシンプルな理屈によって拠り所の確保に努める必要が出てくる。</u>稀に自分自身の中に一騎当千の拠り所を持てる人（あるいは持たざるを得ない人）はいるかもしれないが。<br><br>自分自身の中に拠り所を作ってしまうことが即ち「悟り」なのかもしれないが、凡人はそこには辿り着けないので、悟りへの到達を目指しつつも必要なだけの拠り所を外に作っておく必要があるだろうし、自分が必要とする分だけ他の誰かの拠り所になる必要もあるだろう（一方的では帳尻が合わない）。<br><br>悟りは自分を救い支えるものであるはずだと思っているので、「世界ってのは所詮こうなんだよ」的な捨鉢な結論は悟りには含めない。",
		"pin": false
	},
	{
		"title": "意見交換の前に言葉を吟味する",
		"created": "2022/02/27 08:50",
		"edited": "2022/03/21 10:10",
		"tag": "こだわる/言葉遣い",
		"body": "言葉選びが下手くそで話の対象が本人の意図より広くなっている場合には話を進めるより言葉選びの吟味から入らないと議論自体が無駄になる。（[自ツイ](https://twitter.com/Foam_Crab/status/1497720549685882882)）<br><br>自分が選択した言葉が自分の頭の中にある像を正しく示しているのか、言葉を発する度に点検する必要がある。<br>相手がよくわからないことを話し始めたと思った時は、自分の提示が失敗していると考えて「この言葉を双方どういう意味で捉えているか」を確認し合わないと労力の空費になってしまう。<br>",
		"pin": false
	},
	{
		"title": "凡例",
		"created": "2022/03/18 16:27",
		"edited": "2022/03/20 18:10",
		"tag": "",
		"body": "以下をJavaScriptで処理してHTMLタグに変換<br><br>外部リンクはMarkdown記法<br>[Noratetsu's Room（のらてつ研究所）](https://scrapbox.io/noratetsu/)<br><br>画像はMarkdown記法+{}内でスタイル指定可能<br>![画像](https://gyazo.com/8e76071e5281e7396c84c83d32554939/max_size/1000){width:100px;}<br><br>引用はScrapbox風の記法（夏目漱石『草枕』冒頭）<br>[>山路を登りながら、こう考えた。<br>智に働けば角が立つ。情に棹させば流される。意地を通せば窮屈だ。とかくに人の世は住みにくい。<br>住みにくさが高じると、安い所へ引き越したくなる。どこへ越しても住みにくいと悟った時、詩が生れて、画が出来る。]<br><br>《ツイートURL》でツイート埋め込み（生成に時間がかかる）<br>《https://twitter.com/Foam_Crab/status/1505159525334020098》<br>",
		"pin": false
	},
	{
		"title": "About茶の間",
		"created": "2022/03/18 22:01",
		"edited": "2022/09/02 23:14",
		"tag": "お知らせ",
		"body": "このサイトは[[のらてつ／Noratetsu]]のミニブログ的なものです。<br>TwitterとScrapboxの間のような位置づけで書いていきたい気持ちがあったので自作しました。<br>詳しくは[[茶の間のコンセプト]]へ。<br>ここに書いたことは[Noratetsu Lab](https://noratetsu.blogspot.com/)に投稿する可能性があります。<br><strike>一日～数日に一度更新します。</strike><br><br>←左列（スマホ表示では右に移動）<br>ピン：<br>　常にアクセスできるようにしているノート群と各種ピックアップ機能<br><br>分類タグ：<br>　ノートの内容を分類した一覧<br>　タグ名をクリックすると中身をメイン画面に表示<br><br><br>→右列<br>リンク/バックリンク：<br>　「<i class=\"fas fa-angle-double-right\"></i>」はリンク、「<i class=\"fas fa-angle-double-left\"></i>」はバックリンク<br>　「<i class=\"fas fa-angle-double-right\"></i>」の子項目になっているのは2ホップリンク（Scrapboxの機能を真似ています）<br>　青字はノートが存在、赤字は空リンク<br>　緑字の「<i class=\"fas fa-angle-double-left\"></i>」は「リンクにしていないが現在表示しているノートタイトルへの言及があるノート」のリンク<br>　緑字の「<i class=\"fas fa-angle-double-right\"></i>」は「このノートではリンクにしていないが他のノートがリンクにしているワード」へのリンク<br>（PCの場合はマウスオーバーで説明が出ます）<br>",
		"pin": true,
		"editedFix": false
	},
	{
		"title": "茶の間のコンセプト",
		"created": "2022/03/18 22:12",
		"edited": "2022/06/27 22:00",
		"tag": "お知らせ",
		"body": "このサイトのコンセプトについて。<br><br>メインテーマは「個人の総合的な表現」で、その一環としてデザインしています。（出典：[個人の総合的な表現 - Word Piece](https://wordpiece.hatenablog.com/entry/2021/12/03/233555)）<br>言い換えると「他者による断片化」の拒絶でもあります。<br>細かいノートで構成されていますが、それは私にとっての断片であり、他者から見た時にはそれらによってひとつの何かが形成されているようであってほしいと思っています。<br><br>ノートの内容はいわゆる「つぶやき」的なものになるようにしていきます。Twitterに書くには長く（あるいはタイムライン上で人の目に入れたいものではなく）、Scrapboxに書くには断片度合いが高い（あるいはさくさく共有されたいものではない）という類の文章になるでしょう。<br>Twitterで一度つぶやいたものをまとめてノートにすることもあります。<br>コンセプトなどと言って語っていますが、そう語るほど大層なものにはなりません。<br><br>なお、断片であっては困るものはそれなりのサイズの文章にして[Noratetsu Lab](https://noratetsu.blogspot.com/)に投稿します。<br><br><br>その他、時代の流れに逆行することで自分にとって自然体な場所を作ろうとしています。<br><br>今は動画や音声の時代だ。<br>→文章だけでいきます。<br><br>リアルタイムな発信が常識になっている。<br>→私が不定期にGitHubにプッシュした時点でそこまでの分の更新がまとめて反映されます。<br><br>優れたツールが世の中にたくさんあり、それらを使いこなすのが器用な生き方だ。<br>→もう2022年ですがHTML他を自分で書いてホームページを作りました。<br><br>時間は貴重だから通知やRSSで更新をキャッチできる形が望ましい。<br>→Twitterを含め更新を知らせることはありません。<br><br>検索で目的の情報にピンポイントでさっとアクセスできるのが効率的だ。<br>→検索機能はつけません。<br><br>一部分をさっと共有できるのが情報の扱いとして都合が良い。<br>→各ノートごとにURLは発行しません。共有ボタンもつけません。<br><br>複数人で集まって意見交換しながら考えたほうが良い。<br>→それは大事ですが、一人でやる領域も死守したいという気持ちがあります。<br><br>これらのことを満たした情報発信をしたい時はそういう場を借り、そうでないものをここに書くということです。<br><br>余談：激流の中の岩のイメージに憧れがあります。<br>",
		"pin": true
	},
	{
		"title": "「○○の気持ちしかありません」",
		"created": "2022/03/19 12:50",
		"edited": "2022/03/19 21:56",
		"tag": "こだわる/言葉遣い",
		"body": "「感謝の気持ちしかありません」「尊敬しかありません」<br>嘘をついちゃあいけない、と思う。<br>いや、そう言いたくなるほどであるということが真実なのはわかるし、それを否定する気はない。<br>しかし「そう言いたくなるほどである」と「そうである」は異なるということは意識される必要があると思う。厳密に言って、その気持ちしかないわけがない。コンピュータじゃないんだから。<br><br>一方で、「○○の気持ちでいっぱいです」と言ったならば、他のものも多少あるかもしれないが、それ以外の圧倒的に大きな範囲をそれが占めているということを示している。これは（実際は全く別の気持ちであるというのでない限り）嘘にはならないだろう。<br><br>言い換えると、「意味」を示す文言を別の「意味」の隠喩として使うのは良くないという気持ちがある。その使い方は単なる不正確さと区別がつかず、それを比喩として解釈できるのは意識的に好意的に見た場合に限られる気がしている。",
		"pin": false
	},
	{
		"title": "自分は上の方にいるという自意識",
		"created": "2022/03/19 17:07",
		"edited": "2022/03/23 16:49",
		"tag": "生きる/自意識との折り合い",
		"body": "「自分は上の方にいる」という自意識が強くあると、反省することが著しく困難になる（であろう）。<br>自分より下っぽい（と勝手に決め込んだ）相手からの言葉を心が受け付けない。「反省できない人間だ」と認識されることは屈辱なので反省しているポーズは取るが、保身のオーラを漂わせずにいられない。相手も悪いとか自分にはこういう事情があるとか、謝るにしても範囲を細かく限定するとか。<br><br>ところで、自分で思っているのと実際の効果とで大きな乖離があるところなのだが、「自分が悪いのはここからここまでである」という主張は、それが客観的に見て明白である（線を引かないとその人が不当に悪者扱いされそうだと周りが納得する）ものを除いては、「この人が悪いのはここからここまでなんだな」と思ってもらえることはほぼない気がしているが、どうか。<br>",
		"pin": false
	},
	{
		"title": "2022-03-19",
		"created": "2022/03/19 23:01",
		"edited": "2022/03/20 14:38",
		"tag": "日記/2022/03",
		"body": "[[Python]]の勉強を始めた。<br>このサイトのノートはそれぞれmdファイルに書いてあり、Obsidianでも扱える形になっている。このサイトに表示するためにはそれらをまとめてJSONにする必要があり、手作業でやるわけにはいかないので、ローカルファイルを扱える言語を習得しようと思った。<br>Pythonにした理由には特に深いものはなく、「倉下忠憲さんがPythonの話をしていたから」で、とりあえずPythonを使えば望む操作はできそうであると判断した。前に齧っていた[[VBScript]]を再勉強してもよかったけど、まあどうせなら今現在耳にすることのある言語に挑んでみようと思った。<br><br>[ゼロからのPython入門講座 - python.jp](https://www.python.jp/train/index.html)で基本を習得。<br>[Visual Studio Code でPython入門 【Windows編】 - python.jp](https://www.python.jp/python_vscode/windows/index.html)でVSCodeでの扱い方を理解した。<br>あとは[Pythonに関する情報 | note.nkmk.me](https://note.nkmk.me/python/)の中の記事を参照して目的のメソッドを探した。<br><br>とりあえず必要なコードは書けたので、これ以上のことはまあそのうち気が向いたらという感じ。<br>なんかこう、[[JavaScript]]と比べて書き方があっさりしていて「こ、これでいいの？」という気持ちになった。慣れるとスイスイやれそうな見た目の言語だ。<br><br>切り出し<br>→[[「コード」という概念を取り込む]]<br>→[[Scrapboxとこのサイトの兼ね合い]]<br>",
		"pin": false
	},
	{
		"title": "2022-03-20",
		"created": "2022/03/20 10:03",
		"edited": "2022/03/20 23:18",
		"tag": "日記/2022/03",
		"body": "このサイトを作ったことにより、結局Obsidian（的な運用）に戻ってくることになった。<br>[[Obsidian]]そのものは他のツールやらブラウザやらを開いている状態だと自分の環境ではちょっと重くて使いづらいので、[[Foam（VSCode拡張機能）]]でVSCodeの特定のワークスペースをObsidian風に設定して使うことにした。<br>この拡張機能すごいなあ。とても便利だ。<br>切り出し→[[VSCode拡張機能のハードル]]<br><br>[Scripting: ファクトリー機能 - Twitter 開発者ドキュメント 日本語訳](http://westplain.sakuraweb.com/translate/twitter/Documentation/Twitter-for-Websites/JavaScript/Scripting-Factory-Functions.cgi)を参考にしてツイート埋め込みの実装に成功した。<br>ただ読み込むのに時間がかかるのが難点だな…。実装の仕方の問題というより、そもそもツイート埋め込みは時間がかかるように思う。他の記事を開いた時とかの感じを見るに。<br>まあ、やろうと思えばやれるということが確認できたのが最大の収穫で、実際にはツイート埋め込みはそんなにはやらないかも？<br>ともかく、なんだか複雑だしあんまり意味がわかっていない状態なので、実際実装できると思っていなかった。嬉しい。<br>↓埋め込みサンプル<br>《https://twitter.com/Foam_Crab/status/1504424363982221316》<br><br><br>コードを書けさえすれば自分好みの新たな機能をすぐ追加できる、というのはすごいことだなと実感している。<br>例えばこのサイトなら、mdファイルのフロントマターに書いたデータを読み取って処理しているけど、フロントマターに好きなキーワードでデータを書いてそれを条件分岐に使えばいくらでも色々なことができる。<br>現時点では、作成日時（created:）、タグ(tags:)、ピン判定（pin:）の三つを使っている。なお更新日時はファイルの更新日時を取得している。<br>機能を増やせばいいというものではないのであれこれ複雑にやるのは良くないけれど、カスタマイズする余地が無限にあるという状態はすごいと感じる。<br>",
		"pin": false
	},
	{
		"title": "「コード」という概念を取り込む",
		"created": "2022/03/20 11:04",
		"edited": "2022/03/22 17:58",
		"tag": "前に進む/プログラミング",
		"body": "少し前までプログラミングには苦手意識が強くあったが、プログラミングのどの部分に苦手意識があるのかというのは結構複雑なものである。<br>プログラムを「組む」ことが難しいのか、「言語」に拒否反応を起こしているのか。<br>昔挑んだ時には、for文などが当時うまく飲み込めなかったこともあり、プログラムを組んでいくことに己の無能を感じていた。<br>しかし今考えると、私はまず外国語が苦手で、英語に至っては苦手というよりもはや「嫌い」の域にあり、アルファベットの羅列にも気分が悪くなる。その状態でプログラミングのコードを見た時、到底ワクワクした気持ちにはなれない。よくわからないものが、嫌いな感じの見た目で書かれている。如何にも習得は無理そうである。<br><br>[[Scrapbox]]を使い始めてUserCSSを書くことに挑戦しだしてから色々変わったということは過去にどこかに何度も書いているが、「見た目を変えられる」という明快なワクワク感に引っ張られて「コードを書く」ということに馴染んでいったのが変化の核にある。<br>マークアップ言語（およびスタイルシート言語）とプログラミング言語は異なるものだが、いずれにせよ「日本語ではない」「人間がコミュニケーションに使う言語ではない」ということは共通しており、つまるところそこに障壁があったのであって、マークアップ言語を攻略したらプログラミング言語も攻略できるようになったということだ。<br><br>具体的には、<br><br>（昔[[VBScript]]と[[VBA]]をちょっとだけ齧った）<br>　　　↓<br>[[CSS]]を見様見真似でいじる<br>　　　↓<br>[[HTML]]をきちんと勉強する<br>　　　↓<br>CSSをきちんと勉強する<br>　　　↓<br>（[[Mermaid.js]]をちょっと齧る）<br>　　　↓<br>[[SCSS]]を習得する<br>　　　↓<br>[[JavaScript]]を勉強する<br>　　　↓<br>[[Python]]をちょっと齧る<br><br>という経路で少しずつ「コード」という概念を自分に取り込んだことになる。プログラミング言語に挑んだのは（かなり昔にVBScriptを齧ったのを除けば）ここ7週間ほどのことだが、今Pythonの入門用解説を読んでみて随分気分が変わったなと実感している。いつの間にか「わかるはずだ」と思えるようになった。もちろんプロフェッショナルにはなれそうにないが、「全くわからないというはずはない」という感覚がある。実際、読めばわかるようになった。VBScriptと苦闘していた当時と今とで自分の賢さ的なものが大きく変わったとは思えないが、理解できる領域は劇的に拡大している。<br><br>一般的に、プログラミング言語の習得を考えた時、階段の一段目としてマークアップ言語やスタイルシート言語を想定することはあまりないのではないかと思う。私自身、振り返ってみればそうだったなと思うだけで、プログラミング言語を習得したい人にCSSを勧めようとは考えない。もちろんJavaScriptの勉強をしたいというのならば実際問題HTMLとCSSを知らないとやれることがなくなるので「まずHTMLとCSSだね」とも言えるが、サーバーサイドの言語ではそれらはほとんど関係がないだろう。<br>しかしながら、私がPythonを理解するにはCSSからスタートすることが必要だった。<br><br>何かがネックになっているという時、本当は何がネックなのかを炙り出すのは恐らく容易でない。<br>",
		"pin": false
	},
	{
		"title": "Scrapboxとこのサイトの兼ね合い",
		"created": "2022/03/20 11:48",
		"edited": "2022/03/27 22:22",
		"tag": "前に進む/表現の手段",
		"body": "このサイトを作ったことにより、必然的にScrapboxの公開プロジェクト（[Noratetsu's Room（のらてつ研究所）](https://scrapbox.io/noratetsu/)）の位置づけは変わるだろうという感じがしている。<br><br>以前、[Scrapboxには自分という人間が表れていてほしい - Noratetsu's Room（のらてつ研究所）](https://scrapbox.io/noratetsu/Scrapbox%E3%81%AB%E3%81%AF%E8%87%AA%E5%88%86%E3%81%A8%E3%81%84%E3%81%86%E4%BA%BA%E9%96%93%E3%81%8C%E8%A1%A8%E3%82%8C%E3%81%A6%E3%81%84%E3%81%A6%E3%81%BB%E3%81%97%E3%81%84)ということを書いていたのだが、これを果たして本当にScrapboxで実践できるのだろうか、という気持ちが付き纏っていた。結局実践できなかったのだが、つまるところ、Scrapboxは「開きすぎている」という感覚があった故だろうと思う。<br>[[茶の間のコンセプト]]にも書いたが、私はそもそも断片化を拒否する感覚がある人間なのに、言うなれば断片化そのものであるScrapboxを自分自身を表現するものとして使えるはずはなかった。情報をパーツ化して扱うという意味ではScrapboxは大変に優れたツールで、非公開プロジェクトをいくつも作って毎日愛用しているものなわけだが、Scrapboxという「場」でやろうとしていたことが私にとっては間違っていたのだ。<br>例えばこういう文章をScrapboxに書いた場合、場の特性の話として、一部分を引用されて言及されるということが普通に起こり得るわけだが、正直なところ、その部分だけを引用されることは私にとってあまりメリットがない。問題提起をしているのでもないし、意見を求めているのでもない。大抵の場合、書き手の意図は無視される。最初は尊重されていたとしても、その空気が消え去るのは時間の問題なのである。断片化とはそういうことだ。<br>「適切に断片として使い回されること」を目指すべき内容を書くことに向いているのであって、「自分という人間を少しずつ語る」ということに使うのは無理があった。<br><br>「自分という人間」を表すのを抑えたとして、Scrapboxの公開プロジェクトに何が残るだろうか。<br>今のところ、最もしっくり来ているのは「UserCSSのコードを置いておくこと」だが、そもそもCSSに詳しい人間でもなし、それがメインのコンテンツになるというのはなんとなく変な感じがする。<br>そう思ってみても、あまり「これ」というイメージは思い浮かばない。<br>元々の関心事を思い返すに、知的生産（についての知的生産）的な話題をどう書いていくか、ということをきちんと考えるべきなのかもしれない。<br>",
		"pin": false
	},
	{
		"title": "VSCode拡張機能のハードル",
		"created": "2022/03/20 15:12",
		"edited": "2022/03/20 18:05",
		"tag": "前に進む/デジタルツール",
		"body": "少し前まで、[[VSCode]]の拡張機能は複雑そうに感じられて、インストールするだけで効果を発揮するものを除いては設定方法を調べて活用するところまで辿り着かなかったのだが、今はそんなに億劫な感じはしない。[[Foam（VSCode拡張機能）]]の設定はそれなりに複雑だし解説は全て英語だが、頑張ってみるかという気持ちになる。<br>[[「コード」という概念を取り込む]]で書いたこととも繋がるが、これもまた「拡張機能という概念の難しさ」と「英語に対する拒否反応」の二枚の壁に阻まれてのことで、デジタルの何かというのは常に「壁が二枚」の苦しさがある。一枚なら突破できるが、二枚となると辛い。心が萎れてしまう。<br><br>今回突破できたのは、まず[[JavaScript]]の勉強を始めてから二ヶ月弱の間ひたすらVSCodeを使っていたこと、そして[[Python]]の勉強の過程で「ターミナル」を理解したことによるだろうと思う。拡張機能とターミナルとは直接関係ないが、VSCodeに備わっているよくわからない機能その１であるターミナルを突破したことで、よくわからない機能その２の「拡張機能ごとの設定」に挑む力が湧いたという感じがする。<br><br>コマンドパレットを開いて何かしら打って機能を呼び出す、ということに馴染むまでにやたらと時間がかかっている。<br>目視でファイルを探すスタイルから検索バーに打ち込んでピックアップするスタイルに変わるのにも相当時間を要したが、何かを取り出すにあたって「キーワード」を使うというのがなかなか身体的に馴染まないようだ。モノも情報もシステムも物的に認識していて、常に視覚情報をキーとして探してしまう。<br>それは基本的には「慣れ」の問題であるのだが、ただ、自分の中で「文字情報の記憶」と「視覚情報の記憶」とで信頼性が大きく違っているということも大きい。なので先に「目で見る」を使おうとしてしまう。文字列を探すにしても、その文字列を文字列として思い出すのでなく、まず目で見るという作業を開始してその中に文字列を発見しようとする。直に思い出すよりも視覚でサーチしたほうが速くて確実に思えてしまうからだ。<br><br>検索を習慣づけるにあたっては、少し別の角度から[Noratetsu Lab: Scrapbox日誌：「整理したい病」には「放置」が効いた](https://noratetsu.blogspot.com/2022/01/Scrapbox01.html)でも書いたが、結局は「諦める」ということによって移行したように思う。<br>信頼性の差異について自分の認識を改めたのではなく、「信頼性がどうあれ、無理な作業はできない」ということで諦めた。<br>コマンドパレットに関しては、最初からコマンドパレットで呼び出す以外に方法はない。よって、そうと分かれば諦めるしかないのだが、そうと分かること自体が億劫だったのでなかなか「さっさと諦める」というところに至らなかった。<br><br>今何の拡張機能がインストールされていて何を打てば何ができるのかがよくわからなくなっているという問題もある。別にたくさんインストールしているのでもないのだが、視覚的に把握できない感じになってくると急に「よくわからない」という気持ちになってしまう。<br>まあでも、コマンドパレットを開いてスクロールすれば一応目視で全部探せるわけなので時々眺めてみればいい話か。今なら「そうすればいいよね」とすんなり思うが、VSCodeが巨大なブラックボックスのように見えていた間はそうすればいいという発想にならなかった。<br>",
		"pin": false
	},
	{
		"title": "2022-03-21",
		"created": "2022/03/21 09:42",
		"edited": "2022/03/22 19:02",
		"tag": "日記/2022/03",
		"body": "作ったツール、直しても直してもまだ直すところが出てくる。<br>世の中のツールが延々バグフィックスしているのを見ていて「どこに直すところがあるんだろう？」と思っていたけど、あるんだろうなあと思うようになった。これよりずっと複雑なら、何かする度にバグもちょこちょこ出るんだろう。<br><br><br>ラジオで昔聞いたことがあるアーティストの新曲を耳にして、良い曲だなあと思った。<br>最近全然歌に親しんでいない。クラシック音楽はだいたい毎日NHK-FMのクラシックカフェを流しているから聴いているけど、歌は聴く機会を作ることがなくなってしまった。超流行った曲はちょっとチェックすることもあるけど、「新しい音楽を知ろう！」というワクワクした気持ちはほとんどない。<br>なんだか面倒くさいという感じがする。なんでだろう。もう若くないということだろうか。<br>聴覚を空けておかなくて良い一人の時間というのを作りづらいせいもあるかもと思ったけど、一人の時間ができても聴覚を使う気にならない（曲を聴くということを思い出せない）。<br>でも偶々初めて耳にした曲が良い曲だと、自分好みの楽曲がどこかで生まれているんだろうなあ、知りたいなあと思う。<br>そう思いつつ、やっぱり面倒くさい。<br><br><br>切り出し→[[茶の間システムでやろうと思えばできそうなこと]]<br>切り出し→[[非明示リンク表示の実装]]<br>",
		"pin": false
	},
	{
		"title": "使っているツール",
		"created": "2022/03/21 11:09",
		"edited": "2022/03/22 20:41",
		"tag": "前に進む/デジタルツール",
		"body": "（途中）<br>書いたものをアウトプットする場については[[投稿の場]]へ<br><br><h3>[[Dynalist]]</h3><br>日記・日誌<br>とりあえずのメモ<br>引用集<br>マニュアル類<br><br><h3>[[Scrapbox]]（private）</h3><br>情報を集める<br>Atomicな思考のリンク（Markdownに移行する可能性あり）<br>ブログの構成を練る・書く<br><br><h3>[[Fusen.html]]（自作）</h3><br>頭の中の洗い出しや調べ物<br>メインの場になりそう<br><br><h3>[[Card.html]]（自作）</h3><br>タイトルをつけられない且つ育ちそうなアイデアのメモ<br><br><h3>[[Outline.html]]（自作）</h3><br>引用を集めて資料をつくるアウトライン<br><br><br><h3>VSCode with Foam</h3><br>[[Foam（VSCode拡張機能）]]で[[Obsidian]]風にmdファイルを扱う<br>書いたものはこのサイトに反映<br><br>",
		"pin": false
	},
	{
		"title": "茶の間システムでやろうと思えばできそうなこと",
		"created": "2022/03/21 12:00",
		"edited": "2022/03/27 21:53",
		"tag": "前に進む/デジタルツール",
		"body": "このサイト（のらてつの茶の間）とそれに反映させるデータを管理するシステム全体を指して「[[茶の間システム]]」としておく。<br><br>[[使っているツール]]を書いていて、公開用と公開しない用でツールを使い分けることになるんだよなあと思ったのだが。<br>昨日（[[2022-03-20]]）フロントマターを使えば云々と書いたけど、フロントマターに公開設定の欄をつければ使い分けずに済むじゃんと気がついた。<br>さあどうする？<br><br>というか、フォルダを分けておいて、自分用の表示だけ両方読み込み、公開用の表示は公開用のデータだけ読み込めばいいか。フロントマターを使う必要すらないな。<br>フロントマターを使うとそのファイルを開かないと公開設定がどうなっているかわからない。フォルダを分ければ一目瞭然。<br><br>別のhtmlに同じデータを読み込んで表示というのもできるわけだから、自分用のビューワにだけ自分用の機能を持たせることも当然可能になる。<br>そうなると、最強のビューワを自分で作れるなら他のツールはあんまり要らなくなってくるかもしれない。<br><br>よく考えると、ScrapboxのデータもJSONなのだから、うまく取り出せば茶の間システムに取り込めてしまうな？<br>ブラケットをダブルブラケットに直せばリンクもそのまま使えるような。<br>更に、やろうと思えば他の自作ツールのデータをlocalStorageから取得して反映させることもできる。手間がすごいし具体的なレイアウトが思いつかないのですぐやろうというのではないけど、やろうと思えばできるというのは重要だ。<br><br>やろうと思えばフォルダごとにタブを作って分けることもできるし、やろうと思えば別のタブのノートへの関連リンクを自動で取得することもできる。<br>",
		"pin": false
	},
	{
		"title": "アウトラインビューワを考える",
		"created": "2022/03/21 16:56",
		"edited": "2022/03/22 17:52",
		"tag": "前に進む/デジタルツール",
		"body": "《https://twitter.com/Foam_Crab/status/1494995251764727814》<br>こう呟いて、結局即日メタデータを持つ[[アウトライナー]]を作り始めた。<br>→[Outline.html - Noratetsu's Room（のらてつ研究所）](https://scrapbox.io/noratetsu/Outline.html)<br>名無しという意味で[[Outline.html]]と適当に名前をつけた。<br><br>スキルゼロからスタートした割にそれなりのものができた。獲得した経験値は膨大である。これによって付箋ツールもさっと作れたしこのサイトも然程苦労せず構築できた。<br>しかし「エディタ」の機能を持たせるというのはおそろしく大変である。バグが怖い。確認できたものは頑張って全部潰したものの、まだどこで何があるかわからない。<br><br>で、今この「のらてつの茶の間」を作って思ったのだが、このアウトライナーはエディタじゃなくてビューワに徹した方が良かったのではないだろうか。<br>前提として、アウトライン操作をするものとして現在常用しているDynalistに不満は何もなく、私が欲していたのは「見るものとして、メタデータによって情報が整頓されているアウトライン」なのである。<br>格納されている情報によってアイコンが変わったり色が変わったり、様々な（自分好みの）視覚要素で情報を把握できるものが欲しかった。つまり「アウトラインプロセッサ」ではなく「[[アウトラインビューワ]]」である。<br><br>これを作っている時は「localStorageを使えばエディタを作れる」というワクワク感があったので当然のようにエディタ作りに挑んだのだが、今だったらMarkdownで書いたものをすごく良い感じに表示する何かを作ろうとするだろう。<br>もしデータを完全なるプレーンテキストで用意しなければならないとすれば、やっぱりエディタを作った方が…ということにもなるのだが、Markdownならかなり綺麗な形でプレビューできるし、出来上がりをイメージしながら直感的にデータを作ることができる。<br>少し前までJavaScriptしか使えずローカルファイルの処理を選択肢に入れられなかったため、Outline.htmlを作っていた時にMarkdownを使うということは全然思いつかなかった。<br><br>今思いついたので具体的にどうするかはまだ考えていないが、「操作するアウトライン」とは別に「見るためのアウトライン」を私は欲しているので、何か作れないかと思っているところである。<br>",
		"pin": false
	},
	{
		"title": "非明示リンク表示の実装",
		"created": "2022/03/21 19:00",
		"edited": "2022/03/22 19:01",
		"tag": "開発日誌/Chanoma",
		"body": "（非明示的なリンクという言い方で合っているのかわからないが）<br><br>明示的でないバックリンクの機能もつけた。<br>実装は意外と簡単だな。<br>ただこれ、ノート数が多くなるとどうなるかわからない。どういう処理が速度にどう影響するのか勉強しないといけないかも。<br><br>明示的でないフォワードリンクも実装。これは便利かも。<br>このノートではリンクしていないけど他のノートではリンクにしているキーワードが判る上、判ったからといってリンクを貼り直さなくてもジャンプできる。<br>さすがにこれに対して2hopまでは要らないなと思ったので子項目は無し。<br><br>表示されるリンクの順番が大事になると思うので、<br>①バックリンク（このノートに対する直接の言及）<br>②フォワードリンク（このノートからの直接の言及）<br>③フォワードリンクの下位に2hopリンク（そのキーワードに直接言及している他のノート）<br>④非明示的バックリンク（このノートタイトルに対するリンク無しの言及）<br>⑤非明示的フォワードリンク（既に存在しているリンクキーワードに対するこのノート内でのリンク無しの言及）<br>という並びになるようにした。<br>ノートが増えるとリンクが大量に並ぶことになると思われるが、下の方はぱっと目に入らなくても良い。<br><br><br>ある程度リファクタリングしたし多分挙動も大丈夫なので公開することにしよう。<br>",
		"pin": false
	},
	{
		"title": "投稿の場",
		"created": "2022/03/21 22:00",
		"edited": "2022/07/12 12:34",
		"tag": "お知らせ",
		"body": "<h3>Blogger</h3><br>[Noratetsu Lab](https://noratetsu.blogspot.com/)<br>断片化し得ない何かを頑張って言葉にする<br><br><h3>トンネルChannel（Substack）</h3><br>[トンネルChannel](https://tunnellingchannel.substack.com/)<br>[のらてつ @Foam_Crab | Substack](https://substack.com/profile/97326198-foam_crab)（のらてつの投稿一覧）<br>同じ話題を共有する人々の間での対話としての記事投稿<br><br><h3>Scrapbox</h3><br>[Noratetsu's Room（のらてつ研究所）](https://scrapbox.io/noratetsu/)<br>断片化して活用するのが望ましい何かを置いておく<br><br><h3>のらてつの茶の間（ここ）</h3><br>[のらてつの茶の間](https://nora-tetsu.github.io/Chanoma/)<br>「情報」ではない表現をちまちま書き溜める<br><br><h3>Twitter</h3><br>[のらてつ (@Foam_Crab) / Twitter](https://twitter.com/Foam_Crab)<br>何かに対する感想とか　感情を含むものとか<br>[知的好奇心向上委員会 コミュニティ / Twitter](https://twitter.com/i/communities/1496761082442297347)<br>本、情報整理ツール、制作などについてツイートし合う場<br><br><h3>note</h3><br>[のらてつ｜note](https://note.com/noratetsu)<br>ほぼ休止<br>共感が発生するような何かを投稿したいと思っていたが…<br>",
		"pin": false,
		"editedFix": true
	},
	{
		"title": "2022-03-22",
		"created": "2022/03/22 11:25",
		"edited": "2022/03/22 22:25",
		"tag": "日記/2022/03",
		"body": "切り出し→[[解らない機能が存在しない、という見通しの良さ]]<br><br><br>mdファイルのフォルダをとりあえず「public（公開する）」と「private（まだ公開しない）」に分けた。<br>新規ファイルはprivate内に自動で作り、公開して良い状態になったと思ったらpublicに移す。<br>書いたけど公開しない方が良いかもと思うファイルはそのままprivateに残る。<br>まだ自分用のhtmlは用意していないけど、privateのファイルがかなり多くなるようだったら作ることにしよう。（[[茶の間システムでやろうと思えばできそうなこと]]にも書いた）<br><br><br>切り出し→[[ツイートまとめを再度試みる]]<br><br>切り出し→[[無鉄砲でないと活動できない]]<br><br><br>《https://twitter.com/akira2202_/status/1506044062742179840》<br>想像を絶する世界になってしまっている…。<br>人生と歴史が失われていく恐ろしさと悲しみがあまりにも大きく、言えることが何もない。<br>人間の命令で人間がやった。その愚かしさに耐えられない。<br>",
		"pin": false
	},
	{
		"title": "のらてつ／Noratetsu",
		"created": "2022/03/22 17:54",
		"edited": "2022/03/27 21:52",
		"tag": "お知らせ",
		"body": "![アイコン](https://gyazo.com/8e76071e5281e7396c84c83d32554939/max_size/1000){width:50px;}<br><br>他の発信場所へは[[投稿の場]]または右上のリンクアイコンからどうぞ。<br><br><br><h3>関心事</h3><br>自分の無意識の訴えをキャッチするにはどうするか<br>自分の人生を邪魔してくる存在・概念を自分の人生から退けるにはどうするか<br>知的生産についての知的生産（情報管理、文章術など）<br>",
		"pin": true
	},
	{
		"title": "解らない機能が存在しない、という見通しの良さ",
		"created": "2022/03/22 20:32",
		"edited": "2022/03/22 20:34",
		"tag": "前に進む/デジタルツール",
		"body": "このサイトや自作ツールを作って思うのは、把握していない機能が存在しないということの見通しの良さである。<br><br>例えば自分の庭に謎の茂みがあったら、そこがどうなっているのか判らなくて庭全体を「自分の場所」と思って安心することが難しくなる。蛇やムカデが出てきたら嫌だし、そういう怖い生き物が潜んでいないとしてもそこをどう活用できるか判断できないと「自分の場所」にはできない。<br>でも全部自分で配置して全てを把握していれば、仮に庭が狭かったり草木やオブジェが少なかったりしても「自分の場所」という安心感は持てる。<br><br>無いものは無いと知っているので、必要なら作るしかないと判断できる。一方で、「あるのかもしれない」と思うと「探す」という工程が必要になる。<br>しかも結局無いかもしれないのである。あるなら見つけた時点で探索は完了するが、無い時は全部探索して「どうも無いらしい」と結論づけるしかない。結構な無駄である。<br><br>そうは言っても実用に足るツールを作るのは容易でないわけで、基本的にはプロが提供しているツールを活用するのが正解だろう。しかし全てを「自分ではない誰かが作ったもの」に頼ると常に「把握しきれていない」という環境に置かれることになる。ひとつくらいは全てを把握している道具を持っていた方が気持ちは楽だなと思う。<br>デジタルツールに限った話ではなく、自分の手足のように使いこなせるものが何かひとつあると心が安らかになる気がしている。<br>",
		"pin": false
	},
	{
		"title": "図太い人は図太くない人の手助けができると思っているのかも",
		"created": "2022/03/22 20:35",
		"edited": "2022/03/23 16:49",
		"tag": "生きる/自意識との折り合い",
		"body": "図太い人は図太い人同士でいた方が話もすいすい進んで居心地が良いのではないかと思うが、わざわざ自分とはタイプの違う図太くない人に絡んでいくことが結構見られる。<br><br>不思議だなと思っていたが、もしかすると図太くない人のことが貧弱に見えて、何かしてやれると考えるのかもしれないと思い至った。叩き直してやろう、活を入れてやろう、ズバッと問題解決してやろう、云々。「近所のお節介なおばさん」「若者相手に持論展開したいおじさん」みたいなタイプの存在は色々なところでよく登場する。<br>何かしてやれるというのは大概勘違いなのだが、世話を焼きたい性質までもを厄介に思うのは少し薄情かもしれない。まあ自分の有能さのアピールのために「自分より弱そう/愚かそうな人間の世話を焼く」という行動を選択するのはやはり迷惑だが、みんながみんなそういうわけではあるまい。<br><br>一方、図太くない人が図太い人に対して「あの図太さ直してやれたらなあ」と思うこともあるだろうが、まさかそんな心配をされているとは思いもよらないことだろう。<br>",
		"pin": false
	},
	{
		"title": "ツイートまとめを再度試みる",
		"created": "2022/03/22 21:33",
		"edited": "2022/03/22 21:35",
		"tag": "前に進む/デジタルツール",
		"body": "以前[ツイートまとめを作るということ、を整理する - Noratetsu's Room（のらてつ研究所）](https://scrapbox.io/noratetsu/%E3%83%84%E3%82%A4%E3%83%BC%E3%83%88%E3%81%BE%E3%81%A8%E3%82%81%E3%82%92%E4%BD%9C%E3%82%8B%E3%81%A8%E3%81%84%E3%81%86%E3%81%93%E3%81%A8%E3%80%81%E3%82%92%E6%95%B4%E7%90%86%E3%81%99%E3%82%8B)にまとめたが、「ツイートをするはいいがなまじ自分にとって良い感じのことを書いてしまうせいでその後どうしたら良いか悩む問題」に長らく頭を抱えていた。最近はもうすっかり放置してしまっていたが、このサイトを作ったことによりツイートまとめをやりやすくなったと思う。<br><br>ツイートというのはかなり微妙なもので、ひとつひとつ断片でありながら、背景に何かしらの流れがあるので、単体では扱いにくいという性質がある。単体で取り出してもいいにはいいのだが、それだと意味が半減するというか。<br><br>そもそも「ツイート」という形をとってしまうのは、自分の内外にある大きな何かを前提としてそれに対してコメントしようとするからということが多い。タイムラインから切り離して保存したり活用したりするためにはその前提をくっつけておく必要がある。それが結構な手間になる。取り出さないでおけば前後からなんとなく判るものが、取り出してしまうと何のことだかわからなくなったりする。その前提というのが単に「○○について」と言えるようなものなら話は簡単だが、複合的に生じた気分みたいなものが前提にある場合にはそれを言語化し直すのが大変だ。<br>その文脈を整理し直すとして、それは自分にとっては意味があるが、他人にとって意味があるかというと微妙である。読み物として面白いように整えれば問題はないが、ただアウトラインの形で置いておくとただ冗長になってしまう。<br><br>Scrapboxでツイートまとめをやろうとした時の最大の問題は、「良い感じの発想だから公開の場に置いておきたい」と「そこまでではないけど場を分けるのも手間なので公開の場に置こうかと思う」と「これは置いておくのは微妙だから非公開の別の場所が必要」といったふうに、ツイートとして一度公開しているものでありながらその後どうしたいかがそれぞれ異なるという点にあった。<br>こういう差が生じることについてはどうしようもないと思う。「流れてしまうものだから言える」とか「特定の人が読むことを前提にしたものだからツイートすることに意味があった」とか、色々な前提があってツイートは生まれている。それを別の場所に移して別の文脈で読まれた時、望ましくない解釈が発生することを予期せざるを得ない場合はある。<br><br>自分にとって必要だから言いっぱなしで失われないようにどうにか捕まえておきたいのだが、それを公開したい場合があるがために迷いが発生していた。<br>このサイトを作ったことに伴い、公開と非公開を簡単に切り替えられて且つ一緒に管理できる形態になったので、ツイートを見直してノートを作るということはかなりスムーズになると思う。<br>",
		"pin": false
	},
	{
		"title": "無鉄砲でないと活動できない",
		"created": "2022/03/22 22:18",
		"edited": "2022/03/23 16:50",
		"tag": "生きる/自分を守る",
		"body": "もちろん本当に考え無しだと困るのだが、ある程度は無謀なところがないと何もできなくなってしまう。<br>特に文章を発表するという時、「みんな知っているかもしれない」「既に書かれているかもしれない」「間違っているかもしれない」etcという懸念を持ち始めるととても書いていられなくなる。そういう可能性に最初から思い至らない方が強くて、そうでなければ「他に優れたものや正しいものがあろうが自分が書くことにも意味がある」と納得しなければならない。<br><br>多分、「そんな程度で人に向けて言うのか」という評価の仕方を幼い頃からずっと耳にしてきたから、私はそれを反射的に恐れてしまうのだ。<br>",
		"pin": false
	},
	{
		"title": "2022-03-23",
		"created": "2022/03/23 11:50",
		"edited": "2022/03/24 12:09",
		"tag": "日記/2022/03",
		"body": "切り出し→[[公開用ファイルの中で非公開の記述を書けるようにした]]<br><br><br>「反省しろ！」と人に言う人間が大体反省してない問題。<br>「あいつは人を見下している！」と言う人間が大体人を見下している問題。<br>「○○は～～すべきだ」「○○は～～に違いない」と言いたい時、どうして言いたいのかをよく考える必要がある。「良識の代弁者」になる義務なんて無いわけで。<br><br><br>Fusen.html（自作の付箋ツール）に[[偏愛マップ]]を作り始めた。<br>参考：[色んな人の「偏愛マップ」を見てみたい、そしてnoteでマガジンにしてみたい。｜タムラカイ / 変革の仕掛けと仕組みをデザインする人｜note](https://note.com/tamkai/n/n0d450aeb943a)<br>紙のノートとかPowerPointとかにも作ったことはあったのだが、前者は画像を貼れない、後者は頻繁に見ないという難点があって折を見て更新し続けるということができなかった。<br>Fusen.htmlは色々やりやすい。画像も貼れるし動画もmp3も貼れるようにしたし。アウトラインにまとめられるし。一応紙面のサイズも無制限だし（下方向に無限に広がる）。→[[メディア付箋機能を作った]]<br><br>で、色々書いているのだが、たくさん書き出しているはずなのに自分が空っぽのような感覚が消えない。<br>色々好きなものがあるが、「詳しくない」。「好き」と「詳しい」は別に必ずしもイコールではないと思うが、「なんとなく好き」で十分とは思えない気持ちがある。<br>あと「他に好きなものがあったはずだが」という気分も大きい。これだけのはずがない、という気持ち。どこか的を射ていない感覚。<br>他にもあったはずだというのは列挙を続ければいつかは納得する地点に辿り着くかもしれない。しかし「詳しくない」の方は解決しない気がする。詳しくなりたいと思っていないので。<br>",
		"pin": false
	},
	{
		"title": "公開用ファイルの中で非公開の記述を書けるようにした",
		"created": "2022/03/23 15:23",
		"edited": "2022/03/23 15:30",
		"tag": "開発日誌/Chanoma",
		"body": "特定の記号を前後の行に置くとJSONを生成する際にその間がスキップされるようにした。<br>公開したくない記述も公開するmdファイルの中に書き込むことができるようになった。<br><br>例えば日記ファイルの中に、個人名を含む記述を書くとか、ちょっと感情的なことを書いてしまうとか、そういうことができるようになる。<br>念の為公開前にデータをチェックする必要はあるが、情報を分けずに済むのでかなり楽になると思う。<br>非公開ファイルへのリンクもその中に書いて、自分用のビューワ（ローカルファイル）ではスキップしないでおくという手もある。<br>",
		"pin": false
	},
	{
		"title": "メディア付箋機能を作った",
		"created": "2022/03/24 11:32",
		"edited": "2022/03/24 19:44",
		"tag": "開発日誌/Fusen",
		"body": "Fusen.htmlの機能追加。<br>今までは「画像付箋」としていたのを「メディア付箋」にした。<br>設定するアドレスのホストや拡張子で条件分岐して色々表示させることができる。<br><br><h3>現在貼れるもの</h3><br>画像<br>YouTubeの動画/再生リスト（埋め込み可能な動画のみ再生可）<br>mp3、m4aファイル<br>mp4ファイル<br>ツイート（Twitframeでiframe埋め込み）<br><br><br>PDFも普通に埋め込めるかな。といっても表示が小さすぎて現実的じゃないか。<br>あとあんまりあれこれ貼ると重くなりそう。<br>",
		"pin": false
	},
	{
		"title": "2022-03-25",
		"created": "2022/03/25 10:18",
		"edited": "2022/03/25 23:30",
		"tag": "日記/2022/03",
		"body": "言葉選びが適当というのは、言葉選びが適当なこと自体が悪とは言えないけれど（速く伝えたいがゆえの場合もある）、言葉選びが適当な人が他のことなら慎重であるとは思い難いので、人間性を信用されにくい要因にはなるだろう。<br><br><br>[[偏愛マップ]]を引き続き書いているが、書いても書いても納得しない。自分の核を取り出せていない感じがする。<br>そもそも、核になるような何かはあるのだろうか？<br>「これ」と指し示せる何かがあってほしいと思って探しているが、本当にあるだろうかという気持ちになっているし、少なくとも特定の名詞ではないような気がする。<br>分野ではなく概念で括っていく必要があるかもしれない。<br><br><br>JavaScriptの勉強を始めて以来、自分の時間をつぎ込んできたのでDynalistの中身が整理されずにぐちゃぐちゃになっていた。<br>今日久々に片付けた。ちょっと面倒だったが、Inboxは空になったしスッキリした。<br><br>JavaScriptやTypeScriptについて知りたいことはまだまだあるし、今日新しい教材を読み始めもしたが、このサイトを作ったことで一応一段落ついた。<br>このサイトを作ったら書き込もうと思っていたことがたくさんある。ツイートした話を後でまとめて追記しようということも考えていたし、それらを書き込んでリンクを作っていくのが楽しみになっている。<br><br>ブログも書かないとと思っている。書いていない間の心境というのはその時その時で違っているのだが、現在は「これ終わったら！！！書く！！！」という感じ。書きたいけど書けないとか書かなきゃいけないけど面倒くさいとかいう感じではない。そういった気持ちを打破する記事を書いたし、書いたことで打破された。<br>大抵のもやもやは「よくわからないけど、なんとなく嫌なところがある」という曖昧さが元で手足に纏わりついて枷になっている。何がどうなっているのかを整理してしまえばまとめて置いておくことができる感じがある。<br><br><br>切り出し→[[堂々たる様相に気圧さるるべからず]]<br>",
		"pin": false
	},
	{
		"title": "堂々たる様相に気圧さるるべからず",
		"created": "2022/03/25 23:09",
		"edited": "2022/03/25 23:32",
		"tag": "生きる/自分を守る",
		"body": "[のらてつ(@Foam_Crab)/2022年03月25日 - Twilog](https://twilog.org/Foam_Crab/date-220325/asc)<br>堂々とした感じの人がなんか言うと反射的に「そうかもしれない…」と考えだすの、半ば本能な気がするし仕方がないことかもしれないけど、単に「堂々とした感じ」に気圧されているだけではと思い直す習慣は持っておいた方がいいよねと思う。<br>堂々としているだけあって確かにその通りなのかもしれないし、威圧がまかり通ってきただけで別に妥当な言い分じゃないかもしれない。それは内容を客観的に見て判断しないといけない。<br>客観的にというか、堂々としている感を差し引いてそれでも頷けるかどうかというか。自信なさげに弱々しく言われても「その通り！」と思えるか。<br><br>―――<br>自分よりちゃんとしてそうな人の意見に不安を覚え反射的に靡いてしまうのは、自分が愚かであるかもしれないことに耐えられないからだろうと思う。<br>なるべく早急に愚かさを矯正してしまいたい。なので「そうかも」と思って自分の意見をすぐさま点検して軌道修正してしまう。<br><br>もちろんそれは自省の機会なのであって、軌道修正が妥当な場合は多々ある。立派な人を敬い、話を聞いて内省するのは生きる上で大切なことである。<br>しかしながら、「尊敬の念」ではなく「語気の強さ」に屈してすぐさま自分の方を曲げてしまうのはよろしくない。相手が何者であろうが敢然と立ち向かうべき場合もある。<br>誰かを反射的に自分の上に置き、反射的に自分を曲げてしまう、そうする度に「自分はそうした」という経験が蓄積されていく。自分以外の強そうな誰かに屈するのが習慣になる。<br><br>自分の考えを改めることに抵抗する必要はないが、ざわざわした気持ちで焦って軌道修正してしまおうとせず、沈思黙考の末「確かにそうだな」と納得することが自分の精神のために必要なことだろうと思う。<br>",
		"pin": false
	},
	{
		"title": "2022-03-26",
		"created": "2022/03/26 10:19",
		"edited": "2022/03/26 23:14",
		"tag": "日記/2022/03",
		"body": "Dynalistで、済んだ項目を移動させるのがやりづらい。Moveがあるからまだ良いけど、それでも正確に項目名を導き出さないといけないし複数の場所に同じ文言があると移動先を指定するのが煩わしい。<br>「ドキュメント間の情報の移動」「同ファイル内で離れた位置間の情報の移動」ってかなり頻繁に起こることのはずなのに、それがスムーズにできるツールは少ない。テキストエディタは画面分割ができるものが多くなっている一方でそれ以外のツールではほとんど見かけない。そうすると画面分割機能のためにテキストエディタでどうにかするかなあという気持ちになってくる。<br>そもそもそういう使い方をしようというのはアウトライナーの使い方としてよろしくないのかもしれないが（そうなのかな？）、複数ファイルを作成できるようになっているにもかかわらず直感的な項目移動ができないのは物足りない。<br><br><br>切り出し→[[自分用データを構築できるようにした]]（茶の間改良）<br>切り出し→[[公開用・自分用切り替えボタン設置]]（茶の間改良）<br><br><br>Obsidianでやりたかったmdファイル運用を、今になってスムーズにできている。<br>ポイントはどこかと言えばやはり「ビューワ」の存在なのだろう。Obsidianのシステムはすごく良いのだが、作り上げた情報空間を「見る」時に自分好みになっていない。一番Obsidianを使っていた時にはまだCSSのスキルも乏しかったということもあるし、ライブプレビューでもなかったから余計だ。<br>自分好みの見た目だと気持ちが良いよねというふわっとした気分の問題もあるのだが、それ以上に、自分好みのビューワを作るとそれに合った粒度や内容の情報を書き込むことになるのが重要である。こういう空間を作りたいというイメージが固まることによって適切な粒度が必然的に定まっていく。これが大きい。<br>",
		"pin": false
	},
	{
		"title": "自分用データを構築できるようにした",
		"created": "2022/03/26 16:54",
		"edited": "2022/03/26 16:56",
		"tag": "開発日誌/Chanoma",
		"body": "mdファイル群からjsonファイルを生成するPythonコードを改良して、公開用データの他に自分用データを同時に生成できるようにした。<br><br>自分用データと公開用データの違いは、<br>①公開用mdファイルのフォルダとは別のフォルダにあるmdファイルを読み込む<br>②公開用mdファイルの中の非公開の記述を表示する（除去処理をしない）<br>の二点。<br><br>自分用データの分類タグ画面↓<br>![screenshot](https://gyazo.com/7b52ae92c5f7bce8c55cde434c0e3fc2/max_size/1000)<br>「＠private」タグは「private」フォルダの中身ということ。訪問者には表示されていない。<br>フォルダの中の各mdファイルのタグはその下の「日記/～」とか「生きる/～」の部分だけで、「＠private」はjsonファイルを生成する時に付与している。<br>フォルダはいくつでも作れるので、やろうと思えば色々なジャンルで細かくフォルダ分けして表示することも可能。その場合ファイル名が他のフォルダにあるファイルと重複しないように気をつける必要がある。<br>まあ多分フォルダ分けはほとんどしないと思う。あくまで公開と非公開を分けられるというのが重要。<br>",
		"pin": false
	},
	{
		"title": "公開用・自分用切り替えボタン設置",
		"created": "2022/03/26 16:55",
		"edited": "2022/03/26 16:56",
		"tag": "開発日誌/Chanoma",
		"body": "自分用のページに、公開用データに切り替えるボタンを設置した。<br>![screenshot](https://gyazo.com/68a109673be20292e26471fed922aae9/max_size/1000)<br><br>公開用のファイルの中に非公開の記述を書き込めるようにしているので、それがちゃんと取り除かれているかをぱっと確認できるようにしたかった。<br>ボタン押すたびにfetchして再構築する形になっているけど、意外と処理が速い。すごく速い。<br>ノート数が増えた時に具合が変わってきたら最初にまとめてデータを読み込むことにしよう。<br>",
		"pin": false
	},
	{
		"title": "2022-03-27",
		"created": "2022/03/27 14:23",
		"edited": "2022/03/27 22:20",
		"tag": "日記/2022/03",
		"body": "切り出し→[[リンク済みキーワードの一覧を表示可能にした]]（茶の間改良）<br>切り出し→[[分類タグを複数設定できるようにした]]（茶の間改良）<br><br>切り出し→[[リンクによる関連付けと階層による関連付けの活用]]<br><br><br>ツイートした文章を持ってくる時、どんなに「なんてことない」ような文言だとしても、ツイートには「ツイートとしてこれを発信する」という気構えがあるので、そのままコピペするのはしっくり来ない。<br>Scrapboxで[[ツイートまとめ]]を試みたときもそれが一つの違和感になっていたのだが（なので人の言葉の引用のような書式で書いていたのだが）、茶の間でどうするかも決着がついていない。いちいち埋め込みにするのもなんか違うよなという感じがする。<br>spanで囲ってclassをつけて云々とするほどのものでもない。簡単に区別したいが、現実的なのは文頭に記号を付けるとかだろうか？<br><i>あるいは斜体とか…。</i>でも斜体ってあまり好きでない。<br><br>例えば、<br><br>[▼](https://twitter.com/Foam_Crab/status/1507869417602183168)茶の間（自作ミニブログ的な何か）を作ったら、何か栓をされていたところが開いたような感じがしている。とても良い感触がある。<br><br>と書くことにするとか。<br>▼マークは「自分のツイート」という意味だということを知らせる術がないが…Aboutに書けばまあ良いだろうか。それとも「TW」とか？<br>",
		"pin": false
	},
	{
		"title": "リンク済みキーワードの一覧を表示可能にした",
		"created": "2022/03/27 17:57",
		"edited": "2022/03/27 18:01",
		"tag": "開発日誌/Chanoma",
		"body": "どれかのノートでダブルブラケットで囲っているキーワードの一覧を表示できるようにした。<br>![screenshot](https://gyazo.com/53a6913506caaca41bb30442f07cfc63/max_size/1000)<br>青字はそのタイトルのノートが存在し、赤字は空リンク。<br>右の数字は「リンクにしているノートの数」と「（リンクも含め）言及しているノートの数」。長くなるので「リンク数」「言及数」と書いているが、キーワードが出てくる回数ではなくキーワードを含むノート数を指している。<br>まだノートが少ないのであまり恩恵を感じられないが、記述が増えてくればどういう話題が多いのかがわかりやすくなると思う。<br><br>各キーワードをクリックすると、そのキーワードに関するリンク欄にリンク数分の「<<青字（バックリンク）」と言及数-リンク数分の「<<緑字（非明示的バックリンク）」がついているのがわかる。<br>※本文中にそのノートのタイトルを記述している場合は言及数が一つ余計に増える。例えば「コンセプト」ノートでは本文中に「コンセプト」と書いているため言及数が一つ多い。（他のノートからの言及が2、自身の言及が1で合計3になっている）<br>",
		"pin": false
	},
	{
		"title": "分類タグを複数設定できるようにした",
		"created": "2022/03/27 18:01",
		"edited": "2022/03/27 18:04",
		"tag": "開発日誌/Chanoma",
		"body": "今までは分類タグを一つしか設定できなかった。<br>複数設定時のタグ欄↓<br>![screenshot](https://gyazo.com/f45f4089887ddc47044e5fef2f396762/max_size/1000)<br><br>タグリストにはこのように同じノートが複数箇所に表示される↓<br>![screenshot](https://gyazo.com/bebac858bee056dc26f672b2ef9fe441/max_size/1000)<br><br>修正が若干面倒くさかった…。<br>まあ実現できたので良かった。<br>これで「どっちに入れようか迷って結局どっちにしたんだっけ」的な悩みからは解放される。<br>",
		"pin": false
	},
	{
		"title": "リンクによる関連付けと階層による関連付けの活用",
		"created": "2022/03/27 19:05",
		"edited": "2022/03/27 21:43",
		"tag": "開発日誌/Chanoma,前に進む/デジタルツール",
		"body": "リンクによる関連付けと階層による関連付けを複合的にやっているわけだが、これはかなりの安心感がある。<br><br>[[Scrapbox]]でも「括るもの」としてのタグを付けることがあるが、そのタグによるページ間の関連度合いは弱く、「関連リンク」として常時されていなくてもいい。能動的に「これと同じ括りにしているものを探そう」と思った時に把握できれば良い。<br>それならリンクを使わないで検索に頼ってもいいのではという話にはなるのだが、自分がどういう括りを使用しているのかはパッとわかるようになっていないと不便である。<br>つまり、<u>既に存在している括りをサジェストで呼び出すために</u>リンクとして書いている。<br><br><br>茶の間では「言及している」という意味のリンクと「大体同じ領域にある」という意味のタグを区別している。<br><br>同じタグがついている他のノート群は分類タグをクリックするか子項目を開いていけば表示されるが、ノート画面のデフォルトの状態でそれらをひと目で確認できるようにはしていない。<br>例えば茶の間の開発日誌タグの中身が常に見えていたとすれば「これまでこういうノートを書いたんだなあ」ということはわかるが、今書いている日誌と一ヶ月後に書いた日誌とで関連する可能性はかなり低いように思う。関連する場合はなくはないが、タグの中身を常時意識する必要があるわけではない。日誌を書く時にちらっと見ればよく、サイト上で是非とも確認したい情報ではない。確認したい時に確認できるように分類タグリストは子項目を開けるようにしてはいるのだが、今のところ開いて確認したくなったことはない。<br><br>一方、リンクの方は常に表示されていてほしい。Scrapboxの場合はリンクが常に表示されていてほしい類の情報を扱っているとは限らないので「Scrapboxでも関連リンクは常に見えていてほしい」というわけではないのだが（[ということを以前Scrapboxにも書いたが](https://scrapbox.io/noratetsu/abt_%E9%96%A2%E9%80%A3%E6%AC%84%E3%81%AE%E3%82%B5%E3%82%A4%E3%83%89%E3%83%90%E3%83%BC%E5%8C%96%E3%81%AF%E3%83%8E%E3%82%A4%E3%82%B8%E3%83%BC%E3%81%98%E3%82%83%E3%81%AD%EF%BC%9F)）、茶の間に書いているのはリンクが常に表示されていてほしい類の情報である。<br>常に表示されていてほしいというのは、「リンクさせたことを覚えていない」「知らぬ間に関連性が生じている」といったことはツールの方から教えてくれないと思い至ることが無いからだ。<br>で、ダブルブラケットを使ってリンクにしたかどうかも把握していないので、茶の間では「ここではリンクしていないけど他のノートではリンクにしているキーワード」とか「リンクにはしなかったけどこのノート（のタイトル）に言及しているノート」がわかるようにした。（→[[非明示リンク表示の実装]]）<br>それらを能動的にリンクしたものと混ぜると混沌とするので、並び順は下にして色も変えて「こういうキーワードもありますよ」とそっと教えてくれるくらいの感じにしている。明示的リンクが増えれば下に追いやられていき、いずれスクロールしないと見えなくなるかもしれない。<br><br>非明示的フォワードリンクを実装したことによって、「リンクされるべきだけどリンクできていないから関連性が見えないページ」というのが少なくなることが期待できる。現時点では非明示的フォワードリンクに2hopリンクはつけていないので完全に捕捉するわけではないが、とりあえずキーワードの存在がわかり、それをクリックすれば他のノートとの関連もすぐにわかる。<br>なお、非明示的フォワードリンクに2hopリンクをつけるとおそらくリンク欄が無意味に長大になるので今後もつけないだろうと思う。痒いところに手が届くものを作りたいが、痒くもないところをバリバリ引っ掻いてもしょうがないのである。<br>そもそもの話、2hopリンクまで捕捉したいほど関連性を感じるキーワードなら、その時点でノートを編集してダブルブラケットで囲めば良いだけのことだ。<br><br><br>リンクによる関連付けを重視するにせよ階層による関連付けを重視するにせよ、どことも関連付けられなかったためにアクセス困難になるノートが生じるのが不安の種になっている。<br>よく「既にあるページと必ず関連付けるようにする」という話がされるが、必ず関連付けられるとは限らない。これまでの関心とは関係のないノートはいつでも生まれうる。<br>情報の海の中で紛失してしまうのを避けるために「未分類」的なカテゴリを作るということをこれまでしてきたが、そのうち「未分類」の中身も広大な海になってしまうことが多々ある。点検してリンクの貼り直しやタグの付け直しをしないと意味がないわけだが、そこに労力を割く気がなかなか起きない。<br><br>上述のような茶の間の仕組みでアクセス不能ノートが一切なくなるかというとその保証は別に無いが、単純な話、リンクか階層タグのどちらかなら付けられるかもしれず、またリンクを一つでも付けられれば「リンク済みキーワード一覧」からもアクセスすることが可能になる（→[[リンク済みキーワードの一覧を表示可能にした]]）。（なお、茶の間では分類タグが空欄の場合「（undefined）」欄に並ぶようにしている。）<br>「取っ掛かりがないせいでどこからもアクセスしにくい情報」が生じ得るという問題が解消されるのが情報管理に於いて一つの重要なポイントであり、茶の間システムでは何段階かサルベージのチャンスを作ることである程度安心なものになっているのではないかと思う。<br><br>あと閲覧者に向けては検索機能を提供していないが、私自身はmdファイル群を普通に検索できる。更にVSCodeでの検索では正規表現を使えるので心強い。<br>",
		"pin": false
	},
	{
		"title": "2022-03-28",
		"created": "2022/03/28 00:34",
		"edited": "2022/03/30 23:23",
		"tag": "日記/2022/03",
		"body": "切り出し→[[自作ツールをElectronで開く]]（Electron）<br>4月はElectronの月にしようと思ったけど、目的を達成するだけならそんなにかからないかも？<br>まあ、知れば知るほど新たにやりたいことが増えるものだからなんだかんだひと月ずっとやってるみたいなことになりそうではあるけど。<br><br><br>勝つとか負けるとか、一体何と戦っているんだと思うことがある。<br>全てに序列を付けて自分と相手との間に上と下を決めなくてはいけないのだろうか？<br><br><br>《https://twitter.com/kinpusha/status/1508415004567306247》<br>まず書名の情報を整理してほしい…。<br>",
		"pin": false
	},
	{
		"title": "2022-03-29",
		"created": "2022/03/29 10:44",
		"edited": "2022/03/30 23:23",
		"tag": "日記/2022/03",
		"body": "切り出し→[[ローカルファイルにデータを書き出す]]（Electron）<br>Fusen.htmlのデータはHTMLのみなんだけどどうにかJSONの形で出力したい…。しかし利用の予定があるわけではないので労多くして功少なしの感もある…。<br><br>今までCards.html、Outline.html、Fusen.htmlの3つのツールを作ったが（いずれも命名は「名無し」と同義）、Electron上で全部まとめてタブ切り替えできるようにしたい。茶の間のプライベート版も組み込んで良いかも。<br>今後何かを作ることがあればElectronを使えることが前提になるのでかなり自由になる感じがする。<br><br>各ツールのデータの規格が揃えば面白いよなあと思うけど、明らかに用途が違うツールだから規格化は無理かな…。<br>",
		"pin": false
	},
	{
		"title": "2022-03-30",
		"created": "2022/03/30 09:40",
		"edited": "2022/04/03 18:59",
		"tag": "日記/2022/03",
		"body": "Pythonファイルをダブルクリックで起動するためのbatファイルを作ってみた。<br>作れたには作れたが、なんというか、とてつもなく実行が遅い。うーむ。<br>VSCodeのターミナルで実行するのもなんだかすごく時間がかかる。コマンドを直接打てばすぐ動くが、Runのボタンをクリックするとなかなか起動しない。<br><br>切り出し→[[自作ツール群をタブ切り替えで使えるようにした]]（Electron）<br><br><br>切り出し→[[私にとって心地よいのは往復書簡]]<br>切り出し→[[意気投合を信じている]]<br>",
		"pin": false
	},
	{
		"title": "自作ツールをElectronで開く",
		"created": "2022/03/30 13:57",
		"edited": "2022/03/30 13:58",
		"tag": "開発日誌/Electron",
		"body": "[[Electron]]の勉強を始めることにした。<br>HTML/CSS+JavaScriptで作ったものでローカルファイルを編集したいので、Electronというやつを習得すればそれができるということだよな？と思って環境構築。<br>参考：[【入門】Electron完全に理解した](https://zenn.dev/unsoluble_sugar/articles/c5b5faefddd35c1be8a3)<br>参考：[Windows10にNode.jsとnpmをインストールする方法 | プロガジ.DEV](https://dev.macha795.com/windows10-node-js-npm-install/)<br>[[Node.js]]、[[nvm(NodeVersionManager)]]、Electronをインストール完了。<br><br>electron-forgeで構築されたファイルを弄って試しにFusen.htmlのファイルを入れて起動させたら一応その通りに表示された。<br>![screenshot](https://gyazo.com/05cf44dcd5e526742d2adcaf68f829d7/max_size/1000){max-height:100%;}<br>あとは保存先をローカルファイルにするようにコードを書き換えてパッケージングすれば良いのかな。<br>ちょこちょこ改良する可能性が高いからパッケージングまでは別にしなくていいか。やるとしてもかなり後になってからで良さそう。<br>",
		"pin": false
	},
	{
		"title": "ローカルファイルにデータを書き出す",
		"created": "2022/03/30 14:18",
		"edited": "2022/03/30 19:48",
		"tag": "開発日誌/Electron",
		"body": "[[Electron]]二日目。<br>Node.jsのAPI？をレンダラープロセスで呼び出す方法が最初わからなくてちょっと戸惑った。<br>Electronのバージョンアップによって古い記事の内容が役に立たなくなっているようだ…。<br>preload.jsを用意してcontextBridge.exposeInMainWorld()というメソッドでAPIを作るというのを覚えた。<br>参考：[Electronでrequireができない？【プロセスとコンテクストとプリロードスクリプト】 – スマホ教室ちいラボ](https://chiilabo.com/2021-12/electron-require-error-process-script-context)<br><br>とりあえず手動保存時にデータをテキストファイルに書き出すというのを実装した。<br>データをlocalStorageで扱っていると何らかの理由で消えてしまうのが怖かったし、データをGit管理したかったのでローカルファイルに出力する仕組みを早く作りたいと思っていた。ひとまず安心。<br><br>外部ファイルを読み込むのはまた今度にする。<br>",
		"pin": false
	},
	{
		"title": "意気投合を信じている",
		"created": "2022/03/30 18:58",
		"edited": "2022/04/03 21:52",
		"tag": "生きる/信じるべき人を信じる",
		"body": "以前[うちあわせCast](https://anchor.fm/rashita)で（<strike>[第六十三回](https://scrapbox.io/thinkandcreateteck/%E7%AC%AC%E5%85%AD%E5%8D%81%E4%B8%89%E5%9B%9E:Tak.%E3%81%95%E3%82%93%E3%81%A8%E3%80%8C%E3%82%A2%E3%82%A6%E3%83%88%E3%83%A9%E3%82%A4%E3%83%8A%E3%83%BC%E3%81%AE%E4%BD%BF%E3%81%84%E6%96%B9%E3%83%89%E4%B8%8B%E6%89%8B%E5%95%8F%E9%A1%8C%E3%80%8D%E3%81%AB%E3%81%A4%E3%81%84%E3%81%A6)だったか</strike>[第六十五回](https://scrapbox.io/noratetsu/%E2%96%BD%E3%81%86%E3%81%A1%E3%81%82%E3%82%8F%E3%81%9BCast%E7%AC%AC%E5%85%AD%E5%8D%81%E4%BA%94%E5%9B%9E%E6%84%9F%E6%83%B3)だった）、Tak.さんから「こういう人どこかにいるはずだと思ってた」というような言葉をいただいたけれど、私より人生を長く歩んでいらっしゃって且つ面識のある人数の規模もずっと大きいであろうTak.さんがそう仰るということは、「自分に似た人」って本当に少ないんだなと思う。どこかにいるはずでも見かけることがほとんどない種の人間。<br>実際、意気投合できた人って本当に僅かしかいない。いないわけではないだけ幸福なのだと思うし、その相手もみんな「人と話が合わない」「同じタイプの人と初めて知り合った」と言う。<br>何か話したり書いたりした時に面白いとかわかりやすいと思ってもらえるということは、私（たち）はそんなに変なことを言っているわけではないと思うのだが…。まあ、そういう人生なんだろう。<br><br>いやでも、どちらかというと「意気投合があり得ることを信じている」からそういう風に感じるのかもしれない。そもそも意気投合することがあるということを信じていない人の方が多いような気がする。「一人で戦っている者同士の同盟」みたいなのはしばしば見るが、必ずしもそこに意気投合があるわけではない。<br><br>「魂の共鳴」みたいなものは本当にある。それが起こる奇跡的な瞬間を知っているから、私はそれをずっと求め続けているのかもしれない。",
		"pin": false
	},
	{
		"title": "私にとって心地よいのは往復書簡",
		"created": "2022/03/30 19:03",
		"edited": "2022/03/30 20:25",
		"tag": "生きる/コミュニケーションを滑らかにする",
		"body": "そもそもワイワイやるみたいなのは好きじゃないし、事物について語り合うことに実のところあまり興味がない。<br>事物ではなく「この人と話す」ということに意味を強く感じる。<br><br>昔一時期匿名掲示板に書き込んでいたこともあったけど、結局ピンとこなかった。読むのは面白かったけど参加することに特に良さを覚えなかった。<br>そこにどういう人間がいて誰と話しているのかがわからなかったからだろう。<br>「誰」といっても、個人を識別できて人間性を継続的に感じられればいいのでHNがあれば十分であり、その点Twitterは丁度いい温度だなと思う。<br>年齢性別その他の属性は要らない。「なくてもいい」というより、もっと積極的に「要らない」。人間性に深く関わっている属性ならば開示されていると話が通じやすくはなるが、属性を前提にして話をしたいとは思わない。例えば男と話したいとか女と話したいとか、そういうのはない。<br><br>みんなで集まって何かやるというよりも、「この人と一緒にやりたい」が重なり合った結果として集まって何かやることになる、という方が形としてしっくり来る。<br>《https://twitter.com/Foam_Crab/status/1506204000546222087》<br><br>「この人と話す」を対面の会話や通話ではない形で表現するならば「往復書簡」になるだろうと思う。<br>その辺のことは前に[「さざなみScrapbox」 - Noratetsu's Room（のらてつ研究所）](https://scrapbox.io/noratetsu/%E3%80%8C%E3%81%95%E3%81%96%E3%81%AA%E3%81%BFScrapbox%E3%80%8D)でも書いているが、「ひとつの場に集いたいこともある」という表現はそれだけでは正確ではなかった感がある。<br>誰かとTwitterやチャットなどで盛り上がることがあるとして、それはやはり「その人と」「Twitterやチャットだから」盛り上がったのであって、「その内容だから」盛り上がったわけではなかったりする。<br><br>私自身が二次元オタクの中にいたことがあるから思うことかもしれないが、「同好の士」ほど面倒くさいものはなく、交流に必要なのは「何に興味があるか」ではなく「どういう種類の魂を持っているか」だと感じている。<br>視野狭窄に対する嫌悪感や危機感からか交流を「広げる」ことばかり勧められるが、「広げないと駄目なんだぜ」と言われると「うるせえ」と返したくなる。視野狭窄を防ぐために必要なのは交流より見聞であり、交流を持てば見聞を得られやすくまた知ったことを蔑ろにしにくいことから視野狭窄を防ぐ助けになるのは事実だろうが、一方で視野狭窄を防ぐような「広がりのある交流」は交流を広げようとして得られるものではないと思う。<br><br>この人は素晴らしい、この人と一緒にいたい、という人同士の地道な連鎖によって広がっていくのが「視野狭窄を防ぐ交流の輪」であろう。<br>（そもそもそういう感情を他者に対して持たない人もいるのでピンとこない人はピンとこないだろうが、ここでピンとこない人と一緒にいることで私やその人の視野狭窄が防がれるかというと甚だ疑問である。）<br><br>往復書簡をやり取りしたくなるような人、というのが相互に連鎖して紹介し合ったりして結果的に輪が広がっていくのが理想だなと思う。<br>",
		"pin": false
	},
	{
		"title": "自作ツール群をタブ切り替えで使えるようにした",
		"created": "2022/03/30 23:14",
		"edited": "2022/03/31 00:29",
		"tag": "開発日誌/Electron",
		"body": "Electronで複数ツールをタブ切り替えできるようにした。<br>参考：[Electron - WebView から BrowserView に移行する | 豆蔵デベロッパーサイト](https://developer.mamezou-tech.com/blogs/2022/01/07/electron-browserview/)<br>参考：[BrowserWindow | Electron](https://www.electronjs.org/ja/docs/latest/api/browser-window)<br><br>一度読み込んでしまえば切り替え時に再読み込みにならないのでぱっぱっと切り替えられる。<br>ついでにブログも表示できるようにした。<br>![screenshot](https://gyazo.com/9ad9432916cd07624dbf5a02c86c1b33/max_size/1000)<br><br>これでChromeのタブもちょっとスッキリするな。<br><br>タブ部分とツール部分は別のウインドウみたいなことになっているのでデベロッパーツールも別々になっており、各ツールのデベロッパーツールはツールバーとかショートカットキーとかで呼び出せないのでどうしたもんかなとちょっと思ったけど、main.jsに各ビューのデベロッパーツールを表示するコードを書けたので解決した。<br><br>とりあえず最低限こうできたらいいなと思ったことは実現できた。<br>Node.jsのファイルの読み書きの挙動がちょっとよくわかってないので納得できる形になるまであと何日かかかりそう。<br>",
		"pin": false
	},
	{
		"title": "「無理です」は伝えないと配慮してもらえない",
		"created": "2022/03/31 18:34",
		"edited": "2022/04/03 22:21",
		"tag": "生きる/自分を守る",
		"body": "[のらてつ(@Foam_Crab)/2022年03月31日 - Twilog](https://twilog.org/Foam_Crab/date-220331/asc)<br><br>昔は助けを求めるのが本当に下手だったけど、今はちょっと求められるようになった。<br><br>声をかけさえすれば味方になってくれたかも知れない人に声をかけられずに潰れたというのを既に通ってしまった。潰れた事実、潰れたことによる傷は消えることはないが、成長して今の自分を支えられるようになれば過去の自分も多少は救われる感じがする。<br><br>「もう無理です〜」みたいなことはちゃんと言わないと如何に心優しい人でも酌み取ってはくれないし（というか、尊重した結果口を出さないということになる）、この人はもう無理なんだなというのをわかってもらう努力は自分の為に頑張ってしなければならない…。そういうことを一度死に瀕して学んだ…。<br><br>無理「そう」の時点で動かないと、本当に無理になってからでは助けを求める勇気なんて生まれないんですよね。ギリギリまで頑張ってボキッといったのであんな思いは二度としたくない。折れてしまってからの惨めな自分には差し伸べられる手も屈辱的に感じてしまい、いよいよどうしようもなくなっていく。<br><br>他の人は平気で生きているのに自分だけ無理になっているという事実を受け入れられなくてなんとか自力で立ち直ろうともがき続けて結局溺れて沈んだという感じでしたが、当時はやはり精神というものについてあまりに無知だった。<br><br>別に鬱を軟弱と思っていたとかでは全然ないけど、というかむしろ鬱というのはちゃんとした原因があると思っていたから、自分の中に鬱になるに足る理由を見いだせなくて自分の場合はただ軟弱なのだと思ってしまった。実際は鬱になるに足る理由がバリバリあったにもかかわらず。<br><br>いや今書いてて「そうだったのか」と思った。そうだったんだ。（今更）<br>",
		"pin": false
	},
	{
		"title": "意図を勘定に入れて読む",
		"created": "2022/04/01 09:41",
		"edited": "2022/04/03 22:06",
		"tag": "こだわる/文章を読む",
		"body": "[のらてつ(@Foam_Crab)/2022年04月01日 - Twilog](https://twilog.org/Foam_Crab/date-220401/asc)<br>意図を勘定に入れるということは、○○さんが〜〜と書いたという時、情報としては「〜〜」の部分の数倍のものを認識していることになる。よく「行間を読め」とか言うが（その表現自体は好きではないが）、行間にみっちり情報を見出している状態だろう。そうなるとそうサクサク操作はできない。<br><br>書かれていないことは如何に読みに妥当性があっても書かれていない以上「決定事項」として扱ってはいけないが、書かれていることが書かれていることだけで完成しているとも限らないので（果たして言語化できた文字情報だけで完成し得るのか疑問）、「仮定」であることを踏まえた上で補完が必要と思う。<br><br>全く同じ文言をAさんとBさんが書いた時、論文なら同じ意味だが、文芸なら同じ意味とは限らない。文芸というか、論文以外は必ずしも同じ意味にならない。ルールに基づいて同じ意味にするのが論文であって（多分）、それ以外のほとんどの文章は基づくべきルールを持っていない。<br><br>AさんとBさんが「赤いリンゴが好き」と書いた時、確定しているのは両方「赤いリンゴが好き」だけだが、AさんとBさんが同じことをイメージしてそう書いているとは限らない。それ以上のことを書かなかったからには正確なイメージを読み取ってもらえないのは仕方がないが、敢えて外して読む意味もない。<br><br>行間を読むか読まないか、またその幅や深さは読み手それぞれであってその分だけ解釈は広がるものだが、いずれにせよ書き手の意図は何通りもあるわけではないし、逆にひとつの意図はある。書き手は読み手がどの程度行間を読むかを想定して書くことになるが、そこから外れる層をフォローするのは困難。<br><br>↓関連すると感じるツイート<br>《https://twitter.com/masayachiba/status/1510220255922376704》<br>",
		"pin": false
	},
	{
		"title": "ルールの遵守が結局誰かの生活にとって悪だった",
		"created": "2022/04/01 11:53",
		"edited": "2022/04/04 11:05",
		"tag": "生きる/自意識との折り合い",
		"body": "[のらてつ(@Foam_Crab)/2022年04月01日 - Twilog](https://twilog.org/Foam_Crab/date-220401/asc)<br>↓以下のツイートからの想起（元ツイートの文脈に沿っているわけではない）<br><iframe border=0 frameborder=0 width=100% height=300 src='https://twitframe.com/show?url=https://twitter.com/finalvent/status/1509689483331248128'></iframe><br><iframe border=0 frameborder=0 width=100% height=300 src='https://twitframe.com/show?url=https://twitter.com/rashita2/status/1509689940359413761'></iframe><br>「清く正しく美しく」的なものから外れても別に生きていけるし生きていいという実感は持った方が良さそう。<br><br>若かりし頃はルールは遵守すべきであるという気持ちが強かった、というかそれが当たり前だと信じていたが、不本意ながら投げ出す羽目になったことによってせいぜい「守った方が組織にとって無駄が生じない」程度だなと思うようにはなった。（ルールの種類にもよるけども）<br><br>人間という生き物はポンコツなのでちゃんと書いておかないと自分が他者の邪魔になっていることもわからないことばかりなので、それぞれの生活を守るために必要なルールもある。「運営に都合がいいルール」と「生活を守るルール」の間に線を引けるようになるためにルール厳守マンからの卒業が必要。<br><br>これはルールの遵守が結局誰かの生活にとって悪だった、という結論を得たということでもあるな。自分が不必要に振りかざすことで周りを害することになるのはもちろん、自分の人生をも歪めることになり、歪んだ状態では更に「善」でコーティングした無意識の悪行を重ねることになる。<br><br>以前の尺度での「悪」側に落ちたことによって、むしろ落ちる前が（全てではないにせよ）「悪」であったことに気づいたという状態。<br>",
		"pin": false
	},
	{
		"title": "客観性からのジャンプ",
		"created": "2022/04/01 15:52",
		"edited": "2022/04/04 11:12",
		"tag": "生きる/信じるべき人を信じる",
		"body": "[のらてつ(@Foam_Crab)/2022年04月01日 - Twilog](https://twilog.org/Foam_Crab/date-220401/asc)<br><br>About:[地頭、素直、信頼 – R-style](https://rashita.net/blog/?p=30933)<br>Keywords:[[戦略的な素直さ]]/[[地頭力]]<br><br>（自分なりに）頷きながら読みましたが、言葉の印象として、「素直」の2文字に「ひとまず正しいものとして見る」と「フラットに見る（偏見を主としてあらゆる前提を除外して見る）」の少なくとも二つの態度が同居していそう。前者は文中にある通りですが、後者はいわゆる地頭の延長っぽい感じがする。<br>それぞれ「否定的に見る」と「フィルターをかけて見る」の対義語としての「素直に見る」だけど、なんかこう、なんか違う。（言語化保留）<br><br>[倉下 忠憲@rashita2](https://twitter.com/rashita2/status/1509743756983283712) もし僕が後者の意味を強調するなら「客観的」という言葉を使いそうです。<br>[倉下 忠憲@rashita2](https://twitter.com/rashita2/status/1509743963737301002) 「正しいとする」というのは、それ自体が前提を含んだものであるので、客観的ではない、という差異がありますね。<br><br>そうそう、そこなんですよね。客観的ではない状態で（ひとまず）正しいとする。となると、客観的ではないということを良くないものとしていると、この態度にはなれないのかもしれません。<br><br>同居していた一方に「客観的」の3文字による切り分けがなされたことでどこに難所があるのか急に解った感がある。（正しいかどうかはさておき）<br><br>[倉下 忠憲@rashita2](https://twitter.com/rashita2/status/1509749258505039874) つまりそれが「賭け」ということですね。客観性=善、からのジャンプ。<br><br>なるほど。最初に読んだときには「自力では客観的に見ることに限界があるので賭けに出る必要がある」という印象がありましたが（つまり客観性が\"十分でない\"）、客観性が足るとか足りないとかの次元ではなくもっと大きいジャンプが語られているという感じがしてきました。<br><br>（「やむを得ずやること」と「積極的にやっていくこと」の差も感じる。一人では外に出ていけないから他者の価値観をひとまず正しいものとして受け取るという時に、「自力では無理なので」という文脈と「賭けに出ることにこそ豊かさがあるので」という文脈があったとすると両者の雰囲気はなんとなく違う。）<br><br>先の記事での「信頼」は「その人も他者を信頼して賭けに出ているかどうか」によって決めることになりそうだなと思う。当たり前といえば当たり前ですが。<br>というか、「とりあえず、正しいとして受け取る」の後に残す逃走線の太さ（？）的なものがそれぞれなのかも。「正しいかもしれない」の度合いのパーセンテージ。手放す必要が生じたときにすぐ切り離せる程度か、もっと染み込んでいて引き剥がすには自分自身もベリッとやらなければならないか。<br><br>「肯定的に見る」と「客観的に見る」は、こう書くと当たり前に別のものなのに、それぞれ「望ましくない見方」の逆であることによって変に同居しているという感じがしてきた。それぞれ達成できることは違う。<br>あとあの…あれなんですよね、「『客観的に見た結果』を肯定的に見る」ことが成り立ってほしい場って地味に複雑な構造になってしまっているんだなと思いました。<br><br>そもそも個人にできる「客観視」って、自分が考える「主観」から離れているというだけであって「自分の主観ではないレッテル」を貼り直すだけのことでしかないことばかりな気がする。自分自身の偏見から脱したからといって偏見から抜け出たわけではない。囚われていないかもしれないが妥当でもない。<br>偏見を捨てれば正しく見ることができる、というのは幻想。<br>人間は人間というもののことをそんなに知らない。勉強した覚えないでしょって感じ。<br>",
		"pin": false
	},
	{
		"title": "「認識のズレ」を「視野の広さ」と誤認する時",
		"created": "2022/04/02 18:29",
		"edited": "2022/04/02 21:30",
		"tag": "生きる/自意識との折り合い",
		"body": "誰かが何かを言って、それが自分の想像の外にある時、それをどう解釈するか。<br>もし自分に自信がないとすれば、「自分には思いも寄らなかったことにこの人は思い至るんだ、すごい！」と思うかもしれない。それが正しいことも確かにあるだろう。<br>一方で、自分に自信があるとすれば、「なんでこんなズレたことを言うんだろう？」と思うかもしれない。それが正しいこともまたあり得るだろう。<br><br>自分に自信がない人ばかりが集まっている時に、誰かが大声でズレたことを言ったとする。そうするとたくさん人がいるにもかかわらず、「自分が未熟だからあの人の言うことに今まで思い至らなかったんだ。まだよくわかっていないけどあの人が正しいのかもしれない」とそれぞれが思って、結局誰も正さないかもしれない。<br>「ズレている」のか、「視野が広い」のか、判断できるだけの材料と自信がない限り見分けることは困難なのである。<br>そこで、言っている内容を判断する材料を欠いている代わりに、相手の「前科」で判断するということはよくある。より信頼できる人が批判していたとか、自分でもわかるポイントでおかしなことを言っていたとか。継続して観察していられるなら「前科」が目に入ることもあるだろう。しかしいつでもそうして判断できるわけではない。<br><br>できることとしては、長期的には「自信を持てるだけの経験を積む」こと、短期的には「とりあえず保留にして相手を観察し総合的に判断する」ことであろう。<br><br>専門でもない領域のフェイクニュースの見極めを自力でやるのは難しいように、自分の理解が届かない相手の話の真偽を見破るのは困難だ。自分の力が追いつくまでは、信頼できる誰かの評価を頼らざるを得ない。<br>フェイクニュースならファクトチェックをやってくれる団体が下した結論を聞いて「なるほど」と思うことになるだろうし、人間ならその人が誰と懇意にして誰から批判されているかなどを見る必要がある。批判に囲まれているようでも人間関係を見ると信頼できるはずだとわかるかもしれないし、みんなに称賛されているようでも周りにいる人間が怪しげならば「ちょっと待てよ」と踏みとどまるかもしれない。<br>いずれにしたって「絶対」はないわけだが、より正しいらしいものを見極めるためには、より当てになりそうな人の判断をひとまず取り入れていくしかない。<br>いきなりそれそのものと対峙して正しく判断できるということは、恐らくあまりない。<br><br>様子を見て判断する必要があるというのは、既に自信があろうが同じである。<br>過去の判断が比較的合っているからといって、今目の前のものに対する判断も合っている保証など無い。過去の栄光に惑わされて歳を重ねるごとに狂っていった人は数限りなくいる（若かりし頃は気鋭の○○だった人が最後は「老害」になってしまうパターンだ）。常に「当てになりそうな人々」の様子を見て多角的に判断していかなくてはならない。当てにしている人が態度を表明しないようなら、訪ねていって直接意見を聞く必要もあろう。沈黙には沈黙の理由がある。<br>そして「当てになりそうな人々」のリストは絶えず更新を考えることも肝要だ。自分と同じかそれ以上の年代ばかりとか、その他の属性があまりにも偏っているとかいうことでは、それは本当に「当てになる人々」なのか甚だ怪しい。<br><br>どういった存在をどういった基準で信頼すべきなのか、ということについてはつい昨日投稿された[地頭、素直、信頼 – R-style](https://rashita.net/blog/?p=30933)がとても参考になる。参考になるといってもチェックリストを用意してくれているとかいうことではなく、どういう態度で生きていくべきなのかという話である。<br>[>その判断は、間違うことがある。というか、最初は間違うことの方が多いだろう。そうした経験を経て、徐々に自分の判断基準を磨き上げていくわけだ。また、長期的なスタンををとることで、「絶対」というものはないこともわかる。ある時期は良いことを言っていたけども、最近は……みたいなことが起こる。あるいは、自分のジャッジメントそのものがバイアスに歪んでいたと後から気がつくこともある。]<br><br>あまり妥当ではないものを信じて支えにしてしまうようなことは、なんとか避けたいものである。<br>",
		"pin": false
	},
	{
		"title": "ディスプレイサイズと認知資源",
		"created": "2022/04/02 21:16",
		"edited": "2022/04/03 21:33",
		"tag": "",
		"body": "スマホでチェックした時は文量に圧倒されるような気持ちになった記事が、PCで開いたら別にそんなすごい量でもなかったし普通に読めた、という体験をしばしばしている。ディスプレイのサイズが認知資源の消費にかなり影響している…。<br><br>読む時に、無意識にですが段落単位などで割って意味を拾ってその中で書き手の意図と「こだわりたいところ」的なものを判断していくというような形になるので、ディスプレイが小さいと割った一塊だけでディスプレイを埋めている状態になって意図の流れを掴みづらくなる。濃淡が見えにくい。<br><br>（tweets）<br>",
		"pin": false
	},
	{
		"title": "2022-04-02",
		"created": "2022/04/02 21:34",
		"edited": "2022/04/03 19:05",
		"tag": "日記/2022/04",
		"body": "一昨日の夕方から腰痛に悩まされて、昨日は一応痛みは引いたけど腰痛がスタンバイしている感触があって嫌な感じだった。今日もなんとなく油断すると危ないという感じでいる。<br>精神的に悩みが多かった時代はずっと腰痛を抱えていたものの、最近は全然痛むことはなかった。掃除機かけに気合を入れすぎた時は一時的に痛くなったが、一時間もすれば治っていたと思う。なので久々に苦しんだ。<br>原因はよくわからない。強いて言えばまあストレスということになるんだろうか…。<br><br><br>[[Treeify]]というChrome拡張機能アウトライナーがすごい。<br>《https://twitter.com/Treeify_jp/status/1509396117070675968》<br>開いているタブと連動していて「そんなやり方あるのか」と思った。タブ地獄から容易に抜け出せて本当にすごい。<br>連動しているというのがありがたいことであると同時に操作ミスの元にもなっていて、普通に×で閉じてしまうとTreeifyからも消えてしまうのがちょっと注意が必要なところ。あと別のページを同じタブ内で開いていくのも要注意。「ページ」ではなく「タブ」と連動しているということを意識して使う必要がある。<br>それだけが戸惑うところで（仕組み上仕方がないと思う）、あとは様々痒いところに手が届く作りになっている。引用を保存しやすいのがものすごくありがたい。開いているタブのノードの子項目に自動的に追加されるし、更にそれぞれに出典が記録される。タブ内でページ遷移することで引用ノードの親項目が別のページを指してしまっても、引用それぞれに出典が添えられているから何も問題はない。<br>ネットサーフィンのやり方自体が大きく変わりそうだ。<br><br><br>切り出し→[[「再構成」は難しい]]<br><br><br>素朴な感想だが、人の文章はプログラムのコードではない。（当たり前）<br><br>そういえば、昔ブロント語を面白く思っていた時期があったのだが、こういうのを面白がるかどうかもまあ人によって大きく分かれるよね。<br>そもそもなんでブロント語ってものを知ったんだっけ…。リアルタイムではないしブロントさんがやってるゲーム（FF11？）も私はやったことがないから一体何の話をしているのかはわからない。ただ何かのきっかけで知って面白いなと思っていた。今でも語録見ると面白いけども。→[ブロントさん名言集](http://burontosan.com/)<br><br>迷台詞だらけだけど何が言いたいのかは大体わかるというのが面白い。文法と単語選びはめちゃくちゃでありながら、文脈を作る力があって解釈の方向性に迷うことが少ない。<br>（2chコピペは他人の黒歴史をいつまでもおもちゃにしている感じがかなり不快なのだが、ブロントさんについてはそういうキャラクターとして存在している状態だからか特に嫌悪感はない。ダブルスタンダードだろうか？）<br><br>今思ったけど、滝沢カレンさんの面白トークに自分の中でうっすら既視感があって、その既視感の正体というのはブロント語だったのかもしれない。（滝沢カレンさんのトーク自体がブロント語と似ているというのではない）<br>エルシャダイのトレーラーも思い出したけど、エルシャダイの方は文法は一応合っているのに何言っているのか全然わからんやつなのでブロント語とは逆なのかも。<br>",
		"pin": false
	},
	{
		"title": "「再構成」は難しい",
		"created": "2022/04/02 23:22",
		"edited": "2022/04/04 18:06",
		"tag": "前に進む/表現の手段",
		"body": "ツイートまとめをしようとする時に感じることが多いが、一度何かしらの形で構成したものを再度別の形に構成し直すということはかなり難しい。というか、とてつもなく面倒くさい。<br>その面倒くささというのは厳密に言ってどこにあるのか、まだ曖昧かもしれない。<br><br>ツイートにしろブログにしろ、そこで発信する時は「話の中身」というのはそのままの形ではなく、可読性とか説得力とかを高めるために色々と修飾することになる。それを外すのがまず億劫だということがある。誘導するための文脈があり、その上に乗せるための表現になってしまっているわけで、それを文脈から切り離すのが大変に感じる。<br><br>一本のリニアな流れを作ってしまうと、後から脇道を作るのはかなり面倒な感じがする。<br>ツイートまとめを作ったとき、そこに情報を加えるにはどうしたら良いか迷うことが多々ある。Scrapboxにやっていた時は自分のツイートを引用記法でそうとわかる形にしておいて追記したが、茶の間システムの中でどうしたら良いかは微妙なところだ。<br>ツイートの連投は直前のツイートを前提として次のツイートを作っているのであり、ツイートとツイートの間に新たに文章を差し込むと意味が繋がらなくなる。繋がるようにするには認知資源を消費して編集を加えることが必要だ。<br>そもそもなぜ後から脇道を作らなければならないかと言えば、ブログその他での計画的な表現と異なり、達成すべきものが曖昧なままなせいで作品として完成していないからである。今回はこれを伝えられればいいというようなものがない。むしろ生まれるのは色々な分岐ができる土台部分であり、どの方向にでも進化しうるイーブイみたいな文章なのである。<br><br>その意味では、一度アウトライナーに流し込んで文単位でノードを分けて整理するなどした方が良いかもしれない。アウトラインなら枝分かれを表現することが可能になる。<br>となると、（Drummerが少し参考になるが、）ツイートまとめという単位ではなく「私が発した全文章」をバーッと並べて構造化してからツリーごとに切り取っていったら良さそうか。<br>ツリーとカードを行き来するということ。ツリーのままだとネットワークは作りづらいからカードの形態は必要。カードだけだと俯瞰できていない心もとなさがあるのでツリーの形態もほしい。<br><br><br>あとツイートまとめの場合の根本的な問題点は、ツイートというのが発信の場のものであるにもかかわらず、準備の場を設けず直に書いてしまっているところにあるかもしれない。<br>そうではなくて、言いたいことの核が、つまり所謂アトミックな状態でまず言語化されていて、それをツイート仕様に整えて出すならば、その後の再構成も恐らく簡単だ。再構成というより再利用であって、構成を壊して作り直すのではなく「新たにイチから」になるからである。<br><br>人に読まれて意味が通るようにすることを意識するからこそ生まれる言葉や発想というのがあって、そのマジック的なものに頼っているところがあるのだが、後々のことを考えるとそれが枷になっているようである。<br>しかも自分は「ツイッタラー」として生きたいのではないのだから、美しいツイートを目指すことにはあまり意味がない。わかりやすいツイートをしようとしてどうするのだろうという気がしてくる。<br><br>まあせっかく茶の間を作ったのだから、とりあえず茶の間の方に書くということを習慣づけるのが解決の第一歩になるかもしれない。<br>",
		"pin": false
	},
	{
		"title": "「推し」に対する絶対的好意と相対的好意",
		"created": "2022/04/03 09:49",
		"edited": "2022/04/03 21:33",
		"tag": "",
		"body": "「私はこの人のファンである」というのを強く意識する時、その人のことを絶対的に好きなのは確かだが、その人をありがたく思う度合いは（「有り難さ」なのであるからして）他の「そうではない存在」との比較によって相対的に強められるものではないかと思う。<br><br>よって「そうではない存在」に対するマイナス感情が大きければより「有り難さ」が増すであろうし、主観的なマイナス感情とは別に、「『そうではない存在』に対する解像度」が高くて「他はそうではない」を意識することになればやはり「有り難さ」が強まりそうである。この前者と後者は似ているが別に見える。<br><br>そもそも「そうではない存在」というのをグルーピングする気がなければ「そうである存在」が際立つことはないので「推す」ことはなくなるのではと思う。全体を暗く感じればこそ光が目立つのであって、全部等価で暗くも明るくもないと思えばそこにありがたさは生まれない気がする。<br><br>光や陰を強く意識せずにフラットに見ることができるのも良いことだろうし、暗さに覆われていることを真実として光をありがたがるのもまた良いことだろうと思う。あるいは個人ではなく領域に明るさを感じることも良いことだろう。暗さに飲み込まれて全てを無価値化して不貞腐れているのが一番危ない。<br><br>ただしこの「良いこと」であろう各種の態度同士は共感し合えない気がするし、互いに違和感を覚えるとか言い出すと要らぬ諍いが生まれるので、真に「まずい状態」は何かを意識して他のあり方は放っておくということが大切だと感じる。<br><br>ただこの話は「ファンである」ということを主体的に選択している人の話なので（よってそれぞれは全くバラバラに別な人を推しているものとする）、流行に乗っているミーハーな層が作り出す圧力についてはまた別の論点が必要な気がする。<br>ミーハーというか、ファンが集団化した時の圧力か。でも集団化はもはやその対象と自分との関係性の外にある何かの話になっている。<br><br>from [のらてつ(@Foam_Crab)/2022年04月03日 - Twilog](https://twilog.org/Foam_Crab/date-220403/asc)<br>",
		"pin": false
	},
	{
		"title": "トンデモ本が駆逐される世界は苦しそう",
		"created": "2022/04/03 14:26",
		"edited": "2022/04/03 21:33",
		"tag": "",
		"body": "トンデモな本を見かけるとうわっと思うけど、トンデモな本までもが本として生まれて生きているというのはある種の安心感がある。「正しくありたいけどまだ正しくなれていないもの」が存在する余地を感じる。もちろんトンデモな本に影響力を持たれては困るわけですが…。<br><br>「間違っているもの」を徹底して排除してしまうと「個人の感想」的なものも悪しきものとして排除されそう。更に悪いことに、その中で「間違っているけど無難っぽくて気分を良くするもの」は見逃されそう。<br><br>（tweets）<br>",
		"pin": false
	},
	{
		"title": "ロゲルギストと月光会",
		"created": "2022/04/03 17:46",
		"edited": "2022/04/03 21:52",
		"tag": "生きる/信じるべき人を信じる",
		"body": "（ロゲルギストと月光会についてのページではないが、自分がわかりやすいので）<br><br>『思考の整理学』p160「談笑の間」の項について。<br>著者の外山滋比古氏は、専門の異なる二人の友人と「三人会」と言ってしばしば集まって語り合うということを三十年以上（※執筆時点）続けているとのことだ。<br>時間を忘れて語り合い、名残を惜しみながら別れる。そうやって何十年も創造的雑談を重ねられるグループがあるというのは、とても素敵なことだなと思う。<br><br>同書p164に、著者が『知的創造のヒント』で書いた文が『新物理の散歩道第四集』の「まえがき」に引用されたのを孫引きしてあるが（複雑）、その最後に、<br>[>ロゲルギストは専門の同じ学者が集って、しかも、すばらしい成果をあげている例だが、メンバーはよほど心の広い人たちであるに違いない。よほど、つよくて温かい友情に結ばれているに相違ない。]<br>とある。その通りなのだろうなと思うし、そういう空気に憧れるところがある。<br>そのためにはまず自分が賢く温かく心の広い人間にならなければならないが。<br><br>――<br>[のらてつ(@Foam_Crab)/2022年04月03日 - Twilog](https://twilog.org/Foam_Crab/date-220403/asc)<br>十年以上前に何かで、物理学者の重鎮みたいな御方が分野の異なる数人の友人とサロン的な仲良しグループを形成していて何とかという名前をつけており、そこで発生するセレンディピティが素晴らしいのだと語っているのを読んだのだが、誰の何というグループでそれを何で読んだのか思い出せない…。<br><br>その話を読んで「これは素晴らしい」と思って、だからそのエピソードはずっと忘れないで覚えているのだが、当時のメモの取り方があまりにも駄目だったのでメモを取ったかどうかもわからない。多分紙で読んだからPC内にはないかな…。紙だけど本でも新聞でもないような…（本でも新聞でもない紙とは）。<br><br>六十とか七十とかになっても「いつものメンバー」で集まって毎度知的成長に繋がる豊かな話ができる人生には憧れがあります。<br><br>あーいや、知的生産系の本のどれかだろうか？　昔の時点で読んだ何かか。<br>[[『思考の整理学』]]じゃんね。<br>（ちょっとボケた感がある）（p163です）<br>メタ・ノートの項は折に触れて読み返していたけど他の部分は何度も読んだわけじゃなかったかも。一通り読み返すか。<br><br>仲良しグループという表現は私の脚色ですが（あとロゲルギストの方は同じ分野の専門家グループだった）（更にセレンディピティは別の項だった）、継続的に大体同じメンバーで会を開き続けられるのはすごいことだなと思う。<br><br>記憶が適当過ぎる！<br>辿れただけ良かったけども。スッキリした。別の何かで読んだと思いこんでいたなあ。<br><br>『思考の整理学』の「談笑の間」の項で、著者は体験談として専門の違う者で集まって話し合うのが良いと語り（＝ロータリー方式）、一方同じ専攻で集まり創造的雑談をしている例として「ロゲルギスト」について触れ、またロゲルギストから「月光会（ルーナー・ソサエティー）」を連想すると書いている。<br><br>著者自身の体験の話とロゲルギストの話と、それに続く項のブレイン・ストーミングの話（ここでも月光会とロゲルギストについて触れている）と、それとは別の項で「脱線がセレンディピティをもたらす」という旨のことが書いてあったのが混ざっていた。一冊の本の中であるだけマシだが…。<br><br>憧れはあるけども、自分が人に知的興奮を与えられるようでなければ得られるわけもない。精進が必要。<br>",
		"pin": false
	},
	{
		"title": "2022-04-03",
		"created": "2022/04/03 18:40",
		"edited": "2022/04/03 22:29",
		"tag": "日記/2022/04",
		"body": "ここのところツイートばっかりしている。言語化が進むのは良いが、ツイートが増えること自体は自分としてはあまり良くない傾向だと思うのでちょっと抑えないといけない。<br>とりあえず数日分のツイートを見返して、ひとまとまりになる内容はmdファイルに転記して茶の間に引っ越しした（Twitterからは消した）。<br>Twitterより先に茶の間（というかmdファイル）に書くべきなんだけどスマホでTwitterを見てしまうとそっちで書いてしまう。<br>切り出し→[[リアルタイムで反応できる状態だから反応してしまう]]<br>",
		"pin": false
	},
	{
		"title": "リアルタイムで反応できる状態だから反応してしまう",
		"created": "2022/04/03 22:29",
		"edited": "2022/04/04 00:11",
		"tag": "生きる",
		"body": "[[2022-04-03]]時点で、ツイートが増えていることがちょっと悩みになっている。<br>[[「再構成」は難しい]]でも書いたが、ツイートという形で放出してしまうと後が困る。新たに言語化が進むのは良いのだが、その後なんともし難い。何しろツイートは既にそれでひとつの完成形になってしまうからだ。<br><br>そもそもどうしてツイートが増えるのかと考えると、まあ「スマホで」「Twitterを開いているから」である。<br>スマホだとTwitterを見ながら他の何かにメモするということをやりづらいので、Twitterを開いていて何かを思いついたらついツイート画面にメモしてしまう。そのまま呟けそうならツイートボタンを押してしまう。誰かが反応するとそれに対してまたツイートしてしまう。こうしてTwitter上で言語化を進めてしまう。<br><br>情報を見てしまうと、その時点で何かが思い浮かんでしまうというのが注意すべきポイントだろう。思い浮かんだ以上は書き留めないと失われてしまってもったいないのでその場で言語化することになる。<br>また、誰かがTLにいて呟いたことについて何か思い浮かぶと、せっかくだからその人に読んでもらおうかなどと思ったりもする。ツイートを引用して語りたいようなものはその場でなくてもいいのだが、TLに流れている何らかの話題についてとなると、その機を逃すと今更感が生じるような気がしてしまう。これはもっと流速がはやい環境でTwitterをやっていた感覚の名残かもしれない。<br><br>いずれにせよ情報を見るタイミングをコントロールする必要がある。<br>自分の頭の動きを振り返ってみると、情報を最初に見た瞬間だけ思い浮かぶものというのがかなりあるような気がする。二回目以降はあまり鮮やかな思考が浮かばない。なので最初に見た時が一番書きやすい状態である。つまり最初に見るタイミングで、考え事をするにあたって万全の態勢を整えておいた方が良いだろう。<br><br>早い話が、Twitterは一日一回、パソコンの前で見た方がいいということだ。<br>Twitterを見て言語化のタネを増やすのはそれなりに大事だと思っているので、ある程度「きちんと」チェックできるように時間の取り方を考え直すことにしよう。<br>",
		"pin": false
	},
	{
		"title": "2022-04-04",
		"created": "2022/04/04 09:12",
		"edited": "2022/04/07 23:08",
		"tag": "日記/2022/04",
		"body": "茶の間改良→[[茶の間改良220404]]<br>地味に気になっていたところが解決した。<br><br><br>茶の間の粒度はもう少し小さくするつもりだったが、色々書いてしまっているな。<br>まあアトミックに書くことが目的ではないし、大きい記事になっても別に良いけど。<br><br><br>ツール作りはまあ大体いいかなという感じなのでプログラミングについては減速する。<br>Electronでローカルファイルを読み込むまでできるようになったので解決したかったものはほとんど解決した。<br>気になっているところはなくもないけど、ちまちまやると「もっと直せるところはないか」と考え始めて時間が無駄になるので後でまとめてやった方が良さそう。<br><br>プログラミングを始めたことで犠牲になった習慣みたいなのが色々あるのだが、それらを元通りに復活させるのではなく、今度は意識的に本を読むことにする。<br>習慣は大事だけど「習慣のための習慣」みたいなものは優先順位を見直した方がいいなと思った。<br>まあ本はあまりにも読まなすぎて浅学にも程がある…というか、考えるのがだんだんつまらなくなってきたのでインプットが必要だなという感じがしている。<br><br><br>[[読書ノート]]をどうするかということにまだ迷っている。<br>紙に書くとすればA7紙片と決めているのだが、紙に書くかどうか微妙なところ。デジタルツール環境を整えるということをずっと考えていたこともあって、最近は「情報」を紙に書きたいとあまり思わない。一時的なメモは紙に書きまくっているけれども。<br>デジタルツールを使うとすればどれかというのはいまいち定まらない。この頃は偶に何かを読んで書く時はだいたいA7紙片に書いていてデジタルツールに読書ノートはとっていない。<br>Fusen.htmlは読書メモとしても力を発揮するのではとは思うけども、書いた後の処理が微妙である。アウトライン付箋それぞれは1クリックでScrapboxに出力できるが、全体としてデータの形式が整っていないのでなんとなく「ちゃんとしていない」感じがする。一時的っぽい感じが強い。<br>一方プロセス型アウトライナー系はどうも…。読書ノートを作るは良いのだが、作った後の状態がなんだかあまり好きでない。なんというか、「メモ」感はあるけど「ノート」感はないみたいな感じだろうか。<br>といってMarkdownとかプレーンテキストなら良いのかというとそれも微妙。微妙だが、プロセス型アウトライナーよりは良いかもしれない。あるいはプロダクト型アウトライナーでも良いかなあ。文字修飾は欲しいから階層付きテキストではなくWordとかもあり。<br>なおScrapboxは読書ノートとしては使う気にならないので選択肢に入っていない。<br><br>ここまで考えて、[[Cards.html]]の方を改良して読書メモカードツールにするという手もあるのではということを思い始めた。<br>各本のページ順に整列させられる且つ記述ごとにバラして取り扱える且つ自分のメモも同じところに置いておけるという感じだと良い。<br>ちょっと考えてみよう。（結局プログラミングすんのかよ！）<br>",
		"pin": false
	},
	{
		"title": "茶の間改良（2022/04/04）",
		"created": "2022/04/04 09:14",
		"edited": "2022/09/02 23:06",
		"tag": "お知らせ/茶の間更新",
		"body": "①ノート遷移時のスクロール位置の調整<br>これまではスクロール位置の調整をしていなかったので、別のノートを開いた時スクロール位置が先頭に戻るようにした。<br><br>②データの読み込みにエラーがある時用の表示を用意した<br>私がmdファイルに記述する時にまずい書き方をするとjsonにした時に異常のあるデータを生成してしまう。<br>jsonがおかしい時、これまでは表示が「Loading...」のままだったので、エラーがあって読み込めない旨を表示することにした。<br>あとそもそもデータにエラーが発生しないようにpyファイルを修正した。<br>",
		"pin": false,
		"editedFix": false
	},
	{
		"title": "2022-04-15",
		"created": "2022/04/15 18:14",
		"edited": "2022/04/15 19:51",
		"tag": "日記/2022/04",
		"body": "久々の茶の間更新。<br>データの反映を怠っていたとかではなく単に書いていなかった。<br><br>最近はマンダラートツールの自作に取り組んでいた。<br>これが楽しくて楽しくて。ツールをいくつか作ってコーディング能力が上がり、エラーは減ったしやれることが増えた。<br>で、「より良い形式」を掴むと過去作のツールが急に出来の悪いものに思えてきて使う気がなくなっていく。あんなに「良いの作ったぞ！！！自分で！！！」と感動したのに…。<br><br>あと今[[木村泉『ワープロ作文技術』]]を読んでいます。<br>文章のノリが軽妙でとても面白い。インテリ風吹かす的なものを感じない。<br>あとこれ「ワープロ作文技術」と言っているけど、デジタルで書くのが当たり前の今となってはもっと「作文技術」の方に強いアクセントがあれば現代でも十分読まれたかもしれないのになあと思います。当時はワープロというものの目新しさを押し出した方が読まれるだろうという計算があったかもしれないけど（他の著作とのシリーズ風の関連付けという意図もあるだろう）、本質は「ワープロ」というツールに依存した話じゃないのにな、という感じ。<br>ともあれ素晴らしい本です。今読んでも全然古くない（だからタイトルが気になる）。<br><br>ガンガン読んでいくはずがマンダラートツール製作を始めてしまったので牛歩の進みになってしまったのですが、とりあえず「この本は開けば面白い」という気持ちがあるので「億劫」という感じではないです。基本的に読書嫌いな人間としては「わくわくしていられる」というのはとても大きなことです。<br><br>読書とマンダラートツール作りによって、SNSとかScrapboxとかに割く意識が大きく減じた。というか、私の中でScrapboxってSNSと同じ箱に入るんだなと思った。<br>CSSで頑張って自分に寄せるより、そもそもシステムを自分で作った方が良いんじゃと思い始めて、自分の中でScrapboxの比重はひゅーっと下がっている感じがある。他の人が作ったサービスの中ではScrapboxが一番だが、<u>一人で使う場合</u>、用途によっては自分で作った方が良いという感じ。<br>",
		"pin": false
	},
	{
		"title": "介護は程度が軽い方が遥かに大変",
		"created": "2022/04/15 19:02",
		"edited": "2022/04/15 19:28",
		"tag": "生きる/修羅場をくぐる",
		"body": "<iframe border=0 frameborder=0 width=100% height=300 src='https://twitframe.com/show?url=https://twitter.com/hiro_fukushi/status/1514539900627943428'></iframe><br>[のらてつ(@Foam_Crab)/2022年04月15日 - Twilog](https://twilog.org/Foam_Crab/date-220415/asc)<br>「全部やってやる必要がある（けどもはや勝手なこともされない）」方が「多少自力でできる（つまり勝手なこともあれこれやる）（けど一部は介護が必要）」より遥かに楽。（体験談）<br><br>弱るに従って負担が軽減したから最終的にそこまで大変じゃなかったかのような気分になったけど、思い返すと最初の方は本当に悲惨だったな。本当に悲惨だった。<br><br>家族の人格を疑いたくなる場面に度々直面するストレスよ。認知機能の衰えを差し引いても、単に人生上の怠慢で頭の中がそうなっているんだろうと言わざるを得ない部分というのがあって（かなりあって）、言うことを聞くとか聞かないとかそういう次元ではないものに対する心の底からの憤りに支配される。<br><br>○十年生きてそれか、という途方もない虚無感との戦い。敬意が底をついた状態で関わらなければならない苦しみ。まあ、もちろん世話のしがいのある人というのもたくさんいるだろうけども。<br><br>さすが○十年生きただけあるよねと言われる人間にならなきゃいけないなと思いました。<br><br>ハイライトは家の中に出た虫を退治しようと考えた結果マッチで家に火つけるところだった瞬間だろうか。あれ火ついてたら今頃どうなってたんだろう。<br>そういうレベルのことが起こる。まだかなりの範囲を自力でできる段階で。危険なものを遠ざけなくてはならないけど、簡単に丸め込めるほどぼんやりしてもいないので説明するのが非常に億劫。<br><br>元気な人間同士でも「他人の人格」が最大のストレスなわけで、それは介護も一緒だろと思う。苦労の大きさは「物理的に手を貸さなくてはならない度合い」とイコールではない。<br><br>ちなみにこの体験により得たこと→[[「憤り」が死から自分を遠ざける]]<br>",
		"pin": false
	},
	{
		"title": "「憤り」が死から自分を遠ざける",
		"created": "2022/04/15 19:12",
		"edited": "2022/04/15 19:27",
		"tag": "生きる/自分を守る",
		"body": "[のらてつ(@Foam_Crab)/2022年04月15日 - Twilog](https://twilog.org/Foam_Crab/date-220415/asc)<br>（介護に際して憤るあまり）こいつがここまでのうのうと生きてまだなおこの調子で生き続けるというのにどうして私が自分の欠陥を気に病んで世を去らなくてはならんのか冗談じゃないという気持ちになって死にたい気持ちはどっかいった。<br><br>生きるためには「憤り」というのが大事だと思います。義憤が人を強くするし、善悪は脇に置くとして誰かや何かへの恨みつらみが自分を死から遠ざけることにもなる。一方「愛憎」になってしまうと相手を殺して自分も死ぬとか自分の死で相手を一生呪ってやるとかいうことになりかねないけど…。<br><br>というか、自分自身に対して一番憤っている状態だと危ないから（表面上は周囲への不平不満を撒き散らしているとしても）、「いやそれよりこっちの方が遥かに腹立つわ」と思えると直接的な自滅の道からは脱するかも知れない。とはいえ脱して次に足を置いた道が必ず幸せに繋がるとは限らないけれど。<br><br>――<br>ここで書いたのは「自死から自分を守る」ということなので、憤りがあれば良い人生を送れるという話ではない。<br><br>けれど、やはり一番避けたほうが良いのは「自分を無価値だと思うあまり人生から退場する」ということだと思うんですよね。自死には理由が色々あるので他の理由で死を選択することについて「そんなのは駄目だ」と言いたいわけではないですが、「自分を無価値だと思う」という言ってみれば「盛大な勘違い」によって死んでしまうのはあんまりな悲劇です。<br>なのでとりあえず視野狭窄で他の人が素晴らしく見えて自分が駄目に思えてもうこんなやつは死んでしまえとなることを避けるために、憤怒で吠えながら生きていく時間も必要だなと思います。<br><br>あいつが生きているのに私が死ななければならない理由ってどこにあるの？　という気持ちは生きるモチベーションとして私の中では結構強かった。（介護以外のことでもそういうことをしばしば感じられるようになった）<br>一方で「こんなやつら」と思いたくなるような人間に四方八方囲まれていると絶望しかない状態になるので、希望になる存在を見出すこともやはり必要ではある。直接関われる人でもいいし、「推し」でもいいし。<br>今の時代は幸いインターネットがあるので、家にいながらにして、やりようと運次第で「人との繋がり」は得られる可能性がある。<br>希望を見出しながら、同時に憤りによって「私に死ぬ理由などない」「死んでたまるか」という「生への執着」を強めることで、まず自死から自分を守る。そうして次のステップに進めると良いと思う。<br>",
		"pin": false
	},
	{
		"title": "マンダラートツールはすごい",
		"created": "2022/04/15 19:52",
		"edited": "2022/04/15 20:07",
		"tag": "前に進む/デジタルツール",
		"body": "最近マンダラートツールを自作している。<br>![Screenshot](https://gyazo.com/39f4a878e3443fb8795aeec712498dee/max_size/1000)<br>![Screenshot](https://gyazo.com/9d076dc0b3453a8d8b456a20fdce4df7/max_size/1000)<br><br>システム的には「アウトライナーのマンダラート風表示」という感じなのだが、この発想によって、アウトライナーはリニアなのがなあという不満がかなり解消された。<br>日記欄も作っていて、第何週という項目を中心として八方に一週間の各日が配置され、俯瞰モードで一週間を「面」で見ることができる。<br>3x3のマスにするとなんとなく情報量が減ったような感じがするのだが、むしろアウトライナーだと大した情報量じゃないものが巨大に見えているのではないかという気がする。<br>",
		"pin": false
	},
	{
		"title": "2022-05-02",
		"created": "2022/05/02 21:17",
		"edited": "2022/05/03 00:03",
		"tag": "日記/2022/05",
		"body": "昨日今日で[[Fusen.html]]を改良した。（まだ途中）<br>「通常付箋」「リンク付箋」「メディア付箋」「アウトライン付箋」というふうに種類を分けて付箋を生成していたのを、全部統一することにした。<br>そして付箋の中に付箋を貼る形でアウトラインを作れるように挙動を変更。<br>データの種類を減らして簡単にしたのでOPML化がやりやすくなった。とりあえずデータの保存をOPMLにするところまではやったので、明日以降OPMLファイルの出力を実装しようと思う。<br><br>あと茶の間のデータ生成をPythonからNode.jsに引っ越したいのだが、実行されるべきコードは多分書けたものの、非同期処理がよくわからなくて実行順を思い通りにできず中断した。<br>fetchとかPromiseとかはちょっと使えるようになったけど、現時点のコードは関数の構造がまずくて処理を明快に書けていない。頑張ればなんとかなりそうな気はするけどちょっとハードルが高いのでとりあえず保留に。<br><br><br>この頃「ひらく」ということに対して努力したい気持ちが右肩下がりになっている。比例してつまらない人間になっていると思う。何かについて「面白いと思う」ということはあっても、「楽しい気持ち」になっていない。<br>プログラミングに取り組んでいるのはとても面白いことなのだが、多分に「人間と関係する必要がないから」というのも動機づけになっていると思う。<br>何かを共有したい気持ちが全然なくなっているので、Scrapboxの公開プロジェクトも触っていない。<br><br>[知的好奇心向上委員会 コミュニティ / Twitter](https://twitter.com/i/communities/1496761082442297347)は書き込んでいて楽しいので何かあれば書き込みたいのだが、提供できるものがほとんどないのが悩み。「自分の考え」ばかり書いていて、全然「シェア」ができていない。<br><br>切り出し<br>[[Twitterがメインの場になっているのは「とじ」の証拠]]<br>[[「考える」がアイデンティティを構成しているから余計なことも考える]]<br>[[見るべきでないものは見るべきでない]]<br><br>[[最大の関心事が自己なので「自分語り」は自分にとって普通の行為]]<br>",
		"pin": false
	},
	{
		"title": "見るべきでないものは見るべきでない",
		"created": "2022/05/02 21:21",
		"edited": "2022/05/02 23:07",
		"tag": "生きる/自分を守る",
		"body": "余計なものを見て気分を害し、それがこの世に存在しているということに対する恐ろしさなどを自分の中で消化しきれないことがよくある。<br>そうすると折り合いをつけるために折り合いがつくまでネガティブな言動が続いたりする。<br>無邪気さが失われる、とも言えるかもしれない。<br>→[[無邪気さが失われると元に戻れない]]<br><br>このことの重要な点は、「見ることさえなければそうならなかった」ということだ。<br>この世の現実は私が観測しようがしまいが全く変わらないのに、見てしまったがために、自分の心境が負の方向に引っ張られる。<br>しかも、見ずに済ませることもできたということは、自分とは直接関係ないことなのである。いくらか関わりのある人間のことだったとしても、見ないでおくことができる範囲のことは見なくていい。<br><br>自分が何かをするために事実を確認しなければならないという場合は別だが、何もする気がないことについて余計に「見る」必要は全く無い。<br>自分の気分を健全に保つ努力は自分でしなければならない。わざわざ見て具合を悪くしているのはただ愚かと言うほかない。<br>",
		"pin": false
	},
	{
		"title": "Twitterがメインの場になっているのは「とじ」の証拠",
		"created": "2022/05/02 21:44",
		"edited": "2022/05/02 22:14",
		"tag": "生きる/自分を守る",
		"body": "一般的にではなく、私個人の話として。<br><br>自分が[[Twitter]]に書き込んでいる状態というのは、外に向けて広く発信しているようでありながら、実際には大体「とじ」の状態にある。自分の見解を一方的に書いて流すものであって、誰かと一緒に何かを作り上げていくような態度ではない。防衛的態度と言える。<br><br>そもそも、自分の中にある情報というのが何かシェアしたいものではなく「見解」「気づき」ばかりになっているから、発信の場としてTwitterに流すのが自然ということになっている。口数は多いが何かを「語りたい」という気持ちは減っている。<br>何かについて「見解」を述べた時、述べた以上は自分の言葉に責任を持たねばならないという思いが働き、自分の言ったことや考えに対して検証を加えることになる。そうすると自省や新たな気づきをまた発信することになる。ずっと「自分の考え」についてぐるぐる考えることになるので、そういう話ばかりになる。それは楽しい人間の姿ではない。<br>楽しい人間にならなければならないかはまた別の話だが、とりあえず事実として快活な人物像からは離れていく。<br><br>そういうふうに考えている状態の方が結局は「自然」で「楽」なのだが、人前でそうしていたいかというと、うんとは言えない。でも考え事をするにあたってTwitterは簡単で捗るのでTwitterで発信している。<br>フォロワーが増えれば話が変わってくると思うが、経験から言って1000人より少ないならTwitterは割に安全で気楽である。今使っているのはフォロワーが140人なので（見てくださっている方ありがとうございます）、気楽さで言えばかなり気楽だ。1万人の世界とかはどうなってしまうものか知らないが、多分気楽さはほとんど損なわれているだろうと思う。現状気楽なので、考え事をしてそのまま発信してしまう。<br><br>読んでもらいたいのかというと微妙なところだが、積極的に「私はこんなことを考えているんだぞ」と言いたいというよりは、「せっかく考えたから」と思って見えるところに放流してしまうという感がある。<br>逆に「私はこんなことを考えているんだぞ」という気持ちが一定以下なせいで、かえって「ちゃんと文章を拵えて満を持して然るべきところに出す」ということができていないのだとも思える。<br><br>基本的に、「とじ」の状態はあまり好ましい在り方ではないと思う。嫌なものや自分を脅かすものから身を守るためにシャッターをガシャンと閉めることは時には必要だと思うが、それでは自分が経路を断ちたいもの以外のものまでもを図らずもシャットアウトしてしまうということにもなる。「とじ」の状態に魅力がないからである。端的に言って自分が「不愉快な人間」になる可能性がある。<br><br>つまるところ、Twitterに書く気楽さの誘惑に耐えて、別の場所で考える必要がある。（何回もその結論には至っている気がするのだが）<br>",
		"pin": false
	},
	{
		"title": "無邪気さが失われると元に戻れない",
		"created": "2022/05/02 22:15",
		"edited": "2022/09/12 11:54",
		"tag": "生きる/自分を守る",
		"body": "自分の話だが、無邪気さを一度失うとなかなか回復できない。ずっと朗らかにいる人の努力はすごいなと思う。<br>理屈的なことを言わなくていいのが結局幸福な状態で、そうしていられなくなると理屈に傾いていき、無邪気さは失われていくという感じ。<br><br>無邪気さを失うパターンとしては、「理屈を求められたから理屈的に考えるモードになってしまった」というルートと「自分の世界を守るために理屈で戦う必要があった」というルートとがある。<br>理屈を求められても躱せばよく、自分を脅かすかのようなものも「取るに足らない」と思えれば別に戦う必要はない。そうする覚悟がないがために、他者の存在やその言動に引っ張られて自分が無邪気さを捨てることになる。<br><br>自己をどう構築してしまうか、ということかもしれない。<br>特に「見せる自己」をどう築くか。一度理屈に傾くと、理屈を軸にした自己が「見せる自己」になっていってしまう。最初はそうでなかったかもしれないが、成分が少しずつ置き換わっていつの間にかそういう自己になっている。<br>そうなってしまうと簡単には元に戻らない。「理屈っぽい自己」から「無邪気な自己」に移るというのは、対外的には「本性を現した後で猫をかぶる」ようなものだからだ。自分の中ではそうではなくとも、見た目としては「演じている」ような感じがするであろうことが容易に想像できる。<br>簡単にできないどころか、もしかしたら不可逆な変化かもしれない。私は何度かブログの転生やアカウントの作り替えという形でリセットしては同じことを繰り返している。<br><br>結局のところ、他者の影響力を過大評価するのがこのルートに陥る決め手になってしまうのだろう。<br>「理屈を求められた」パターンにしても、それはそこでちゃんと力を証明しないと自分が正しく見てもらえないような気がするからである。「自分の世界を守ろうとした」パターンは言わずもがなで、他者を怪獣のように思うから身構えることになる。<br>仮に相手が偉くて且つ性格の悪い人間だったとしたって、自分が何か権力を持っていない限り、それを奪取すべく貶めるというようなことは起こらない。むしろ「何者でもない」ということは、「攻撃されなければならない存在でもない」ということであって、ネット上でエンカウントした利害関係のない赤の他人に対しては安全なポジションと言える。<br><br>直接刃を向けもしないのに私のことを傷つけられる人間というのは、本当は存在しないと考えたほうがいいのだろう。",
		"pin": false,
		"editedFix": false
	},
	{
		"title": "「考える」がアイデンティティを構成しているから余計なことも考える",
		"created": "2022/05/02 22:19",
		"edited": "2022/05/02 22:27",
		"tag": "生きる/自意識との折り合い",
		"body": "[[Twitterがメインの場になっているのは「とじ」の証拠]]を書いた後で思い至った。<br><br>「考える人間である」という自己認識が邪魔になっていると感じる。<br>何に対してであれ、それについて考えを巡らせて言語化できる状態でありたいという気持ちが常に働いている。つまり自分の思考を説明しようとする。誰に頼まれてもいないのに。<br><br>自分の強みとして「考える」という行為を位置づけているせいで、それをなかなか自分から取り除けない。ついて回っているという感じがする。<br>言語化することが自分のことも他人のことも別に幸せにしないようなことについても、ほとんど見境なく言語化しようとすることになる。言語化の労力はタダではなく、他にできた何かを犠牲にしてそれをやっている。<br><br>もちろん「考えるのをやめる」「思考を停止する」ということは良くないのだが、「目につき次第やる」みたいなことが良いこととも思えない。自分のリソースの配分を間違っていると思う。だからいつも時間がない。<br><br>ここ数ヶ月、人生を無駄にしているという感じがする。<br>",
		"pin": false
	},
	{
		"title": "最大の関心事が自己なので「自分語り」は自分にとって普通の行為",
		"created": "2022/05/02 23:45",
		"edited": "2022/05/02 23:57",
		"tag": "生きる/己を眺める",
		"body": "人それぞれ関心事は様々だろうが、私の場合興味の対象というのが自己なので、自分の興味について語るとなると必然的に自分語りになる。<br>Noratetsu Labもそうで、如何にして自分語りを記事の形にするかについてわざわざ書き綴ったくらいである。<br><br>自分語りというのは個人的なことなので、私の自己に対する発見や自省の語りを見せられても他の人には何の面白みもないかもしれない。しかし私には他にこれ以上の熱意をもってやりたいことがない。他にやっていることがないわけではないが、つまるところ最も面白いのは自己を見つめることである。<br><br>HNといえど名前を持って生きる以上はセルフプロデュース的要素を全く含めないわけにはいかないが、基本的には自分を「盛る」ための自分語りにはあまり関心がない。もっと普通のこととして、呼吸や食事と同じように「自分はこういう要素で構成された存在なんだなあ」ということを喋っている感覚である。<br><br>そういう人間なので、そういうふうにやっていくしかないなと感じている。<br>",
		"pin": false
	},
	{
		"title": "時空の共有に憧れない",
		"created": "2022/05/04 22:31",
		"edited": "2022/05/04 23:57",
		"tag": "生きる/己を眺める",
		"body": "相手と同じ場にいる、ということに感動を抱いたことがない気がする。<br><br>今この人と同じ空間にいるのだ、というようなことに良さを感じることがない。嫌だとまでは思わないものの、むしろ居心地が悪いような感じがする。<br><br>オンラインでもそうだ。<br>例えば、TwitterのDMやその他のチャットのように「相手が今書いている途中である」というのがわかるもの。待った方が良いのか押し通して良いのかわからないし、相手がこっちを待っているのか気にしていないのかもわからない。全く落ち着かない。基本的には、あれは待つためにあるのだろうか。<br>例えば、Scrapboxの共同編集。他の人が書いていく様子を見るのは面白いが、自分が書いている時に他の人の存在を感じたいかというとそれは全然思わない。自分が書いた瞬間に反応されると、それが好意的なものでも息が詰まる感じがする。ましてや、待ち構えていて一秒と置かずに反論してくるとかいうのは気分が悪いにも程がある。<br>MMORPGにもさっぱり興味が湧かなかったが、バーチャル空間で他の人と行き会うということにも関心がない。メタバースもピンとこない。<br><br>そもそもリアルで誰かと一緒にいるということにさえ良さを感じない。生身の相手を知らないとその人の人となりがわからないという意味で、会うなり通話するなりということはしておいた方が良さそうとは思うが、知ったらそれ以上会う必要はあまり感じない。会うのが苦痛というわけではないが、必要がない。<br>好ましく思っている芸能人はいるが、生で見たいとは全く思わない。実際に見かければ「おお」というくらいは思うかもしれないが、「目の前にいる！」という奇跡を体感したいとは思わない。<br><br>自分以外の人間と時の流れを共有したいという気持ちが僅かもないということなのかもしれない。<br>他者に興味はあるが、自分と他者が同じ時空にいるのだと実感することに喜びを見出すことがない。<br>他の人たちは人に会いたがる。それが大多数の感覚なのだろう。<br>",
		"pin": false
	},
	{
		"title": "「勉強して獲得したことの多さ」を誇っていた時は気持ちに余裕がなかった",
		"created": "2022/06/19 22:41",
		"edited": "2022/06/19 22:41",
		"tag": "生きる/己を眺める",
		"body": "《https://twitter.com/hyuki/status/1536255703538667520》<br>「勉強して獲得したことの多さ」をアドバンテージとして感じていた時は余裕がなかったな、と思い出した。今はまあ…開き直ったというのもあるけど、自分の本質はそんなところにはないなと思えるようになった気がする。<br><br>むしろ「勉強して獲得したことの多さ」で勝負しようとしていたがために自分固有のものを全く軽視していた期間の損失が今思うと本当に勿体なくて悔やまれる。「勉強して獲得したことの多さ」というのは、絶対に上には上がいるしオンリーワンにはなれない。多ければいいなら、自分でなくてもいいのだ。<br><br>普通に喋っているだけでなんか面白いと思ってもらえるらしいとわかった時、衝撃というか、コペルニクス的転回があったことを思い出しました。<br><br>変なことを言っているつもりはなく、実際文字通りの「変なこと」を言ってはいないと思うんですけど、ただ思ったことを言っていると関心を持たれることがある。そういうことが起こり得ると考えていなかった。なんかもっと「（自分には無い）能力」が必要だと思っていた気がする。個性的でいるためには。<br><br>そもそも「勉強して獲得したことの多さ」で勝負しようとしていたのは、「勉強で獲得する以外のもの」の乏しさをどうにかして補わなければならないと感じていたからだろう。人間的魅力の無さとか、社交的エネルギーの不足とか。自分固有のものに何か価値があるとは少しも思っていなかった。<br><br>別に、誰かに人として価値ないねと言われたわけでも面白くないねと言われたわけでもなく（親や教師などから否定されたことがあるわけでもなく）、なんかこう、「普通にイケてる」タイプとの距離があまりにも遠いので、何らの意味でも自分がイケてるということにはならないだろうと固く信じていた。",
		"pin": false
	},
	{
		"title": "茶の間更新手段のテコ入れ",
		"created": "2022/06/21 18:41",
		"edited": "2022/06/27 17:35",
		"tag": "開発日誌/Chanoma",
		"body": "茶の間のデータ作成手順を大きく変えた。<br><br>以前は、<br>①mdファイルに書く（VSCodeを使用）<br>②（Node.jsがまだ難しかったので）Pythonを通してJSONに変換<br>③JSONをGitHub Pagesにアップロードしてこのページで読み込み<br>という形式だった。<br>mdファイルにしていたのは、Obsidianとの互換性を持たせたかったのと、倉下忠憲さんがmdファイルであれこれやっていらっしゃって漠然と憧れがあったからである。<br>この形を自力で実現し、ローカルファイルからブログ化できるということの感動があり、自分としてはなんだかすごいことができるようになった感じがしていた。<br><br>ただこの形式だと、私の環境ではちょっと問題があった。<br>とても気に入って使っているPCがまあまあ古く、取り立てて「遅い」ということはあまりないのだがメモリに余裕がない。常用しているアプリケーションに加えてObsidianを開いたりVSCodeを二窓したりするとちょっと辛い（VSCodeは常に自作ツール改良のために開いている）。<br>ゆえに、できればWebブラウザないしはElectron上でなんとかしたい。<br><br>そもそも思索の場というのを自作アウトライナー（[[Protean Outliner]]と名付けている）にすっかり移してしまっているので、「まず書く場所」としてmdファイルが選ばれる可能性がほとんどなくなってしまっている。<br>そこで、いっそこのアウトライナーからデータを作れるようにすればいいのではないかと思い至った。JavaScriptで動いているのでJSONデータを作るのもごく簡単である。<br>VSCodeの[[Foam（VSCode拡張機能）]]がとても便利なのでmdファイルでの管理をやめるのはちょっと惜しい気持ちもあるのだが、[[Protean Outliner]]は自分の中ではそれに劣らない便利さがあるので、頑張ってコードを書いて完全移行してしまうことにした。<br><br>その結果、<br>①Protean Outliner上で茶の間カテゴリにカードを作って書く<br>②Protean Outliner上でJSONに変換<br>③JSONをGitHub Pagesにアップロードしてこのページで読み込み<br>という形になった。<br>書きやすくなりメンテナンスもしやすくなったので、これまでより気楽に更新できるのではないかと思う。<br>なお、この仕組み自体は少し前からできていたのだが、過去のデータをProtean Outlinerに移すのに時間がかかった（手動でコピペした）。やろうと思えばmdファイルからProtean Outlinerのデータに変換するコードも書けたとは思うが、プログラミングスキルの都合上それよりかは手動で移した方が明らかに速いし、内容を読み返す良い機会でもあったので、ひとつひとつ地道に移した。<br><br>あと地味に大事な変更点なのだが、Protean Outlinerでは作成日時と更新日時を手動で設定でき、且つ更新日時を自動更新するか否かを選べるようにしている（空欄にしておけば自動で更新時の日時が記録される）。<br>細かいことだが、内容を更新したわけでもないのに更新日時が改まってしまうというパターンがあるのが前から気になっていて（例えばScrapboxでもそう）、その挙動を自分で選べるようにしたのは気分的に大きい変化である。<br><br>アウトライナーからブログを書くというのは[[Drummer]]で得た着想だが、Drummerと出合った時点ではピンと来ていなかった。しかし自分でツールを作っているうちに結局そこに辿り着き、少しだけDave Winer氏の考えに近づけたような気がする。<br>（ただ、私の場合はアウトライナー機能の隣に付属させているテキストエリアに書いているので、アウトラインをブログ化しているわけではない。アウトラインを見ながらプレーンなテキストを書いている。）",
		"pin": false
	},
	{
		"title": "比喩は表現の中でも細心の気配りを必要とする要素",
		"created": "2022/06/23 21:06",
		"edited": "2022/06/23 21:06",
		"tag": "こだわる/言葉遣い",
		"body": "喩えが気配りを欠いているとえらいことになるのは政治家とかのしょうもない比喩での失言騒ぎ見ればわかるけども、本題より喩えの方が余程慎重になる必要がある感すらある。わかりやすければいいという話ではない。そもそも不適切な比喩はモデル化として失敗していてわかりやすくもないが。<br><br>「もののたとえだよ」と言って逃げられると思っている人がいることからして「あくまで比喩なんだから何言っても許されるでしょ」という感覚がそこにあるのだろうけど、そう言って弁明しなければならないことになっているということは結局「もののたとえ」は許されていないのでは。<br><br>梅棹忠夫の時代に知的生産系の名著を生み出していた人々はあの人もこの人も「言い方」にものすごくこだわっているなと思ったし、それは当時のそういう人々からすると当然の共通認識だったのかもしれない。スパッとやっているのに不和を生まない知恵。<br><br>相手の気分を害さないような工夫というのは、何も相手に阿るとかいう話ではない。そこまでしないと気分を害することになる相手はそもそも会話が成立していないし利害関係がないなら会話をする意味がない。そういう厄介な人間でなくとも、極力気分良く話をすることはパフォーマンスを上げるために必要。",
		"pin": false
	},
	{
		"title": "体調が悪いと単純作業が進む",
		"created": "2022/06/27 17:53",
		"edited": "2022/06/27 18:25",
		"tag": "生きる/己を眺める",
		"body": "あまりに具合が悪い場合や感染症の類での不調は別だが、「漠然と調子が悪い」「お腹の具合が良くない」「生理痛がしんどい」というような、「ただ寝ていてもしょうがない」系の体調不良の場合には、むしろ単純作業を進めるチャンスという感じがする。<br><br>複雑な作業ができる時に単純作業をやるというのは、ものすごく「時間の無駄」という感じがする。実際時間の無駄だと思う。最も自分の状態が活きるように自分の時間を使うのが正解だろう。<br>しかしそうすると、単純作業をやる日が来ない。絶対にやらなければならない仕事なら仕方なくやるが、自分のためでしかないものとなると、「いつかやろう」と思っていつまでもやらないのである。人を雇ってそういうことを任せられる身分ならそうやって外注してしまうのが多分最善だが、残念ながらそんな立場にはない。<br><br>じゃあいつやるか。複雑な作業ができない時だ。<br>ただ、単に「やる気がない」というのだと、単純作業は尚更やる気になれないので全然進まない。そういう時は単純作業ではなく、「複雑な作業のための準備」を少しやるのが良さそうだ。<br>そうではなく、「やる気がどうこうの問題ではなく調子が悪い」という時に、無理して複雑なことに挑まないで単純作業を淡々とやる。<u>「複雑な作業のための準備」ではなく、あくまで単純作業をやる。</u><br><br>体調が悪いと「準備程度にしておこう」と思ったりするが、やる気がないだけならともかく体調が悪い時には「準備」は辛い可能性がある。挫折して何も出来ずに終わってしまうかもしれない。<br>もう少し具体的に言うと、体調が悪い時でも「仕分け」はできるが、「決定」はできないという実感がある。「準備」は「ちょっとだけでも決めておこう」という作業なので、体調が悪い時にはかなり苦しい。一方「仕分け」ならなんとかなるので、判定機械になったつもりで淡々と処理すると、元気な時なら飽きて耐えられないことがすいすい進んで一日で終わったりするのである。<br><br>つまり、軽い仕事に抑えるということを考えた時に、「単純作業」をするか「準備」をするかということがあって、体調が悪いなら「単純作業」、やる気がないなら「準備」をするという分け方を意識するのが良さそうだ。<br><br>体調が悪い日というのは無い方が良いのだが、そうもいかないわけで、そういう日もうまく過ごせたら理想的ではある。",
		"pin": false
	},
	{
		"title": "わけがわからないものに自分の生活が決められる恐怖からの攻撃性",
		"created": "2022/07/07 11:52",
		"edited": "2022/07/07 12:47",
		"tag": "生きる/自意識との折り合い",
		"body": "《https://twitter.com/rashita2/status/1544873522396557313》<br><br>よくわからない言葉でよくわからない話をしている、いつ圧かけられるかわからない、怖い、という恐怖を感じていると「あっなんかわかる話をしている！（※わかってない）わかるなら自分にも叩けるはずだ！（※わかってない）わかる話をしてるうちに叩いとけ！（※わかってない）」みたいになりそう。<br><br>そうでない動機で会話や議論をしている人々の間をこういうのが埋めているとどの立場も身動き取れなくなってしまうと思う。<br><br>しかも「誰が」というのは関係なくて、「（他の人が）よくわからない話をしている、生理的に脅かされる恐怖を感じる（「恐怖」の自覚はしていない）」を元にして「（誰かが）自分にわかる話をしている、今こそ恐怖を跳ね除ける時ぞ」と勇むということが発生しているように思う。見境がなさ過ぎる。<br><br>どれほど勉強して理論武装しても、誰がいつよくわからない話で自分を脅かしてくるかと不安になっていると結局余裕なんか生まれず、よくわからない話をされる前に（＝相手が十分な準備をして十分な勢力になる前に）叩き潰してやろう、ということになる気がする。統計的根拠はない憶測ですけどね。<br><br>こうもインターネットが強くなってしまうと、実際にわけわからない理屈で徒党を組んでわけわからないことを実行しだす人々も出てくるわけで、常に恐ろしさを覚えざるを得ない社会ではある気がする。落ち着いている人間にはそれを支える何かしらの背景があり、そういったものを持つのは少数派っぽい。<br><br>政治家の理屈のわけわからなさも露呈しているし、更にはちゃんと理屈が通っていてもわけわからないものとされてしまうこともあるし（目立つところで何かを言えば大体そうされてしまうし）、とにかくわけわからないことで自分の生活が左右されている感に苦しむ社会という感じ。",
		"pin": false
	},
	{
		"title": "「わからない」状態への拒否反応の要因",
		"created": "2022/07/10 17:59",
		"edited": "2022/07/10 18:33",
		"tag": "生きる/自意識との折り合い",
		"body": "考えのきっかけ（直接の返答・反応というわけではありません）<br>《https://twitter.com/rashita2/status/1546050551925772289》<br><br>成績優秀でないことに対してコンプレックスを植え付けられる社会にあっては、他の人は理解できていそうな何かを自分が理解できないということは屈辱であり、「自分はこれをわかっている」ということにしたい、あるいは「これは誰もわからないに違いない」ということにしたい、という力が働く気がする。<br><br>何かをわかっていない時に、「十分に挑んでいないのでまだわからないのは当然だ」と思えるか、「今この瞬間にわかれないなら自分はこの先もこれをわかることはないのだろう」と信じてしまうか。「わからない」の恐怖は「自分には一生わからない」という自分自身に対する諦めが引き起こしているのかも。<br><br>何かを見聞きしたときに、一切時間を置かずその場で「大方こういうことだろうよ、そうに決まっている」と言ってしまいたくてたまらない人がいる。十分に考えてきたから瞬時に答えを出せるというのとは違って、何もストックがないのに決断を下し、「天性の直観力」みたいなものを誇示しようとする。<br><br>それは「物事についてこの瞬間にわかれる自分」という像を自分の中に作り上げることで、何かを見たときに反射的に感じる「自分には一生わからないのだろう」という屈辱感を誤魔化しているということだと推測している。推測なので本を読むなどして認識の修正を常に図っているけれどなかなか覆らない。<br><br>「わからない」を「知らない」とは区別された「解らない（解ることができない）」であると仮定した場合それについて常々考えていることはこうだけど、「知らない」に対する感情はそれはそれでまた別のことが働いていると思う。<br><br>「解らない」は能力的に疑われるおそれがあって屈辱感を伴いやすい一方で、「知らない」はドレスコード違反のようにコミュニティへの融け込めなさを示すものであることから、融け込みたい気持ちの強い人にとっては病的に解消せずにいられず、また他の人の「知らない」を責めずにいられない、のかも。<br><br>そのふたつが重なるポイントでマウント合戦がすさまじく熾烈になるであろうことがなんとなく想像がつく。<br><br>「知れば済む」程度のことから一歩進んだ「知って且つちょっと頭使って理解する必要がある」地点でのバトル。敗北者を徹底的に侮辱するということが発生しがち。<br>一方、ちょっとどころではなく頭を使わなければならない地点は必然的に辿り着くのが大変なのでそこまで激戦区にはならなそう。<br><br>責任を持たないという意味ではないですが単に持論を喋っているだけなので「こういうことなのです」という話ではないです。",
		"pin": false
	},
	{
		"title": "手段としてのモデル化と解釈としての単純化は区別がつかない",
		"created": "2022/07/11 11:10",
		"edited": "2022/07/11 11:12",
		"tag": "こだわる/意図と表現",
		"body": "複雑なままでは何も解釈できないのである程度のモデル化をして足掛かりにするということと、そもそも世界は単純であると見なすということは、やっていることは全然違うけど、その語りを見聞きした時に区別がつくかというと結構微妙だな。<br><br>わかりやすくした時にそれが「世界はこんなに単純なんです」というメッセージかのようになってしまうことがある（すごくある）。結局、あえて複雑らしくして「簡単にはわからないのだな」と印象づけた方がいい気すらする。そうするとウケないけど。",
		"pin": false
	},
	{
		"title": "樋口健夫『図解 仕事ができる人のノート術』",
		"created": "2022/08/13 09:08",
		"edited": "2022/08/13 10:56",
		"tag": "懐古",
		"body": "[樋口健夫『図解 仕事ができる人のノート術』](https://www.amazon.co.jp/dp/4492092218)の素朴な感想。<br>新版の方に言及されているのを見て、あぁあの本かと懐かしく思った。私が読んだのは2003年版の古い方で、更に読んだのは10年近く前のことなのでもう記憶も曖昧だが、読んでいて楽しかったのは覚えている。図書館で出会った本なので現物は手元にはなく、読書メモを引っ張り出して当時の思いを振り返ってみたいと思う。（なお読書メモは紙のノートである。）<br><br>著者の話の核は一応「アイデアマラソン発想法（マラソンシステム）」だったと思うが、むしろそれ以外の話の方が印象的だったし役に立った。<br>何が面白いって、ノートと共に生きることの楽しさが本全体から力強く放たれていることだ。とにかくノートというのは大事なのだ！というのがひしひしと伝わってくる。こんなことにも使える、あんなことにも使える、と次々使い方が繰り出され、そのいずれも他ではあまり見たことのないような超実践的な内容だ。<br>今はネットを見れば細かい使い方の紹介が普通になっているが、私が読んだ当時はそれほどでもなかったし、ましてや2003年の時点となればかなり稀有なものだったのではないかと想像する。<br><br>父親がガンに侵されたことを機に両親にノートを渡して日記を書いてもらったくだりは強く印象に残っている。もはや「仕事ができる人のノート術」という話からは大きく外れているが、ノートがこんなにも自分を支えてくれているのだという話は実感に満ちていて楽しい。<br>著者は海外を飛び回る商社マンなので、海外のノートは微妙だから日本のものをたくさん買って持っていくのだとか、行った先の外国語は運転手に先生役を頼んで習得するのだとか、そして離れた国の言葉はきれいに忘れてしまうのだとか、ちょっと想像したことがない話がポンポン出てくる。著者の人生を追体験できる面白さがある。<br>あと、報告書には表情を変えて色々撮った自分の顔写真を内容に合わせて添える、という話も実にアイデアマンという感じがして面白い。「仕事の報告書」という形で読者が実践できるかというとかなり厳しいような気はするが、しかし「顔と表情を見せることができると印象が大きく変わる」ということは勉強になる。今の時代なら絵文字・顔文字の使い方にも通じるだろうし、文体にも応用できるだろう。自分がどういう人間で、今どういうテンションでこれを話しているのか、ということを伝える工夫をしようということだ。<br><br>著者が具体的にどんなノートで何を書いていて結局何冊になっているのかという話もあり、ノートと共にある生活を想像しやすいのも良かった。種々の本や雑誌で、こう使うと良いですよという例やメソッドを多々挙げてくれるのは良いのだが、「全貌」がわからないとなんだかふわふわしたままに感じることがある。樋口健夫氏は全部出してくれているので、読んでいて安心感があった。<br><br>これは推測でしかないが、著者にとってはとにかくノートを使うということが大事であって、紹介している例にはそれほどこだわっていないのだと思う。こうすればいいのだ、というより、こうしている私は楽しくやれているぞ、という話のように感じた。だから面白くて何度も読んだのだろうと思う。<br><br>肝心のマラソンシステムだが、正直に感想を書くと、「実践は無理！」と思った。<br>今なら「UIをゲーム風にしてポイント獲得で継続を促すアイデアマラソンアプリ」みたいなものを作れそうだが、いずれにしても私個人は「個数」「ポイント」というものが引力として働いてくれないので、マラソンシステムがあまりプラスに働かない。<br>そもそも飽きやすさが邪魔して同じ形式で継続できない。著者は2003年の時点で単位が2万を超えているが、自分の形式に納得してそこまで継続できるのがすごい。私は継続に必要な前提条件を満たしていないので無理だなと思う。<br>ただ、著者のように几帳面で時間の融通も利くような人までもが、「私のような人間でもできる」タイプのメソッドを参考にする必要はないと思うし、こういう話があること自体は良いことだろうと思う。「発想ノートの書き方」には参考になる点もあった。<br>（とはいえ、無理な人には無理ということがあまり掘り下げられていなかったように思うので（多分）、メソッドの紹介としては独善的な感は否めない。それでも著者から「俺の真似をしろ」という主張は感じないので、自分にはできないとしても読んでいて楽しいものではあるし、マラソンシステムのことを書いた本は別にあるようなので、細かい分析はそちらで書いているのかもしれない。）<br><br>マラソンシステムに関連して書かれている著者の実感は面白い。オリジナルな発想のうち0.3%程度で素晴らしい発想が含まれるという経験則が著者にはあり、それを「有効発想密度」と名付けているのだが、私はそのくだりに結構な影響を受けた。<br>発想のうち有効なのはその程度だ、ということ自体は別に真新しい話ではないのだが、0.3%の発想と出会うために、有効でないとしても構わずアイデアを出していこう、という在り方になぜかカーンと殴られたような気持ちになったのである。その本を読む前にもアイデア出しということはしていたが、それ以来「元気に」アイデアを出していけるようになった気がしている。<br>私にとってアイデアとはどういうものであるかは、例えば自作ツールやScrapboxのCSSやブログ記事の内容やらに反映されているだろうが、そんな感じで「よっしゃ良いこと思いついた！」となる気分はこの本を読んだ体験が支えてくれているところもあると思う。外に見えているアイデアの裏には、特に意味をなしていない思いつきが山ほどあるのである。<br><br>[2011年の新版](https://www.amazon.co.jp/dp/4492092994)の紹介文には「クラウドを活用することによって、アナログノートを最強のデジタルツールにするノウハウを加えた、クラウド時代のデジタル活用のヒントを加えパワーアップした最新版です。」とある。こちらは読んでいないので、あの本がどうデジタルと繋がるのかとちょっと想像し難い気分でいる。<br><br>なんにしても、私にとってこの本は思い出して語れるくらいには存在感の大きい本で、「読んで良かった」と感じるもののひとつである。",
		"pin": false,
		"editedFix": true
	},
	{
		"title": "幸福に生きるには嫌いなものが多すぎる",
		"created": "2022/08/26 23:01",
		"edited": "2022/08/26 23:17",
		"tag": "生きる/己を眺める",
		"body": "嫌だな、と感じる回数が毎日多すぎる気がしている。<br>そう感じるたびに自分が狭量だなと突きつけられる思いがする。<br><br>主語を大きくしてまとめて嫌っているのではない。<br>いや、人類というものが嫌いという意味ではこれ以上大きくなれない規模の主語で嫌いなのだが、次に細かい粒度となるとずっと小さくなる。<br>ずっと小さくなるのだが、小さい状態で大量にある。それが困る。<br>漠然と「なんかこのカテゴリのもの嫌」というのは多分そんなに多くなくて、具体的に理由を説明できるタイプの細かい嫌さがたくさんある。<br><br>それを表に出さなければ表面上平和でいられるとは思うが、「もっと酷いことになるのを回避する」というだけであって、耐えた分だけ幸福になるわけではない。<br>センサーを自由に鈍くできたらいいのに、と思う。",
		"pin": false
	},
	{
		"title": "全体リファクタリングした＆エディタ化した",
		"tag": "開発日誌/Chanoma",
		"pin": false,
		"body": "これまでデータ編集する場所はVSCodeや[[Protean Outliner]]上だったが、やはりビューとエディタが遠い場所にあると非常にやりにくい。<br>そこで、このサイトを自分用に表示したもの（デバッグモード的なやつ）の中にエディタ機能も含めてしまおうと考えた。<br><br>が、エディタ機能を作るだけなら最早慣れっこなのだが、そもそもこのサイトを成しているコードが今となってはめちゃくちゃでどこをどうしたらいいのか自分でわからなかったので、全部コードを見直して書き直すことになった。<br>控えめに言って超大変だった。一から作り直したほうが早いと思えるレベルである（でも実際は本当に作り直してしまったらもっと時間がかかっただろう）。<br>しかも見た目にはほとんど何も変わらないときた。すごく頑張ったけど自分にしかわからない頑張り…。<br><br>でも頑張った甲斐はあった。やはり実際の画面上で作業できるのはやりやすい。<br>ちなみに編集画面はこんな感じ↓<br>![screenshot](https://gyazo.com/8823619f66374c17f536016e9969f4c3/max_size/1000)<br>各項目を編集できることに加え、リアルタイムプレビューを搭載して実際どう表示されるかを確認しながら書けるようにした。便利。",
		"created": "2022/09/02 22:17",
		"edited": "2022/09/02 23:04",
		"editedFix": false
	},
	{
		"title": "茶の間改良（2022/09/02）",
		"tag": "お知らせ/茶の間更新",
		"pin": false,
		"body": "作成日時、更新日時を一番下に表示するようにした。<br><br>あとリファクタリングに伴い微妙にCSSが変わっているところあり。<br>（リファクタリング自体はすごい頑張ったけど表に反映されている部分はごく僅か…）<br>→[[全体リファクタリングした＆エディタ化した]]",
		"created": "2022/09/02 23:06",
		"edited": "2022/09/02 23:10",
		"editedFix": false
	},
	{
		"title": "RSSリーダーを自作するメリットを考える",
		"tag": "前に進む/デジタルツール",
		"pin": false,
		"body": "ダッシュボードになるツールを作っており（[[Dashboard.html]]）、markdownファイルの編集・検索や家計簿の作成、締切の一覧とか色々できるようにしているのだが。<br>その一環として、読んでいるブログ類の更新通知をそのツール上で取得できたら面白いと思った。<br>JavaScriptでRSSフィードを利用できないだろうか。<br><br>[『rss to json』 というサービスを使って RSS フィードを JSON として取得して表示してみよう](https://zenn.dev/phi/articles/js-fetch-rss-feed-as-json)<br>この記事を読んだところ、割と簡単にできそうな感じがする。まだ試していないが、多分こうすればいけるんじゃないかという予想は立っている。<br><br>「今発行されているRSSフィード」を取得することが可能になったとして、そうするメリットはなんだろうか。<br>括弧書きで強調した意味は、このやり方では過去には遡れないということだ。RSSリーダーのサービスは、その企業がクロールした結果を蓄えてくれているおかげで、利用者は何十件何百件も遡ってチェックすることができる形になっている。<br>サーバーサイドの言語を使えば個人でもコードを走らせて以降の結果を蓄えていくことはできるだろうが、私自身はそうする気はあんまりない。<br><br>逆に、今発行されているものしかキャッチできないとなると、過ぎたものは自動的に視界から消えることになる。期間内に読もうと思わなかったのだから仕方ないと諦めることもある種自然にできるかもしれない。<br>もちろん、自分でコードを書くならなんとでもできて、表示した結果をクリックしておけば倉庫に溜めておけるみたいなことも実装は可能だろう。<br><br>ということは、「溜まる」のがデフォルトか、「過ぎれば消える」のがデフォルトか、という態度の違いで使い分けることが考えられる。<br>Feedlyは「溜まる」がデフォルトで、読んだものを既読にして消す。自作ツールは「消える」がデフォルトで、読むものを拾って取っておく。後者はTwitterとほとんど同じ感覚だ。<br>もし網羅的に情報収集しないと仕事にならないということなら当然前者でないとまずいだろう。見逃してはいけないからだ。<br>しかし、そもそも気が向いた時にしか見ないようなスタンスならTwitter感覚で良いような気がする。億劫になってぽっかり穴が開くよりよっぽどマシだ。<br><br>…ということを考えはしたが、「比較的簡単そう」ではあっても3分で作れるとかいう話ではないので、まずFeedlyの使い方やビューの設定などを考え直してみて、それでもやっぱりうまく使えないようなら自作も考えたいと思う。",
		"created": "2022/09/03 10:36",
		"edited": "2022/09/03 11:21",
		"editedFix": true
	},
	{
		"title": "「みんなとワイワイ」ができない",
		"tag": "生きる/己を眺める",
		"pin": false,
		"body": "AI開発の話やメタバースの話、あるいは推し活の話などを見ていて思うのが、「みんなエネルギッシュだなあ」ということだ。<br>みんなすごくワクワクして生きている。しかも「みんなでやる」「みんながやる」ということにワクワクしている。<br>大勢の人がワーッと動いて盛り上がることを意図して何かを開発して、何かをシェアして、何かに参加している。傍から見ていて、それはすごいことだなと思う。<br>お金というのはそういう場所で回るから、お金を追いかけてエネルギーを爆発させている人もいるだろう。<br><br>なんだかそういうことに全然ついていけない。<br><br>「人を巻き込んだ楽しさ」というものをもう感じられない体になってしまった。<br>いや、そもそもそういうものを感じられたことがなかったのかもしれない。<br><br>大勢の人が楽しんでいるものを自分も楽しむことはあったけれど、大勢の人がいるから楽しいわけではない。<br>大勢の人が楽しむくらい楽しいものだから、一人である自分が一人でそれを楽しんでも楽しいのであり、「大勢の人」は私にとってはどうでもいい。意見交換したいとか別に思わないし、イベントに行って同好の士の存在で自分の心が満たされるということもない。<br>大勢の人がいてくれればその対象がなくなってしまう可能性が減るから、みんなが支えてくれることはありがたいとは思う。でも「輪の中に入りたい」とは思わない。<br><br>[[時空の共有に憧れない]]でも書いたが、自分は余程偏屈なのかもしれない。",
		"created": "2022/08/29 23:35",
		"edited": "2022/09/03 11:38",
		"editedFix": false
	},
	{
		"title": "語りとは政治的なものである",
		"tag": "こだわる/意図と表現",
		"pin": false,
		"body": "とある人と某論破の人のレスバトルに関して思ったこと。<br><br>某論破の人は自分が言った文言そのものの意味だけに責任があると認識しているのかもしれないが、相手はそうではなかった。<br>その結果、「直接は言っていないことを責める」という問題が相手方に発生し、一方「言ったことでその先何が起きようがそれは自分の言ったことではないので関係ない」という責任放棄が某論破の人に発生している。<br>良識に照らせば論破の人があからさまにそれから外れているのでまずそっちに反感を抱くが、前者の問題も無視してはいけないだろうと思う。<br><br>この両者には前提が共有されていないので、互いに相手を自分の前提に則らせようと言葉を重ねれば重ねるほど、どちらもが矩を越えて非現実的な要求をすることになると思う。<br>実際、良識的な方は議論としては悪手を指し、論破の人も「実際に言った文言の意味」だけで戦っていられなくて一歩決めつけに踏み込んでいた。<br>そして両者とも相手の前提に則ることはあり得ないだろうから、対話が成り立つ可能性は皆無に思える。話をするだけ無駄というものだ。いや、興奮で墓穴を掘るリスクが高すぎて、無駄どころか「やると負債を抱える」ような試みだと思う。だから論破の人に絡んではいけない。<br><br>確かに、「言っていないことは言っていない」のだし、自分の言葉に自分の言葉以上の責任を負わされるのは意味不明という見方もあろうとは思う。でもそれは、「大勢の人に届くから喋っている」という前提がなければの話だ。友達や家族と一対一で話しているなら何も責任を問われなくとも、何万人もが耳を傾ける保証がある状態で、そうだからこそ喋るというのならそれには相応のジャッジが働く。<br>語るということは政治的なものであり、「これは政治ではない」という場を囲って作って語るのでない限り、「そんなつもりで言っていない」は通用しない。どう反論しようが、ある程度妥当な解釈によって何かが発生したら、それに対して責任を問われるのが社会である。<br><br>そもそも、語りというものが政治的でないなら、何故大勢に向けて言ったのか説明し得ないと思う。誰かの何かを変えたいから語ったのだろう。<br>そんなつもりなどないのなら、読者が自分しかいない日記に書けばいいのである。<br>聞いてもらわなければ意味がないのなら、それはアカデミックの囲いの外である限り、必然的に政治になる。芸術が政治と切り離されるわけがない、というのもそういうことだろう。",
		"created": "2022/08/31 11:44",
		"edited": "2022/09/03 12:06",
		"editedFix": false
	},
	{
		"title": "相手が使ったキーワードに相手が興味があるとは限らない",
		"tag": "こだわる/意図と表現",
		"pin": false,
		"body": "コミュニケーションの際に、共有したテーマで喋っているようなのに片方が片方を困惑させているということがある。<br><br>しばしば勘違いされているが、相手の話を元にした連想ゲームならばそれを相手に伝えた時必ず相手は興味を持ってくれる、というわけではない。<br><br>相手には相手の意図があり、相手の話に含まれているキーワードを使ったとしても、相手の意図から大きく外れていれば相手にとっては全く興味のない話になってしまう。<br>そもそも、そのキーワードは意図に沿った表現をするための道具に過ぎないこともある。そこを膨らまされてもそれ以上何も出てこない、ということになる。<br>（連想の共有が駄目なのではなく、「意図から外れている」且つそのことに気づいていないところに問題がある。）<br><br>この状態の問題は、自分の発想をコミュニケーションに（強引に）反映させようとしているところにあるだろう。<br>相手の話のキーワードで何かを連想したとしても、それを相手に直接報告しなければならない義務はない。<br>そして相手に直接言うということは、返信不要と断らない限り、相手に反応を要求することも意味している。<br>いちいち応じないと決めている人もいるが、そうするには覚悟が必要で、普通は「話しかけられたら文脈を読んで妥当な返事で応える」ものである。社会に生きているのだから。<br><br>じゃあどうすればいいかと言えば、自分の責任で自分の場に書けばいいだけである。<br>自分の発信の中で引用・言及するのならば、それはその元ネタの筆者とコミュニケーションを取っているのではないし、相手に反応を強いるものでもない。<br>相手はそれを読んでも読まなくてもいいし、反応してもしなくてもいい。いつ読んでもいいし、いつ反応してもいい。<br><br>そうやってみて相手が嬉々として食いついてきたなら（つまり反論などではない好意的且つ的を射た反応をしたなら）、それは相手の意図と自分の意図に絡み合う余地がある。<br>そうなれば、直接コミュニケーションを取った時に互いに連想ゲームをしても、相互に相手の話に興味を持つ可能性も高くなるだろう。",
		"created": "2022/08/31 12:04",
		"edited": "2022/09/03 12:24",
		"editedFix": false
	},
	{
		"title": "Twitterサークル機能についてのもろもろ",
		"tag": "",
		"pin": false,
		"body": "Twitterサークル機能が実装されている…。<br><br>オープン度合い・クローズ度合いをひとつのツールで調整できるようにしようとするとなかなか難しい問題が発生するな。<br>要するに非常識とか無神経とか鈍いとかいう人間を弾き出したいのだろうけど、単に仲間外れを作る手段として使われる可能性があるのが難問。<br>既に鍵垢でそういうことはあったわけだが、鍵垢には「鍵垢を作るというズルさ」があったけど、サークルは疚しさなどないストレートな選別だから鍵垢以上に「選ばれなかった」ことはダメージになる気がする。<br><br>元々いた界隈でこれがどういう事態を引き起こすか想像すると目眩がしてくる。これを欲する動機が生じる世界＝これによって地獄度が高まる世界とも思える。<br>自意識の暴走によって迷惑行為が多発しているところでこういうフィルタリングが望まれるわけだが、このフィルタリングで更に自意識は暴走するに違いない。<br>「神絵師」みたいな存在がこれを活用した時、そこに渦巻く「何者でもない人々」の理不尽な恨みがどれほどのものになるのか、考えるだに恐ろしい。<br><br>一方、APIがザルでTwilogなどのサービスには普通に記録されてしまうし、Togetterにもまとめを作れるというのだから、この機能に一体何の意味があるのかわからなくなってくる。粘着質な人間に言いがかりをつけられる可能性が増えただけではないだろうか。<br><br>近年のTwitterは、アルゴリズムの力でフォローしていてもTLに現れない可能性がある上、自分が読む権利を与えられているか自分にはわからないとなると、不確かさが高まり過ぎて数年前までと同じ感覚ではいられない感がある。",
		"created": "2022/08/31 12:12",
		"edited": "2022/09/03 12:33",
		"editedFix": false
	},
	{
		"title": "2022-09-03",
		"tag": "日記/2022/09",
		"pin": false,
		"body": "[[Dashboard.html]]（自作ツール）にMarkdown編集機能を搭載しているが、更にプレビュー機能とバックリンク機能をつけたことで超便利になった。<br>基本的にはLogseqの代替なので箇条書きの形で書くことに特化させているものの、コードブロックとかも普通に書ける。<br><br>色々な工夫をシェアしたいとは思うものの、工夫が重層的になっていて説明が難しい。<br>やるなら要素をばらばらにしてひとつひとつ説明するしかないなあ。",
		"created": "2022/09/03 21:50",
		"edited": "2022/09/03 22:10",
		"editedFix": true
	},
	{
		"title": "エディタとビューが離れているとニヤニヤしにくい",
		"tag": "前に進む/デジタルツール",
		"pin": false,
		"body": "茶の間のエディタをサイト上に構築したところ、ものすごく書きやすくなった。<br>（→[[全体リファクタリングした＆エディタ化した]]）<br><br>Protean Outliner（カード式アウトライナー）で茶の間を更新できるようにしたのは自分の中で超画期的だったのだが、しかしそれは功を奏さなかった。<br>なぜなのだろうと考えると、最大の問題は書いた結果がその場でわからないということだろうと思った。<br>「書きやすい」とか「高機能・多機能」とかいう編集機能の良し悪しよりも、「結果がその場でわかる」ことの方が遥かに重要のようだ。<br><br>Scrapboxが書きやすいのも、書いた結果がその場でわかることにあると思う。<br>「データとしてはこうなっているはず」というのではなく、見ればわかるということ。書いたものが見たい形としてその場に現れること。<br><br>早い話が、「ニヤニヤできる」かどうかが大事なのだ。<br>エディタとビューが離れているとそれがちょっと難しい場合がある。本当にそうなっているのか確信が持てないみたいな不安もある。<br>なので基本的にリアルタイムプレビューできる状態、あるいは直接編集できるという状態にした方が良いのだろう。",
		"created": "2022/09/03 22:13",
		"edited": "2022/09/03 22:28",
		"editedFix": false
	},
	{
		"title": "Chrome拡張機能を作ってみて",
		"tag": "前に進む/デジタルツール",
		"pin": false,
		"body": "Chromeの拡張機能というのはどう作ればいいのか皆目見当がつかなかったが、調べてみるとなんのことはない、JavaScriptとJSONだけで作れるのだった。ポップアップを使う場合は更にHTMLとCSSを用意すればいい。<br>それらをひとつのフォルダに入れて、拡張機能のデベロッパーモードからフォルダを選択すれば動く。すごい。簡単。<br><br>「よくわからないけどコピペすればとりあえず動く」という場当たりスタンスから脱するにはそれなりの経験が必要だなとは思うが、謎の技術というほど難易度の高いものではなかった。ブックマークレットとほとんど変わらない。<br>少なくともElectronよりは簡単である。",
		"created": "2022/09/04 10:03",
		"edited": "2022/09/04 10:09",
		"editedFix": false
	},
	{
		"title": "AutoHotkeyを導入した",
		"tag": "前に進む/デジタルツール",
		"pin": false,
		"body": "[Twitterのコミュニティ](https://twitter.com/i/communities/1496761082442297347)でキー配置の変更が話題になっていたので早速[[AutoHotkey]]を導入してみた。<br>これはすごい。キーの置き換えだけでなく、複雑な関数も設定できる。<br><br>とりあえず現時点で設定しているのは以下にまとめた。<br>→[AutoHotkeyでキー配置をリマップする - Noratetsu's Room（のらてつ研究所）](https://scrapbox.io/noratetsu/AutoHotkey%E3%81%A7%E3%82%AD%E3%83%BC%E9%85%8D%E7%BD%AE%E3%82%92%E3%83%AA%E3%83%9E%E3%83%83%E3%83%97%E3%81%99%E3%82%8B)<br><br>CtrlやAltによるキーバインドは各アプリケーションなどで設定されているので何がフリーなのかよくわからないという問題があるが、無変換キーは誰も設定していないので完全に自分で新たに機能を割り当てられるというのが良い。安心してカスタマイズできる。<br><br>便利そうなキーを色々設定したが、つい小指でEnterを叩いてしまうとか反射的に右手を振ってBackspaceを押しに行ってしまうとかいう癖が抜けるにはかなりかかりそう…。",
		"created": "2022/09/04 17:06",
		"edited": "2022/09/04 17:37",
		"editedFix": false
	},
	{
		"title": "一年半ぶりにnoteに投稿した",
		"tag": "前に進む/表現の手段,生きる",
		"pin": false,
		"body": "AutoHotkeyのごく小さな工夫について、こんなもんでも記事にならなくはないなと思ったので書いてみることにした。<br><br>Scrapboxでもいいけど、Scrapboxだと100%「情報のシェア」だけのものになってしまって、文章を書いているという蓄積に繋がらないので、まあどっかには文章として投稿したいと思った。<br>どこにしようかと考えると、自分のブログはなんとなくそういう雰囲気の場にはなっていないし、トンネルChannelもなんか違う。身近な相手というより、「どこかの誰か」に「たまたま行き着く」ようなものでいいという感じがするので、じゃあnoteにするかと。<br><br>noteは長らく投稿する気を失っていた。理由は色々ある。シェアされた先でごちゃごちゃ言われるみたいなこともあるし、ソーシャルな感じがうっすら不愉快というのもあるし、「戦略的なスキ稼ぎ」みたいなものに辟易したのもある。<br>でもまあ、どうでもいいよねそんなこと、という気持ちになってきた。自分以外の人間がどんな思惑でどう動いて何を顕示していようが、そんなのはどうでもいいのだ。そんなのはどうでもいいくらいにnoteというのは規模の大きいプラットフォームだし、そもそも自分自身が他のあらゆる存在にとってほとんどどうでもいいのだから、神経をすり減らす意味など無い。<br>不完全であることを指摘されたって、わざわざ名もなき人間が無償で書いたものに食ってかかるその暇さを考えたら、そんな指摘が聞くに値しないことは明らかだ。バズっちゃったら話は別だが、そういうことはないので、性格の悪い暇人を恐れる方が阿呆に思える。<br><br>例えば、何かツールに言及するという時、ツールの導入部分を最低限書かなきゃいけないような気がしていたけど、既にある誰かの記事のビューが増えればその誰かにとって嬉しいことなわけだから、貼っちゃえば別にいいじゃんと思った。無駄に自力でやってしまうと、その誰かが得する機会もなくなるわけだ。<br>というかそれすらしなくても誰かに不満に思われるわけではない。わからなければググればいいんだし、親切であろうと変に頑張っても、読み手にはそれほどその親切さがありがたく感じられるわけでもない。<br>横着な気がして躊躇われる、なんていうのは自分が勝手にそう思っているだけで、情報を得たい人間にとってはどうでもいい。<br>仕方なくアリバイ的に書いてみたところで、きっちり導くという熱意はないのだから、結局半端な記事にならざるを得ない。それならちゃんとそれをやってくれている人を紹介したほうがよっぽどいいだろう。<br><br>他の人が既に書いていることを自分が繰り返し書いてしまうことに後ろめたさを感じていたけど、それも要らん気後れだなと思う。<br>もしそれが後ろめたいものなら、世の中の「在り方」を説く系の話は全部後ろめたい発信になるだろう。大体の話が、そんなのはとっくの昔に誰かが言っている。<br>でもそれは常識と言えるほど広まりはしないから、別の誰かが平気で自分の言葉で書いているのだ。そんなもんだし、それが当たり前。<br>それが許されなければ、「書く」仕事なんてそもそも成り立ちやしないだろう。<br><br>世の中だいたい不親切だし律儀じゃないし無神経だし身の程知らずだし、この世の中でそういったことを厳しく自戒してなお安泰に生きていけるのは、自分の生活を支える太い何かを既に持っている人くらいなのだ。<br>自分の足で立って生きていきたいなら、無意味な「お行儀の良さ」なんか捨ててふてぶてしくいなきゃいけない。それはどこかの誰かに対しては不誠実かもしれないが、自分が生きるということに対して誠実な態度だと思う。<br>自分が一番誠実でなくてはならない相手は、自分自身だろう。",
		"created": "2022/09/05 17:48",
		"edited": "2022/09/05 21:31",
		"editedFix": false
	},
	{
		"title": "性格が悪い、と「誤解」されることを恐れてきた",
		"tag": "生きる",
		"pin": false,
		"body": "これは物心ついてからずっとのことだが、自分の信条が誤解されるということがものすごく嫌なことに感じてきた。<br>某性格診断の結果にも「そう思いがち」と書いてあるのを見た時、妙に納得したのを覚えている。納得して、なんだか楽になった。そういう「タイプ」の人間らしい、とわかったからだろう。<br><br>誤解されるにはまずそれが「ある」ことが必要だ。そして自分は人間とはどうあるべきかとか世界はどうなるべきかとかそういうことを考えるタイプだから、そういうものを持っているということになる。そしてそういうものが無い人から「誤解」されることになる。<br>なぜなら、そういうものを持たない人には、そういう信条というものがあるということ自体が見えないのだから、正義のために人の在り方に口出すことも辞さないというような態度を、単に高慢で自分本位だと解釈するのは当たり前である。<br><br>さて「誤解」と書いたが、それはそもそも誤解だろうか。<br>同じタイプの人には、多分誤解だと思ってもらえるのだろうと思う。「世の中はこうなっていった方がいい」という像を共有していれば、それは「世の中」を考えてのことだという解釈があり得るわけだ。<br>でもそれはそもそも万人共通のものではない。<br>例えば、動物が絶滅に向かうのは良くないことだ、人間のせいなのだから可能な限り防がないといけない、という話にしても、私は個人的にそれに賛同しているが、自明のことかというと疑問である。<br>動物は動物で各々自分が生きることだけを考えて生きているわけで、増えも減りもしていない種はたまたま他の動植物との間でバランスを保っているだけのことだ。保たれなければ何かが絶滅に追いやられ、そしてその煽りを受けて他の種も絶滅していく。そうして滅んでいった種はたくさんあるだろう。<br>人間も人間が生きることだけを考えて突っ走って、そうして他の生物を絶滅させてやがて人類自身も絶滅したとすれば、それは生き物として「普通」のこととも言える。それをコントロールする必要は、「結果的に人類も絶滅してしまうという事態を防ぐ」以外の理由で正当化されるだろうか？<br>躍起になって地球を守ろうとして、今目の前にいる誰かの言動を責め立てたとして、それは何をもって「正しい」とされ得るだろうか。普通に、今いる人間を何かの概念の「下」に置くということをする、性格の悪い迷惑な人間ではないか？　同じタイプの人間以外からすれば。<br><br>視点を引いて世界とか未来とかを考えてしまうと、人間が如何に愚かか、如何に多くの人が「賢明でない」判断をするか、ということに思いを巡らしてしまう。それは確かに正しい理解かもしれないが、他人の愚かさに苛立っているのは「性格が良い」人間の行いではないようにも思う。<br>利己心ではない、自分以外の何かを思っての正義感から来る態度だとしても、結局の所それを不快に思う人にとってはそれは「誤解」などではなく、それ自体がストレートに不愉快なものだろう。<br>自分の利他心や大局観を解ってもらいさえすれば好意的に受け取られるはずだ、と信じるのはきっと間違っている。<br><br>正義が間違っているとか、地球を守ろうと考えるのがおかしいとか、そういう話ではない。ただ、そういう何かを信じて行動した結果、誰かに自分の善性が無視されて不快な存在と認識されたかのような時、それは「誤解」ではなく、ただ「そういう人間」が嫌われたというだけのことかもしれない、ということだ。<br><br>誤解ではなくただストレートに嫌われる、それを受け入れる覚悟が必要なのだろう。<br>しかし、「この人にさえ好かれれば良い」というような熱情を持たずしてそれに耐えられるだろうか。<br>まあ覚悟があろうがなかろうが、耐える力があろうがなかろうが、自分を好きな人は好きと思ってくれ、嫌いな人には嫌われている、という現実は何も変わることはないのだが。",
		"created": "2022/09/05 18:29",
		"edited": "2022/09/07 18:36",
		"editedFix": false
	},
	{
		"title": "迷惑に対する嫌悪には種類がある",
		"tag": "",
		"pin": false,
		"body": "人に不必要な迷惑をかけるべきではない、という倫理観がある。ごく一般的な良識と言えるだろう。<br>しかしその核にあるものを考えると、<br>「人に負担を強いることが嫌だ」という根っからの生理的なものと、<br>「人に迷惑をかけるのは馬鹿」という学習からの侮蔑と、<br>「人に迷惑をかけるのは非効率」という合理性の判断と、<br>「人に迷惑をかけるのは悪」という脅し的な教育による盲信とがあるように思う。<br>「迷惑な存在は嫌だ」と一見同じことを言っていても、各々根は違っていると感じる。<br><br>迷惑な存在を見た時に、一斉にネガティブな反応を見せるという一体感はあるが、それぞれの悪感情の種類が違う。<br>悪感情の種類が違うということは、その対象の行動や対象そのものに対する評価が異なるということで、必然的にその先取る行動も違ってくるだろう。<br><br>同じものが核にある者同士は気が合うであろうと思うので、恐らく集団化していく。というか、他のものが核にある人間とは根本的に話が合わず相容れないということになると予想される。<br>そうなると、その集団内で同意される感じ方がそこでの常識になり、更に「別の尺度を元にして同じものを嫌っている」ということが理解しにくくなってくるだろう。同じものを嫌いなら、同じ理由で嫌っているはずだということになる。<br>それぞれ別の理由で嫌っているのだが、同じものを嫌っているという点では一致しているので、表面上自分と同じ価値観の人間ばかりのように思えてくる。そうすると自分の感じ方を批判的に見る気にはなるはずもない。<br><br>なまじ表面的に一致しているがゆえに、全ての人間のバイアスがそれぞれ強化されることになるのではないか。",
		"created": "2022/09/05 16:15",
		"edited": "2022/09/05 21:59",
		"editedFix": false
	},
	{
		"title": "▶220902 こだわりとこだわりでないもの、こだわるべきでないもの",
		"tag": "[感想・引用]/トンネルChannel/tks",
		"pin": false,
		"body": "[こだわりとこだわりでないもの、こだわるべきでないもの - by tks - トンネルChannel](https://tunnellingchannel.substack.com/p/5ab)<br><br>[>いいキーボードを使いたいこだわりはあるけれど、その種類にこだわりはないという感じです。]<br>ああ、この辺の「[[こだわり]]の種類」に結構温度差が生じがちというか、「途中で話が合わなくなる」みたいなことが発生しがち…。<br>私も「条件をクリアしているか」が大事で「これこそが自分にぴったり」ということには特にこだわっていない、みたいなことがしばしばある。良いものがほしくてそれについて語られている雑誌や記事を読んでみるも、マニアックなこだわりに基づいて熱心に語られていて、「なんか別にそこまで\"粋を極めた\"感のあるものがほしいわけじゃないんだよな」と思ってしまったりする。<br><br>[>こだわりはこだわりが過ぎると、それ以外の場面で使えなくなります。]<br>こだわりを持つと「拘り」という字義通りの事態が発生する。<br>そもそも、（もう広まりすぎていて論じてもあまり意味がないけど、）本来は「こだわり」って「吟味する」というニュアンスは無い気がする。「拘泥」「執着」は良い意味とは思えない。「自由ではない」という意味が本来の「こだわっている」ということだろう。<br><br>現代で普通に言われている意味（概ね良い意味）での「こだわり」を自分は何か持っているだろうか。<br>→[[私に「こだわり」はあるか]]",
		"created": "2022/09/08 11:50",
		"edited": "2022/09/08 12:23",
		"editedFix": true
	},
	{
		"title": "▶220906 「タスクリスト」に こだわらないことに こだわる。",
		"tag": "[感想・引用]/トンネルChannel/tasu",
		"pin": false,
		"body": "[「タスクリスト」に こだわらないことに こだわる。 - by tasu - トンネルChannel](https://tunnellingchannel.substack.com/p/007)<br><br>[>チェックボックス付きのタスクリストをなんだか「デイリーノート（日々のメモ置き場）」に置けません。]<br>わかる～<br><br>[>にもかかわらず、「過去の自分との約束」を破ると、少しだけ罪悪感を抱きます。また、「過去の自分との約束」にこだわって無理やりタスクを実行することは、とても息苦しいものです。]<br>わかる～～<br><br>[>この結論は、私が「タスクリスト」に圧を感じるようになったからです。][>本当は「自分との約束」についても、タスクリストがあった方が有効に機能するのでは、とも思います。でも、どうにもうまくいきません。]<br>わかる～～～<br><br>考えてみると、私は「[[タスクリスト]]」どころか「リスト」が苦手な気がする。<br>「結果的に生成された一覧」を見るのは好きなのに、「リストアップしていく、そして自分で作ったリストを見る」ということは全然好きじゃない。<br>好きじゃなくても無いと困るのでリストは作っているし使っているけど、「好きじゃない」という気持ちは持ち続けている。<br><br>でも「表」は好きなので、もしかすると「存在するはずの他のデータ」が「列」として居場所を得ていない状態が嫌なのかもしれない。",
		"created": "2022/09/08 11:26",
		"edited": "2022/09/08 12:30",
		"editedFix": true
	},
	{
		"title": "▶220830 RSSリーダーが好きです",
		"tag": "[感想・引用]/トンネルChannel/倉下忠憲",
		"pin": false,
		"body": "[RSSリーダーが好きです - by 倉下忠憲@rashita2 - トンネルChannel](https://tunnellingchannel.substack.com/p/rss)<br><br>[>今でこそプッシュ通知が当たり前になっていますが、はるか昔はお気に入りのWebサイトをブックマークしておいて、それらを一つひとつクリックして「訪問」することが当然のように行われていた時代からすれば、RSSリーダーというのは大きな進歩でした。]<br>懐かしい時代。その当時の方がサイトなり著者なりに思いを馳せていた気がする。IKEAの家具じゃないが、「手間をかけると大事に思える」ということもあるのかもしれない。<br><br>[>どちらにおいても、自分の好みのコンテンツが集まり、コンテンツ以外は存在しない状況です。非常に心地よい状況と言えるでしょう。それらのコンテンツはいつ読んでも構いません。読まなくても構いません。そういう自由な（あるいは関係性から切断された）付きあい方ができます。]<br>これは[[SNS]]とはちょっと違うかもしれない。誰が誰をフォローしているのかが判ってしまう状況下では、「読まなくても構わない」とは言い難い。[[RSS]]の購読は人間関係ではないが、SNSのフォローは人間関係に足を踏み入れている。<br><br><br>ツイートとして投稿した感想（[url](https://twitter.com/Foam_Crab/status/1564494234144497664)）<br>[>そういえば「フォロー」って、そうする意味とか理由とかいうのはこれと決まっているわけではないと思いますが、なんとなく、「あなたの発信をちゃんとチェックしますよ」という\"約束\"をしてしまっている気分になって気が引ける、ということが個人的にはあります。そんな決まりごとはないとは思いつつ。]<br>",
		"created": "2022/09/08 14:31",
		"edited": "2022/09/08 14:31",
		"editedFix": true
	},
	{
		"title": "▶220826 ブログとこんがらがった動機について",
		"tag": "[感想・引用]/トンネルChannel/倉下忠憲",
		"pin": false,
		"body": "[ブログとこんがらがった動機について - by 倉下忠憲@rashita2 - トンネルChannel](https://tunnellingchannel.substack.com/p/544)<br><br>（読んだ当初の感想ツイート）<br>後半について思ったのですが、読む側としても、読んでいて楽しいものというのは「利他性によってきちんと加工された自慢」なのかもしれません。<br>根っからの利他性によって役立つことを親切にシェアしてくれるものというのは、ありがたいものではありますが、「おおーっ」という感動は然程ないように思いますし、「楽しい」の核は書き手が自慢したいこと、つまり自慢したいと思うほどの何かの中にあるように思いました。だから個人ブログは楽しい。<br>だから個人ブログは楽しいし、Twitterもやめられないし、Instagramも廃れない。誰かにお金をもらえるわけでもないのにやり続ける動機は「どうだ！」というところにあり、「より広めよう」とするとその欲に名前をつけたくてだんだんこんがらがってきそうですが、「どうだ！」自体はシンプルに思えます。<br><br>---<br><br>[>私は「この空間で情報を利用するならば、自分もまた何かしらの情報を投下しなければならない」という気持ちを持っていました。言い換えれば、インターネットを利用するというのは受信と発信がセットになった行為なのだ、という理解があったわけです。]<br>これはあまり考えたことのなかった視点。言いたい気持ちが自分の内にあるから自然と発信していたけど、「インターネットを利用しているのだから」という理屈は私にはなかったかも。<br><br>[>このことを逆に見れば、私がブログを書くときには、「読みやすく、面白く、役に立つ」文章を意識していないことになります。だからこそ、ブログは楽しく書けるのでしょう。Twitterも然りです。「本」を書くときに一定のつらさ（あるいは負荷）がかかるのは、そうした指針を持っているからだとも言えます。]<br>私がnoteを書こうとして辛かったのはnoteでそれをやろうとしていた（というか”やらなければならない”と思っていた）からなのだろう。<br>（関連：[Noratetsu Lab: AutoHotkeyを使い始めた/noteを一年半ぶりに書いた](https://noratetsu.blogspot.com/2022/09/07-post.html)）<br><br>[>純然に利他性を持って人を楽しませようとしているのではありません。まず自分の言いたいこと・自慢したいことがあり、それを──ある種の「加工」を経て──楽しめるように表現すること。このねじくれた動機が、私のブログにはありそうです。]<br>自分の中であまりにも「普通」のことで、この状態を「ねじくれた」ものだとする発想が全くなかった…笑<br>オタク界隈に身を置いていたからかもしれないけれど、この動機は人間の「話」の基本だと当たり前に思っていた。それ以外の「書きたい」ってむしろ何だろう。",
		"created": "2022/09/08 14:33",
		"edited": "2022/09/08 14:47",
		"editedFix": true
	},
	{
		"title": "▶220822 それでもブログをやめない理由",
		"tag": "[感想・引用]/トンネルChannel/倉下忠憲",
		"pin": false,
		"body": "[それでもブログをやめない理由 - by 倉下忠憲@rashita2 - トンネルChannel](https://tunnellingchannel.substack.com/p/aa1)<br><br>[>Webは、片方に権威者がいて、もう片方に受益者がいる、という偏った構造になっていません。そこでは誰しもが、発信者=受信者なのです。そのラディカルさが、マスメディアによって作り出された一億総受信者のような息苦しさから開放してくれました。][>現在のWebは、どこかしらマスメディア的になろうとしています。あいだに線を引いて、発信者と受信者を切り分けるような視線です。あるいは、発信者でありながら、その責については受信者でありつづけようという姿勢です。]<br><br>マスメディア的になってしまうのは「参加者が多すぎる」からなのかもと思った。<br>自分の発信に責任を持って発信できる人間というのはきっとそう多くはない。少なくとも全人類がそうなのではない。<br>かつての[[インターネット]]は、インターネットというものを理解するハードルを飛び越え、インターネットの価値に感動し、インターネットをありがたく思える人が主体になっていたのではないか。もちろんみんながキラキラ感謝していたとかいう話ではなく、「ここは自分という魚にとっての水だ」という意識を持っていたのではないだろうかということだ。<br>インターネットが当たり前になり過ぎて「自分が自由になれるように整備されているのが当たり前」とかいう発想でいる人間が多数派になってくると、ニコニコ動画とかTwitterとか数々の場がそうなったように、「自分の権利ばかりを主張し、場の歴史を尊重するという発想のないマジョリティ」によって伝統は破壊され、マジョリティをコントロールしようとする人々が現れてマスメディア化する。<br>（※ここでの「マジョリティ」は[[イノベーター理論]]での「アーリーマジョリティ」「レイトマジョリティ」を踏まえて言っています。）<br><br>責任を持って行動できない人間が大挙して流入してしまうと、もう「自律ありきの自由」を維持できなくなる。誰かが何かの尺度で交通整理しなければならなくなり、結局、「ちゃんと考えられないあなたたちは私達の言うことを聞いていればいいんです」型の秩序に向かっていくのだろう。善人も悪人もそれぞれの理屈で大衆をコントロールしようとしてしまう。<br><br>どうにかできる道を模索したいとは思いつつも、個人的には「全員が来たらどうやってもそうなるだろうな」という諦めを抱いている。いつも「新しい世界」は「最初の何割か」しかいないから素晴らしい世界になるのであって、十割が来たらどんな世界も地獄である。十割どころか、五割も来たらもう不快感の方が目立ってくるだろう。<br>そうなると、常に新しい世界にいるという選択をするしか、あるいは既にイナゴの大群が飛び去った後の荒野に留まって耕し直すという選択をするしか、「マジョリティに合わせた世界」という地獄から逃れる術はないのかもしれない。",
		"created": "2022/09/08 14:51",
		"edited": "2022/09/08 16:07",
		"editedFix": false
	},
	{
		"title": "▶220818 最近のデイリーリスト運用について",
		"tag": "[感想・引用]/トンネルChannel/倉下忠憲",
		"pin": false,
		"body": "[最近のデイリーリスト運用について - by 倉下忠憲@rashita2 - トンネルChannel](https://tunnellingchannel.substack.com/p/d26)<br><br>[>私の経験から言って、私を苦しめるのがこの「テンプレート」なのです。そうやって規定（既定）のものを突きつけられるたびに、しんどい気持ちになってきます。だから、極力はゼロの方がいい。]<br>わかる…笑<br>便利で有用だから使っているはずなのにものすごい苦痛をもたらすのがタスクのテンプレート。<br><br>[>その代わり、リストに書かれていないことでも、実際に何かをしたらそれをリストに追記します。たぶん、これが一番のポイントでしょう。リストだけが行動を決めるのではありません。あくまで参考的・備忘的な存在という位置付けです。]<br>「[[タスクリスト]]」というものが重要になり過ぎるのが問題なんでしょうね。「頓珍漢な一日にしない」という道標になればいいのであって、「これに沿った一日にできないなら劣等生！！」みたいな謎の評価軸を作ってはいけない。<br>実際にしたことを後から追加してチェックを入れる、というのは前からやっていましたが、予め設定したタスクはなかなか進まない割に他のことは結構ガンガン追加されていくんですよね。もしかしたらその「なかなか進まないタスク」も「これができなきゃ劣等生リスト」に入れていなければさらっとできたのかもしれない（し、別にそんなことはないのかもしれない）。<br>いずれにせよ、リストに入れたことが自分にとってプラスになっていないならそのリストの意味って何という。<br><br>[>その意味で、大切なのは「それが自分を助けてくれるのかどうか」です。助けてくれないなら無理してやる必要はどこにもありません。誰かがうまくいっていても、自分がうまくいくとは限らないからです。同様に、「どうであったら自分は楽に感じられるのか」を気にしておくことも大切でしょう。ストレスフリーに至れなくても「何もしないよりは、ちょっとマシ」という状態に至れるならば、結構良いものです。むろん、生産性などは二の次、三の次になりますが。]",
		"created": "2022/09/08 15:41",
		"edited": "2022/09/08 15:53",
		"editedFix": false
	},
	{
		"title": "私に「こだわり」はあるか",
		"tag": "生きる/己を眺める",
		"pin": false,
		"body": "[[▶220902 こだわりとこだわりでないもの、こだわるべきでないもの]]より。<br><br>多分「物」には大した[[こだわり]]がない。自分に近づけたくない物というのはあるが、「これじゃなきゃ」的なものはあんまりない。そう思えることに憧れがあるので「これじゃなきゃ」と確信できる瞬間が来るのを心待ちにして自分を観察しているけれど、今のところは「ちょっと嫌かも」を感じて遠ざける、という程度に留まっている。（それでも自己観察の大きな成果ではある。）<br><br>一方、「（二次元平面の）ビュー」には並々ならぬこだわりがあるかもしれない。<br>何がどの大きさでどういう色合いでどう配置されているべきか、ということに対して神経質な自覚がある。<br>なので自分でツールをせっせと作っているし、作れるようになったことでとても元気になった。<br>でも三次元にはさして興味がない、3DCGにはそれほど食指が動かないし、「物」にこだわりがないというのもそういうことかもしれない。人にもこだわりがない。[[時空の共有に憧れない]]というのもそう。いや、時空ということは四次元か。四次元には三次元以上に興味がないようだ。<br><br>逆に次元を下げて一次元にするとどうか。つまり「文」だ。<br>こちらもこだわりは強いかもしれない。特に小説は、ストーリーの良し悪しの判断以前に、最初の数行の語り口で自分に合うか合わないかを判断してさっさと切ってしまうことが多い。自分の世界に入れるか否かの判定の厳しさで言えば、二次元平面のこだわりよりシビアな気もする。<br>単語についても自分の感覚に一致するか厳密に考えているところがある。前々から「[のらてつワールド](https://scrapbox.io/noratetsu/%E3%81%AE%E3%82%89%E3%81%A6%E3%81%A4%E3%83%AF%E3%83%BC%E3%83%AB%E3%83%89)」と称して言葉の言い換えを試みている。自分の感覚に合わない単語は覚えられないし、それについて考える気も失せてしまう。かなり拘泥している。<br><br>「次元」という尺度で整理したことはなかったが、こうしてみると自分のこだわりは割と明らかな感じがしてくる。次元が減るほど神経質で、次元が増えるほどどうでもいい。二次元まではこだわりを持っており、三次元からは鈍感になる。言葉には敏感だが、時間の流れには全く興味がない。例えばウェーイな感じの人とは真逆な気がする。",
		"created": "2022/09/08 15:57",
		"edited": "2022/09/08 16:00",
		"editedFix": false
	},
	{
		"title": "▶220809 ライフ・アウトライン実践0-3　ライフ・アウトラインの機能と構造",
		"tag": "[感想・引用]/note/アウトライナーライフ（Tak.）",
		"pin": false,
		"body": "[ライフ・アウトライン実践0-3　ライフ・アウトラインの機能と構造｜Tak. (Word Piece)｜note](https://note.com/takwordpiece/n/nae50a03c5c56)<br><br>ライフ・アウトライン<br>　DO-DAYS（日々のDO）<br>　DO-ALL（すべてのDO）<br>　LIFE-AS（関係）<br>　LIFE-BE（自分）<br><br>[>「4つの機能」と書きましたが、4つの独立したアウトラインがあるわけではなく、あくまでもそれぞれが作用し合うひとつのアウトラインです。]<br>さらっと書かれたこの一文が超大事であり超忘れやすいことという感じがする。<br>アウトライン構造を扱う都合上、ビューとしては箱が分かれているような見た目をしてしまっているけど、内容は柔軟にあっち行きこっち行きするものだ、という意識をちゃんと持っている必要がある。<br><br>個人的には「すべてのDO」についてはどちらかと言うと「包括的なDO」というイメージかな、と思った。<br><br>ところで日々発生・入手する色々な情報について然るべき形式と場所を考えてだいぶ解決しつつあるのだけれど、Tak.さんの仰るLIFE-ASとLIFE-BEの部分にはまだ決着がついていない。<br>不定型過ぎてフォーム的イメージが浮かばないからかもしれない。規格を考える意味がないというか。その点で、なるべくプレーンなアウトライナーというのがやはり強いのかもと思う。<br><br>[[Dashboard.html]]にうまいことどうにかしたいと思っているけどまだ考え中。",
		"created": "2022/09/08 16:26",
		"edited": "2022/09/08 16:41",
		"editedFix": false
	},
	{
		"title": "▶220820 ライフ・アウトライン実践1-1　DO-DAYSのいちばんシンプルな使い方",
		"tag": "[感想・引用]/note/アウトライナーライフ（Tak.）",
		"pin": false,
		"body": "[ライフ・アウトライン実践1-1　DO-DAYSのいちばんシンプルな使い方｜Tak. (Word Piece)｜note](https://note.com/takwordpiece/n/n81f79a80ea37)<br><br>[>後は上から順にひとつひとつ実行していきます。ポイントは、ひとつの「やること」に手をつけたら終わるまでなるべく他のことは考えないこと。そのことだけに集中する。終わったら次の項目に取りかかり、同じようにその項目だけに集中する。これを時間切れになるまで繰り返す。]<br>さらっと書いてあるけどそれが最大の難関…笑<br>アウトライナーにしろテキストファイルにしろ、「リスト」をうまく使えるかどうかは「これに集中する」ができるかどうかにかかっているような。（ADHDと診断を受けたわけではないけどADHDで言う「不注意」傾向が強いのでしんどい。多動性はないので身体的に大人しくしていることは苦ではないけど。）<br>もっと有機的な形で進捗が可視化できたら「上から順に片付ける」をしてケリをつけていかなくても管理できるはずだけど、文字入力以外に可視化の手段がない以上そういうことはできないのが辛いところ。<br><br>関連：[[アイビー・リー・メソッド]]",
		"created": "2022/09/08 16:54",
		"edited": "2022/09/08 17:13",
		"editedFix": false
	},
	{
		"title": "▶220903 ライフ・アウトライン実践1-2　DO-DAYSに「選択」の機能を追加する",
		"tag": "[感想・引用]/note/アウトライナーライフ（Tak.）",
		"pin": false,
		"body": "[ライフ・アウトライン実践1-2　DO-DAYSに「選択」の機能を追加する｜Tak. (Word Piece)｜note](https://note.com/takwordpiece/n/nfc8c8bcad13d)<br><br>[>でも、6個の枠のあるなしに関わらず、書き出したことが全て終わること自体が稀なのです（ですよね？）。いずれにしても全部は終わらない。つまり、結果的には無意識に選択していることになる。]<br>そうなんですよね。<br>どうせ自分にできる範囲のことしかできていないのだし、その範囲を予め可視化するかどうかの話ということになる。<br>その枠の不安感はなんとなくわかる…と考えて今思ったけど、これもし「最初の6個」あるいは「7個目以降」を自動で色変更すれば「枠」を決めてしまっている感は気にならないかもしれない。<br>自分の意思で落とすとか戻すとかということをするからなんとなく摩擦を感じる気がする。並べ替えた上に、更に「落とす」をするのは認知資源の消費を感じる。<br><br>ただ既存のアウトライナーにそういう機能をつけるのはちょっと難しい（全ての親子関係について6個目までの色を変える、ということはCSSでできるだろうけど…）。<br>自分でツールを作るとしたら、そういう可視化の方法も考えても良いかもしれない。",
		"created": "2022/09/08 17:15",
		"edited": "2022/09/08 17:24",
		"editedFix": false
	},
	{
		"title": "▶220830 自信とひねくれ者チャレンジ",
		"tag": "[感想・引用]/note/倉下忠憲",
		"pin": false,
		"body": "[自信とひねくれ者チャレンジ｜倉下忠憲｜note](https://note.com/rashita/n/n261edd89da0b)<br><br>[>なんにせよ、自信のないことがあるとして、ぼーっと待っていたら突然自信がふって湧いてくる、みたいなことは起こらないでしょうから（B級少年漫画ですらなさそうな展開です）、ちょっとずつでもチャレンジしていけたら、Feel so good です。]<br>そうなんですよね…笑<br>「自信がない」に対してできることは「やる」以外にない。<br>なので、やった時に自信をますます損なわせそうな環境でない場所を探して「やる」ということが大事だなと思う。<br><br>例えば日本にいる間に英語を習得するのが難しいのも、英語が難しいからではなくそういう環境を得ることが難しいからだろうと思う。",
		"created": "2022/09/08 17:27",
		"edited": "2022/09/08 17:31",
		"editedFix": false
	},
	{
		"title": "話の通じないジェットコースター人間",
		"tag": "生きる/自意識との折り合い,生きる/自分を守る",
		"pin": false,
		"body": "[「彼」自身の言葉で、語るべきではないか――料理と食を通して日常を考察するエッセイ「とりあえずお湯わかせ」柚木麻子｜本がひらく](https://nhkbook-hiraku.com/n/n2e8e11f7d8fd)<br>　こちらの記事を読んだ。渦中の俳優の件を受けてのものである。<br>　筆者の方については著書も他の記事も読んだことがなく、どういう方かはよく存じ上げないし、「彼」をどれほど好きでいたのかも知らない。でも悲痛さは重く伝わってくる。<br><br>　こういう記事について言及しようとすると、別の視点を持った誰かに「お前は視野が狭い！こうだから困るんだ！」と怒られる可能性がちらついて気が重くなるのだが、まあいきなりそういう態度に出る人間というのはそれもそれで十分視野が狭い気がするので殴りかかられたところでおあいこだろう。<br><br>[>「彼」のファンだと常日頃公言していたせいで、マスコミ各社からの原稿依頼は後を絶たない。そのほとんどが「推しが性加害者になった時、ファンである私たちはどうすればいいか？」というものだった。]<br>　なんとまあグロテスクなことよ。各々一人で静かに考える時間を持つという概念はマスコミにはないのだろう。何もしなければ金にならないし、存在感がなくなるしな。どうすればいいかって、そんなの自分自身で考えさせたらいいんじゃないか。「家族が加害者になったら」なら話は別だが、誰かを「推す」ということに伴う苦しみくらい自力で戦ってくれと思う。<br><br>[>だから父には、間違いなく感謝している。金銭的にも、学生時代は何不自由なく暮らさせてもらった。にもかかわらず、私は父が亡くなった時、心底ほっとした。][>なぜかというと、父の感情は常にジェットコースターだったからである。機嫌が良いかと思うと次の瞬間、怒り出す。見極めたくて一度「父の感情怒号線」グラフを作ったことがあるが、法則はわからずじまい。]<br>　これは「よくある」構図なのだと思う。「よくある」の「よく」が具体的に何割になるのかはわからないのだが（思っているよりは少ないかもしれないし、やっぱり十分に多いかもしれない）、誰もが「ああ、このパターンか」と具体的な誰かを思い浮かべながら辟易するくらいには「よくある」話だ。<br>　別に男に限ったことではなく、女はヒステリックでどうこうとかいう話がかつてはよくされていたことからしても、自己の形成に失敗した人というのは男女関係なくこうなるものだろう。いきなりキレる男もいるし、いきなりキレる女もいる。<br>　ジェットコースターになるのは善性と憤怒がせめぎ合っているからだろう。そのせめぎ合いが「ほどけばほどける」のか、「生まれつきせめぎ合うしかない」のか、多分人それぞれなので人物像をこれと言えるわけではない。ただ、わけのわからないことになっている己が情けないとか正しくないとか思う感受性があることでますますわけがわからなくなっているようには思う。というか正直に言うと私自身が若い頃の数年間ジェットコースター人間だったので、あの感覚かなと重ねて見てしまうところがある。<br>　憤怒の根は「今」ではなく「過去」にある。善性によって憤怒に蓋をしようとしても、中から噴き出して結局爆発する。その蓋が開くタイミングというのは「今」とはあんまり関係がない。きっかけになるものがあれば爆発しやすいが、同じきっかけに必ず同じ反応をするわけでもないし、きっかけがなくとも蓋は開いてしまうのである。<br><br>[>なによりも、「彼」が実の父親とうまくいっていない事実が、私の心をブチ上げてしまう。あんなに成功した男性が人生をかけて歩み寄っても、父親とうまくいかないことがある、というのは私にとって一種のお守りであった。]<br>　「彼」については、これがやはり気にはなってしまう。「うまくいかない」というのは、「うまくいかない」の七文字では到底まとめられないような混沌が渦巻いている。そのうまくいかなさというのは、一体どうしたら消化できるのか。<br><br>[>本や雑誌を読み漁り、父のあらゆる感情の変化に対応可能な豆知識を用意しておくことも忘れない。例えば、父がテレビで嫌いな芸能人を見て激昂したら、その芸能人の隣にいる俳優のものすごく変わったエピソードをぶつけにいく、といったファインプレーで場を収めた。]<br>　涙ぐましい努力。でも私自身もそれをやっていた（父親に対してではない）。私はなるべくニコニコしながら、少しでもポジティブな方向に話題が向くようにずっと気を張っているわけだ。「あっ、これ次の一言こう来るやつだな」ということを察知して、それが発動する一瞬前に別の話をして封じたり、間に合わずやられたら繋ぎの言葉を入れながら他のものに注意を向けさせる。<br>　そうやってコントロールされてる大人って何？という感じだし、まあ相手も自分がコントロールされていることをわからないわけでもないだろう。人を不快にさせている自覚から、年少の烏滸がましいコントロールを「受け入れてやってる」というだけのことである。<br><br>　こういう男もよくいるし、こういう女もよくいて、周りが上手く立ち回ってやり過ごすのが以前の常識だったわけだが、みんな「まあまあ、よくあることじゃないか」と言って宥め合っていても、みんな内心ではそれらを全く許していなかったのだと思う。許したポーズを取らないと自分が社会からはみ出してしまうからそういうことにしていただけで、本当は全然許していない。<br>　でもポーズとして許された人々は、もちろん自分が歓迎されていないことは察しながらも、しかし「（表面上）許された」という実績によって自分自身を正当化してきた。そして、これまで許されたならこれからも許されるはずだ、そうじゃないならどうして自分はあの人を許さなきゃいけなかったんだ、という脅しと恨みでガチガチに鎧を作っている。それもある意味で尤もではある。ちょっと先に生まれただけで逃げ切った連中というのが山程いるのだ。そいつらに対する不公平感を解決するのは容易でないと思う。<br>　でも。もう「許されない」ということが社会によって決定されてしまったと思う。不公平だが、聞き入れなくては生き残れない。これまで本当は許していなかった人たちは、もう許したポーズを取ってはくれない。<br>　幸い、自意識の肥大が起こった経緯について理解を得ることは、昔よりずっと易しくなっていると思う。これからも易しくなっていくだろう。だからって「暴走する人がいなくなってみんなハッピー」ということにはなりそうにない。自意識の肥大化に対する無知を責め合い、ちょっとでもマシな側がちょっとでも後ろにいる人間を攻撃するということが常態化するのだろうし、結局平和な日なんてのは来ないだろう。<br><br>　それでも、あからさまに攻撃性を振りかざされて一撃で精神（場合によっては生命）を殺される機会が減れば随分「マシ」だ。誰かに手を上げたり性的にアクションを起こしたりするハードルはもっと上がるべきだと思う。やってしまったら自分の社会的地位が終わるというほど「やばいこと」だということを胸に刻んでほしい。<br><br>　それにしても。<br>[>語るべきは「私」や「私たち」ではなく、「彼」自身なんじゃないのかな？]<br>[>「彼」のファンだった私に原稿依頼多数という現状は、あまりにも加害が当たり前だから、よっぽど気をつけていないといつの間にか加害に加担させられかねないこの社会を、個人の知恵や直感やセルフケアでなんとか生き抜いてください、とぶん投げられていることの表れではないか。]<br>　これは本当にそうだよね。割と冗談じゃない話だなといつも思っている。「した方が良い」は「すべき」に容易に入れ替わるし、被害者の側が頑張ってしまえばしまうほど、被害者の側に課せられる「べき」は増えていく。<br>　女が一人でいたら襲われても当然だみたいな話もよく聞くが、「襲われる危険性がある」ということと「襲われても当然だ」ということは全く違うと思う。当然ってなんだよ？　「襲われたくなかったら〇〇しろ」って、それは自分自身が「襲われたくないから〇〇しよう」と考えることであって、人に高圧的に言われるようなことじゃないんですよ。脅迫だろそれ。そもそも誰だよお前。",
		"created": "2022/09/09 18:23",
		"edited": "2022/09/09 22:09",
		"editedFix": false
	},
	{
		"title": "▶160718 ３つのオリジナリティ",
		"tag": "[感想・引用]/個人ブログ/gofujita notes",
		"pin": false,
		"body": "[３つのオリジナリティ | gofujita notes](https://gofujita.info/notes_originarity.html)<br><br>（咀嚼）<br>①給料と投資に対する責務として発揮しなければならないオリジナリティ<br>②個人が前に進むために自力で問いを立てる力としてのオリジナリティ<br>③人類に新たな知をもたらすことこそを追求する高次のオリジナリティ<br><br>[>「自分で見つけた問いを自分のやり方で解いたのなら、それでかまわない。ほかのだれかが先に答えを見つけて論文にしていたとしても、それがどうしたと言うんだ。論文を書く手間がはぶけるじゃないか。そしたら、その次の問いに進むことができる..」]<br><br>「独自性」の「自」がどこにあるか、ということなのかもしれない。<br>「わたしたち」なのか？<br>「わたし」なのか？<br>「われわれ人類」なのか？",
		"created": "2022/09/12 11:24",
		"edited": "2022/09/12 11:54",
		"editedFix": false
	},
	{
		"title": "2022-09-13",
		"tag": "日記/2022/09",
		"pin": false,
		"body": "[[茶の間]]の本文部分をMarkdownにするかどうか考えている。<br>今はMarkdownを参考にしながら独自記法を使っていて、ルール毎にmatchしてreplaceを繰り返してHTML要素を整えている。<br>でもそれだと色々限界があって、例えば箇条書きを作るとかはちょっと面倒でやれていない。やれなくはないけど、メンテナンスが困難になっていく予測がつくことから面倒くささが強い。<br>markedライブラリで一気に変換してしまった方が楽だし、自分用の日記はmdファイルをmarkedでHTML化して表示している。<br>変更すると過去に遡って記法を改める必要があるのが億劫だけど、やるなら早いうちにやった方がいいよね…。",
		"created": "2022/09/13 12:23",
		"edited": "2022/09/13 12:29",
		"editedFix": false
	},
	{
		"title": "けしからんマンには悪の濃淡がない",
		"tag": "生きる/自意識との折り合い",
		"pin": false,
		"body": "どこを向いてもけしからんけしからんと怒っている人には、「悪」の程度の区別がないように見える。\n「最良ではない」だけのものも殺人も同じ熱量で怒っている。\n\nだから「加害者」も「もしかしたら被害を回避できたかもしれない被害者」も同じだけ「悪」として扱う。\n芸能人については、薬物使用も暴力も性加害も、あるいは失言も不倫も、同じように「けしからん」になる。\n漫画のコメントには作者に対する批判、キャラに対する非難が「本当に怒っている」ような感じで書かれる。\n\nけしからんけしからんけしからん。\n\nそういう彼らこそけしからん。",
		"created": "2022/09/13 18:22",
		"edited": "2022/09/13 18:35",
		"editedFix": false
	},
	{
		"title": "（？）という書き方",
		"tag": "",
		"pin": false,
		"body": "日頃、特にTwitterに書く時に、「（？）」という表記をしばしば使っている。\n一応そう表現するが、本当にそうかは疑わしい、みたいなニュアンスだろうか。\nあるいは、「何言ってんだお前は」とツッコまれそうなことを敢えて書いて、ツッコミどころですよと示す時に使っているだろうか。（更に、ツッコミどころですよと示しながら、しかし既に自分でツッコんでいるのでツッコミは不要ですよ、というメッセージも込められているように思う。）\n\nこの用法がいつからあるのか考えたことがなかったのだが、本多勝一著『〈新版〉日本語の作文技術』を読んでいたら、\n[>さらに高度な（？）場合を考えてみよう。]\nとあるのに気がついた。まさに昨今使われている「（？）」と同じニュアンスだろう。\n直前の場合より少し複雑ではあるが、「高度」という言葉が本当に適切かは怪しい、というような意味が込められている気がする。大袈裟だとわかって言っている、という感じだろうか。\n同書内に少なくとも他に二箇所はこれが登場する。旧版は読んでいないので、当初からあるのか追加されたものなのかわからないが、思っていたより古くからある表現なのかもしれない。これまで「（？）」の存在に気をつけて読んでいなかったので、もっと古い本でも普通に使われていた可能性もある。\n\nこの表記の意味について誰かに教わった覚えはない。他の人々がこれを使っているタイミングから、ニュアンスを察しとって意味の見当をつけているだけだ。そもそも意味というほどの何かがこの表記に伴っているわけではないようにも思う（はっきりした意味があるなら言葉で書くはずである）。雰囲気、あるいは表情のコントロールのための、絵文字的な表現の一種なのかもしれない。",
		"created": "2022/09/13 18:46",
		"edited": "2022/09/14 16:31",
		"editedFix": false
	},
	{
		"title": "○○なんかしてるから××なことになるんだ",
		"tag": "生きる/自意識との折り合い",
		"pin": false,
		"body": "と言いたがる人というのがいる。\nそれが口癖の人はなるほど賢く大人しくしていて目立たないので、自分が誰かにやっているように他の誰かから詰られることはない。\nでもそういう何もしない人間は、世界にとって「いてもいなくても同じ」だな。",
		"created": "2022/09/16 15:57",
		"edited": "2022/09/16 16:00",
		"editedFix": false
	},
	{
		"title": "物やファイルを整理したい時は文章を書きにくいかも",
		"tag": "生きる/己を眺める",
		"pin": false,
		"body": "ここ数日整理整頓に勤しんでおり、その直前まであんなに「バリバリ書くぞ」モードだったのが嘘のように「書くことに興味がない」モードに切り替わってしまった。\n\n基本的に関心の対象が移ろいやすく飽きっぽい性質なのだが、「片付けたい」と「表現したい」の間は短時間では行き来しづらく二者択一かもしれない。",
		"created": "2022/09/20 23:10",
		"edited": "2022/09/23 12:21",
		"editedFix": false
	},
	{
		"title": "2022-09-22",
		"tag": "日記/2022/09",
		"pin": false,
		"body": "もはや戦争を仕掛けた側が勝つという構図自体が許されていない世界観に於いて戦争を仕掛けて、そこに未来はあるんだろうか。戦に勝っても輝かしい未来などないような気がするけども。\nもしプーチンひとりがその気になっているだけならプーチンがいなくなった時点で問題は解決されるかもしれないが、ロシア国民それぞれにうっすら世界に対する不満があるとすれば、プーチンひとりがいなくなっても話は終わらないのだろう。\n\n世界の警察を気取っているアメリカや世界の規範かのような顔をしているヨーロッパが歴史上やってきたことについて、他の国々はどう決着をつけたらいいのだろうか。\n日本は持ち前の「長いものに巻かれながら自文化を当たり前に守る能力」を発揮して敗戦早々親米に舵を切りながら平気でいるように思うが、他の多くの国・地域はそういうふうにはなっていない。\n欧米がでかい面をして世界を支配したことによって、混沌は解消され世界が「安定」したかもしれないが、欧米以外の地域には欧米に支配される筋合いなどそもそもない。\nこのねじれを解決する術はあるのだろうか。",
		"created": "2022/09/22 12:11",
		"edited": "2022/09/23 12:21",
		"editedFix": false
	},
	{
		"title": "▶220914 実は大切なファイル・システム",
		"tag": "[感想・引用]/トンネルChannel/GoFujita",
		"pin": false,
		"body": "[実は大切なファイル・システム - by Go Fujita - トンネルChannel](https://tunnellingchannel.substack.com/p/255)\n\n[>OSのファイルシステム検索に時間がかかった頃は、苦労するときもありました。大きなフォルダ3つくらいをつくるという習慣は、この検索を少し速くするためのしかけでした。][>大きなフォルダすら要らないかなと思うほど、このやり方が便利になったのは、たしか2017年頃。macOS の Spotlight の検索機能が強力かつ高速になってからです。]\nこういう、構造の是非そのものとは関係ない要素に左右されるところがあるのも情報整理の厄介なところ。技術の進歩によって、最初からそうできるならそうしたかったけどできなかったこと、がどんどんできるようになっているのだろう。\n\n[>気をつけているのは、フォルダ単位のクローンをつくらないこと。忙しいと、あっというまにどちらに何を入れたかが分からなくなるからです(笑)。]\nこれは本当に大事…。フォルダ単位のクローンをあちこちに作ったせいで後からわけわからないことになって苦しむということを何度も繰り返しました。\n\n[>で、なんで今さらドミニクさんのことなぞしらべているのかというと、そろそろ macOS からもできれば少し距離をおいて、たとえば Linux というOSを小さくて安いPCで使ってみたいと考えるようになったからです。]\nなるほど。シンプルなものに還りたい、みたいな感覚を私もしばしば感じます。\n高度化すればするほど、自分には正体のわからないものに依存することになる。自分の感覚と乖離が生じても、それを擦り合わせる術はない。誰かが考えたデザインに則って生活しなければならないということに、時折息苦しさを覚える。",
		"created": "2022/09/23 12:19",
		"edited": "2022/09/23 12:36",
		"editedFix": false
	}
]