[
	{
		"date": "2123-02-08",
		"text": "【説明】\n・タイトルクリック → 一番上に戻る\n・日付指定 → その日付の欄があればそこまでスクロール（なければ無反応）\n・Noratetsu's page クリック → のらてつの各生息地へ"
	},
	{
		"date": "2023-03-07",
		"text": "Mastodonに関して。\n私としては話題を共有できる人と知り合いたい～とかいう気持ちはほぼなくて、人間的相性が近い人とたまたま巡り合えばそれでいい。人間的相性は「話題」では判断できない。\n\nローカルタイムラインとか連合タイムラインってそんなにありがたいものなんだろか。ありがたいものなんだろうな。でも、最初にMastodonを使った時のインスタンスがPawooだったこともあってか、なんか無理だなという印象の方が強い。\n昔触ったTrickleというサービスに全体タイムラインみたいなものがあったが、それもなんだか嫌な思いしかしなかった。Trickle自体は面白いサービスだが、Twitterから逃れてきて「こここそ理想の空間に！」と猛り立った住人の議論には辟易した。わざわざ見に行って不快な気分になっている自分自身が不愉快だった。でも全体タイムラインがなければどんな人が存在するのかもわからないというのも「それはそう」ではある。私も発掘がしたくて見に行っていた。\n\nだけど、激流に直接触れるのではなく、「知り合いのシェア」「単語の検索」で存在を知っていく方が健全だなと感じる。Twitterは基本的にそうだったからやりやすかった。「全体タイムラインに流れるかも」と思いながら投稿なんかしていられない（ので、常に未収載にしている）。自分の投稿の読者は「フォロワー」である。不特定多数に向けて言っていない。\n\n個人的に分散SNSに求めているのは棲み分けではなくリスクの分散。使っているサーバーがなくなっても、引っ越してまた同じ規格のサービスを利用し続けられること。\nしかし、Fediverseに関する話を見聞きすると、そもそも自分はもうSNSから降りたほうがいいかも、という気持ちになってくる。引っ越してまでやる意味は私の中ではもうないかもしれない。"
	},
	{
		"date": "2023-02-13",
		"text": "　ずっとローカルサーバーというものがよくわかっていなかったが、何をどうすればローカルファイルの読み書きができるかをやっと掴んだ。\n　HTMLで読み込むjsからはアクセスできないしNode.jsのライブラリも使えない。じゃあどうするのか？\n　ローカルファイルの読み書きを含むNode.jsのライブラリでの処理はローカルサーバーを立てるjs（コマンドプロンプトで実行するjs）の中に書いておき、HTMLで読み込むjsからはFetchAPIでGET/POSTして処理する。なるほど。わかってしまえば「な～んだ」という感じだ。サーバーサイドとクライアントサイドというのが実感として解った感がある。\n　Electronでやっていたことを順次ローカルサーバーへのアクセスでやれるようにしようかなと思う。"
	},
	{
		"date": "2023-02-11",
		"text": "　私は万事に於いて自分の中にビフォーアフターがある。人生の折れ線グラフに明確な「折れ」が生じたポイントがあるからだ。その「折れ」によって全ての角度が変わったので、昔はこうで今はこうという比較が生まれる。\n　私にとっては「折れ」の地点の存在は当たり前すぎることなので意識していなかったけど、「折れ」があるというのは万人共通のことではないわけだよね。私自身、「折れ」がない期間の中での比較は曖昧でうまくできない。\n　この「折れ」はステータスとかキャリアとかではなく人格的な転換なので、全ての角度が変わるということになる。\n　「折れ」が生じたことによって、折れの前の状態の言語化が可能になっている。そのことによって、自己を対象として言語化する能力みたいなものを獲得したような気がする。\n　折れ以前の自己は既に主観からある程度離れているので、自己の言語化が合っていない時にいやこれ合ってないなと判断が可能になっているところがある。一般的に言って「今の自分」についての言語化は誤る可能性が結構高い。\n　自分について「○○だとは思いたくない」みたいな要素があるとその分だけ歪む。「折れ」の前の自分はもう徹底的に腐して構わないので、歪みは少なくなると思う。しかし逆に露悪趣味に走ると駄目な自分自慢みたいになってそれもそれで歪む。ただ淡々と、過去の自分はこうだったと考えていく。\n\n　　*\n\n　他人の分析より先に自分の分析を身につけるべきだと思うけど（敢えて「べき」と言う）、学校教育を振り返ってもまず他人の分析からスタートしていると思うし、人生通して他人の分析だけで終わるパターンの方が多いと感じる。\n　あと自己分析というのは「理想に達していない要素の洗い出し」ではない。己の主観に対して誠実になる必要がある。\n　というか、他人の分析からスタートするのはいいけど（自己の相対化は子どもには難しいし、且つ社会に目を向ける力も養わなければならないので）、最終的に自己に戻ってくることを強く印象づける必要があると思う。まあ、先生たちが頑張っても無理なものは無理かもしれない。親が内省的でなければ響かないし、子ども達で社会を作っている時点で望み薄な感もある。\n（単に愚痴であり、言ってもしょうがない系のあれです。）"
	},
	{
		"date": "2023-02-10",
		"text": "　自分は騙されない、という自負を持っているのはもう半分騙されているようなものだなと思う。\n　詐欺師より自分の方が賢いと思っている。つまりプロの策謀をナメている。\n\n　自分の親も詐欺に引っかかる人間を散々馬鹿にしていて、「自分は引っかからないと思っている人が引っかかるんだよ」と言っても「ふふっ」と笑っていて、そして案の定引っかかって私が詐欺師の電話に出て片付けてやった。犯罪者をナメるんじゃない。自分が倫理的であることは何の防壁にもならない。"
	},
	{
		"date": "2023-02-08",
		"text": "　のらてつの茶の間をリニューアル。\n　極限までシンプルに。必要な機能があれば後から付け足していく。\n\n　難しいものを作れない結果の単純さと、やろうと思えばできる中での敢えてのシンプルさとでは感覚的に全然違うという感じがする。\n　より複雑なものを作ろうとすることに慣れてきていたので、今度は必要最小限のラインがどこにあるかを追求してみようと思う。\n\n　　　*\n\n　Nostrにアカウントを作ってはみたが、秘密鍵が漏洩したらなす術がないのと、あまりに手続きが簡単すぎてどう考えても極度の無法地帯になる未来しか見えないのが不安。\n　それにTwitterとMastodonとNostrと、ほぼ同じ形態のサービスを同時に三つも使うのは非現実的。読む側も一体この人はどこにいるのかと思うだろうし、どこかに落ち着いた方がいいと思うが（あるいは全部に全く同じ投稿をするか）、その選択としてNostrが一番上にくることはないなと思った。\n　自分はTwitterの検閲に憤りを覚えているわけではなかった。Twitterは企業が運営するサービスであって、企業として許容しないものが排除されることには特に文句はない。なので、「自由」を求めて作られた類似サービスに惹かれるわけではない。Mastodonもそう。常識から逸脱することが気持ち良いタイプの人の溜まり場にいたいわけではないし、誰によってどういうルールで運営されているインスタンスなのかを踏まえて選択することが重要なのだろう。\n　これは偏見だが、ダークテーマのツールってなんかダークなものが溜まりそう。ダークテーマは非現実なデジタル世界の象徴だと勝手に思っている。目には優しいかもしれないけど。\n\n　自由を「勝ち取る」という必要に迫られたことのない、戦後日本のぬるい世代の感覚で自由を考えていると、ややもすれば強大な敵に簡単に潰されてしまうのだろうと思う。それはわかっている。しかし感情的には、許される限界を試すような逸脱に溢れた世界にいたくはない。自由＝非常識でいていい、という感性とは距離を置きたい。\n　でも、そんなことを言うのならばそもそもインターネット世界になんか来るな、ということにもなるのだろう。インターネット世界がこれまでそうだったようにこれからも「良識が大事なら来るな」という世界であり続けるのかどうか、それはわからないが。"
	},
	{
		"date": "2023-01-10",
		"text": "　去年は自己を解体する年だったような気がする。自分の成分を取り出し、言語化して小さなパーツにしていった。どこが尖っていてどこが凹んでいるのか、みたいなものを観察した。\n　今年はそれらのパーツを用いて自己を再構築する年になるだろうと思う。既に色々と「パーツがハマる」という感触を得ている。例えばこの場もそう。「うまくハマっていない」感じを解消する形態というのが見えてきた。\n　なお一昨年（2021年）は自己を顕現させた年、という感じだろうか。その前の時点では創作によってオリジナリティを表現していて、それはそれでそれなりのものになっていたが、自己そのものの表現というのはむしろ忌避される空間でもあったし、あまりやらずにいた。自己を表現の対象物にするようになったのが2021年という年だと言えるだろう。\n\n　こういうサイクルは多分これまでも小さく繰り返していて、顕現・解体・再構築はいずれも初めて行われることではないわけだけど、多分サイクルは周回ごとに規模が大きくなってきているし、渦が下から上へ直径を大きくしていくような感じのものだと思う。"
	},
	{
		"date": "2023-01-09",
		"text": "　自分で意識できていなかったけど、茶の間は「Scrapboxの延長上にある、Scrapboxで不便だった部分をクリアした場」という発想と、「世界への物申している度を下げるためにパーマリンクを廃して『記事感』を無くした場」という発想の、全く別ベクトルの要求が合体したものだった。\n　重要なのは後者の方だったが、良いアイデアを閃いて且つ実現できたということから前者の形態を前提にして考えてしまっていた。\n　前者のアイデアは普段使っている自作デジタルノートツールに反映されているので、「のらてつの茶の間」と名付けた空間でその形式を取っている必要はない。"
	}
]
